[
  {
    "product_id": 1,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "High Neck Peplum",
    "brand": "Coutique",
    "price_sale": 32.99,
    "price_actual": 42.99,
    "price_savings": 10,
    "short_desc": "Mumblecore pok pok kombucha letterpress, distillery live-edge yuccie iceland air plant chicharrones hella lo-fi brooklyn tilde everyday carry. DIY tilde tattooed meh, fashion axe godard next level slow-carb...",
    "long_desc": "Mumblecore pok pok kombucha letterpress, distillery live-edge yuccie iceland air plant chicharrones hella lo-fi brooklyn tilde everyday carry. DIY tilde tattooed meh, fashion axe godard next level slow-carb copper mug +1. VHS pork belly poke la croix street art celiac, vaporware vice. Plaid photo booth salvia, cronut master cleanse banjo ethical tousled chia squid bicycle rights chicharrones pour-over austin mumblecore.",
    "rating": 2.7,
    "rating_count": 190,
    "color": [
      "red",
      "blue"
    ],
    "size": [
      "x-small",
      "large",
      "small",
      "medium"
    ],
    "thumbnail_url": "teal-t-shirt_4460x4460.jpg",
    "image_url": "teal-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 2,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Sweaters and Cardigans",
    "product_name": "Button-up Sweater",
    "brand": "Frockzy",
    "price_sale": 32.99,
    "price_actual": 67.99,
    "price_savings": 35,
    "short_desc": "Banh mi artisan godard stumptown, polaroid woke food truck 8-bit subway tile sustainable you probably haven't heard of them keffiyeh literally. Cliche williamsburg cornhole austin fanny pack. Selfies next...",
    "long_desc": "Banh mi artisan godard stumptown, polaroid woke food truck 8-bit subway tile sustainable you probably haven't heard of them keffiyeh literally. Cliche williamsburg cornhole austin fanny pack. Selfies next level drinking vinegar wayfarers intelligentsia meditation man bun. Selfies crucifix you probably haven't heard of them chicharrones squid small batch selvage. Keffiyeh lo-fi iceland scenester VHS.",
    "rating": 3.1,
    "rating_count": 146,
    "color": [
      "red",
      "green"
    ],
    "size": [
      "large",
      "x-small",
      "medium"
    ],
    "thumbnail_url": "purple-t-shirt_4460x4460.jpg",
    "image_url": "purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 3,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Square Neck Shirt",
    "brand": "Wovest",
    "price_sale": 37.99,
    "price_actual": 53.99,
    "price_savings": 16,
    "short_desc": "Glossier ennui you probably haven't heard of them flannel coloring book salvia. Art party biodiesel lomo, jean shorts freegan skateboard jianbing prism humblebrag viral blue bottle shaman. Viral tumeric...",
    "long_desc": "Glossier ennui you probably haven't heard of them flannel coloring book salvia. Art party biodiesel lomo, jean shorts freegan skateboard jianbing prism humblebrag viral blue bottle shaman. Viral tumeric food truck messenger bag skateboard helvetica normcore man bun iceland pinterest yuccie activated charcoal kitsch migas.",
    "rating": 2.7,
    "rating_count": 158,
    "color": [
      "red",
      "yellow",
      "blue"
    ],
    "size": [
      "medium",
      "small"
    ],
    "thumbnail_url": "bright-purple-t-shirt_4460x4460.jpg",
    "image_url": "bright-purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 4,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Smocked Peplum",
    "brand": "Frockzy",
    "price_sale": 25.99,
    "price_actual": 45.99,
    "price_savings": 20,
    "short_desc": "Lomo venmo literally bitters jean shorts shabby chic ennui enamel pin vegan roof party VHS four dollar toast ethical. Asymmetrical bitters franzen tacos. Coloring book normcore chia unicorn, 8-bit iceland...",
    "long_desc": "Lomo venmo literally bitters jean shorts shabby chic ennui enamel pin vegan roof party VHS four dollar toast ethical. Asymmetrical bitters franzen tacos. Coloring book normcore chia unicorn, 8-bit iceland cronut brooklyn. Dreamcatcher austin banh mi XOXO bicycle rights. Health goth photo booth try-hard fanny pack, messenger bag tattooed snackwave raw denim cronut quinoa kinfolk DIY. Try-hard food truck blue bottle kogi pickled.",
    "rating": 5,
    "rating_count": 116,
    "color": [
      "blue",
      "green",
      "red"
    ],
    "size": [
      "large",
      "medium",
      "x-small"
    ],
    "thumbnail_url": "blue-t-shirt_4460x4460.jpg",
    "image_url": "blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 5,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Slim T-Shirt",
    "brand": "Frockzy",
    "price_sale": 45.99,
    "price_actual": 82.99,
    "price_savings": 37,
    "short_desc": "Try-hard YOLO pinterest mlkshk pabst humblebrag. Aesthetic taxidermy af cold-pressed VHS blog umami offal neutra biodiesel tacos thundercats salvia succulents. Portland hella mixtape sartorial vinyl jianbing...",
    "long_desc": "Try-hard YOLO pinterest mlkshk pabst humblebrag. Aesthetic taxidermy af cold-pressed VHS blog umami offal neutra biodiesel tacos thundercats salvia succulents. Portland hella mixtape sartorial vinyl jianbing listicle +1. Tumeric offal intelligentsia post-ironic, cold-pressed letterpress beard shabby chic gentrify twee prism edison bulb tbh. Messenger bag coloring book kitsch hot chicken vaporware taiyaki.",
    "rating": 2.9,
    "rating_count": 40,
    "color": [
      "green",
      "blue"
    ],
    "size": [
      "x-small",
      "large",
      "medium",
      "x-large"
    ],
    "thumbnail_url": "blue-t-shirt_4460x4460.jpg",
    "image_url": "blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 6,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Smocked T-Shirt",
    "brand": "Frockzy",
    "price_sale": 25.99,
    "price_actual": 41.99,
    "price_savings": 16,
    "short_desc": "Af williamsburg meditation activated charcoal. Vice banh mi subway tile ethical pabst, tattooed salvia hot chicken hoodie health goth hella prism artisan crucifix small batch. Skateboard succulents la...",
    "long_desc": "Af williamsburg meditation activated charcoal. Vice banh mi subway tile ethical pabst, tattooed salvia hot chicken hoodie health goth hella prism artisan crucifix small batch. Skateboard succulents la croix mumblecore plaid subway tile vaporware messenger bag green juice lumbersexual offal cloud bread four dollar toast chia seitan. Raclette ethical la croix plaid chia, green juice cray echo park iceland kitsch.",
    "rating": 2.6,
    "rating_count": 179,
    "color": [
      "green",
      "yellow"
    ],
    "size": [
      "medium",
      "small",
      "x-small"
    ],
    "thumbnail_url": "light-green-t-shirt_4460x4460.jpg",
    "image_url": "light-green-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 7,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Preppy Tunic",
    "brand": "Hipcrave",
    "price_sale": 40.99,
    "price_actual": 73.99,
    "price_savings": 33,
    "short_desc": "Pug cray jianbing prism hammock vice roof party narwhal forage chicharrones gluten-free. Portland everyday carry letterpress squid, offal bicycle rights cardigan neutra roof party hoodie adaptogen tacos...",
    "long_desc": "Pug cray jianbing prism hammock vice roof party narwhal forage chicharrones gluten-free. Portland everyday carry letterpress squid, offal bicycle rights cardigan neutra roof party hoodie adaptogen tacos franzen. 3 wolf moon kinfolk actually crucifix tattooed selfies. Migas ennui poke, live-edge hot chicken franzen cray pinterest man braid stumptown adaptogen tumblr letterpress.",
    "rating": 3.3,
    "rating_count": 79,
    "color": [
      "yellow",
      "blue"
    ],
    "size": [
      "x-large",
      "large",
      "medium",
      "small"
    ],
    "thumbnail_url": "grey-t-shirt_4460x4460.jpg",
    "image_url": "grey-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 8,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Floral-print T-Shirt",
    "brand": "Frockzy",
    "price_sale": 25.99,
    "price_actual": 34.99,
    "price_savings": 9,
    "short_desc": "Pickled put a bird on it man braid, intelligentsia retro art party quinoa shoreditch readymade. Hoodie yuccie selfies, microdosing pickled neutra deep v kitsch sriracha letterpress cold-pressed offal next...",
    "long_desc": "Pickled put a bird on it man braid, intelligentsia retro art party quinoa shoreditch readymade. Hoodie yuccie selfies, microdosing pickled neutra deep v kitsch sriracha letterpress cold-pressed offal next level +1. Shabby chic raclette affogato pork belly meditation whatever. Meh intelligentsia church-key, kinfolk ramps hell of direct trade seitan mixtape pinterest XOXO marfa.",
    "rating": 3.3,
    "rating_count": 98,
    "color": [
      "red",
      "green"
    ],
    "size": [
      "x-large",
      "large"
    ],
    "thumbnail_url": "red-t-shirt_4460x4460.jpg",
    "image_url": "red-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 9,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "High Neck Peasant Top",
    "brand": "Frockzy",
    "price_sale": 30.99,
    "price_actual": 64.99,
    "price_savings": 34,
    "short_desc": "Messenger bag lyft franzen, synth raw denim viral unicorn knausgaard irony hell of leggings selvage yr. Microdosing woke single-origin coffee skateboard hella slow-carb. Vegan tousled irony occupy asymmetrical...",
    "long_desc": "Messenger bag lyft franzen, synth raw denim viral unicorn knausgaard irony hell of leggings selvage yr. Microdosing woke single-origin coffee skateboard hella slow-carb. Vegan tousled irony occupy asymmetrical retro you probably haven't heard of them try-hard typewriter selfies air plant. Roof party four loko schlitz DIY chia.",
    "rating": 3.1,
    "rating_count": 150,
    "color": [
      "blue",
      "green"
    ],
    "size": [
      "medium",
      "large"
    ],
    "thumbnail_url": "light-green-t-shirt_4460x4460.jpg",
    "image_url": "light-green-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 10,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Mix-print T-Shirt",
    "brand": "Frockzy",
    "price_sale": 22.99,
    "price_actual": 46.99,
    "price_savings": 24,
    "short_desc": "90's lyft butcher scenester williamsburg cornhole. La croix yr small batch, brooklyn schlitz hammock before they sold out jean shorts leggings portland vinyl synth shaman blue bottle bushwick. Schlitz...",
    "long_desc": "90's lyft butcher scenester williamsburg cornhole. La croix yr small batch, brooklyn schlitz hammock before they sold out jean shorts leggings portland vinyl synth shaman blue bottle bushwick. Schlitz church-key artisan fanny pack palo santo. Pork belly selfies ennui tacos, woke raw denim fam hell of polaroid 8-bit kogi butcher lyft readymade.",
    "rating": 3.2,
    "rating_count": 70,
    "color": [
      "blue",
      "red",
      "green"
    ],
    "size": [
      "large",
      "medium",
      "x-small",
      "x-large"
    ],
    "thumbnail_url": "light-green-t-shirt_4460x4460.jpg",
    "image_url": "light-green-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 11,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Sweaters and Cardigans",
    "product_name": "Merino Sweater",
    "brand": "Frockzy",
    "price_sale": 18.99,
    "price_actual": 31.99,
    "price_savings": 13,
    "short_desc": "Man braid affogato pour-over sartorial leggings tumblr irony aesthetic authentic umami chartreuse gochujang. Sustainable gastropub fingerstache, blog literally activated charcoal small batch skateboard...",
    "long_desc": "Man braid affogato pour-over sartorial leggings tumblr irony aesthetic authentic umami chartreuse gochujang. Sustainable gastropub fingerstache, blog literally activated charcoal small batch skateboard thundercats. Bitters food truck pok pok pinterest umami kogi succulents kitsch, air plant iceland. Tumblr irony hoodie hell of vegan. Four dollar toast yuccie YOLO mumblecore.",
    "rating": 4.4,
    "rating_count": 57,
    "color": [
      "yellow",
      "red"
    ],
    "size": [
      "small",
      "x-small",
      "large",
      "x-large"
    ],
    "thumbnail_url": "teal-t-shirt_4460x4460.jpg",
    "image_url": "teal-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 12,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Floral-print T-Shirt",
    "brand": "Knitage",
    "price_sale": 55.99,
    "price_actual": 78.99,
    "price_savings": 23,
    "short_desc": "Artisan woke tattooed health goth 3 wolf moon fingerstache umami lumbersexual stumptown godard deep v air plant. Truffaut slow-carb put a bird on it aesthetic scenester meh blue bottle squid keytar banh...",
    "long_desc": "Artisan woke tattooed health goth 3 wolf moon fingerstache umami lumbersexual stumptown godard deep v air plant. Truffaut slow-carb put a bird on it aesthetic scenester meh blue bottle squid keytar banh mi master cleanse YOLO. Fashion axe celiac kogi heirloom, tilde pinterest prism viral organic palo santo green juice venmo thundercats.",
    "rating": 4.3,
    "rating_count": 128,
    "color": [
      "yellow",
      "green",
      "red"
    ],
    "size": [
      "x-small",
      "x-large"
    ],
    "thumbnail_url": "bright-purple-t-shirt_4460x4460.jpg",
    "image_url": "bright-purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 13,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Sweaters and Cardigans",
    "product_name": "Merino Sweater",
    "brand": "Wovest",
    "price_sale": 39.99,
    "price_actual": 49.99,
    "price_savings": 10,
    "short_desc": "Gluten-free hella unicorn glossier taiyaki bespoke skateboard bushwick godard organic ugh single-origin coffee artisan VHS chia. Vaporware crucifix farm-to-table you probably haven't heard of them. Truffaut...",
    "long_desc": "Gluten-free hella unicorn glossier taiyaki bespoke skateboard bushwick godard organic ugh single-origin coffee artisan VHS chia. Vaporware crucifix farm-to-table you probably haven't heard of them. Truffaut irony cloud bread try-hard.",
    "rating": 3,
    "rating_count": 82,
    "color": [
      "blue",
      "yellow"
    ],
    "size": [
      "x-large",
      "medium",
      "large",
      "x-small"
    ],
    "thumbnail_url": "blue-t-shirt_4460x4460.jpg",
    "image_url": "blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 14,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Mix-print Shirt",
    "brand": "Bouture",
    "price_sale": 28.99,
    "price_actual": 38.99,
    "price_savings": 10,
    "short_desc": "Artisan viral umami ennui, yuccie hella prism copper mug. Pug food truck bicycle rights unicorn, lyft glossier raw denim raclette man bun blog hell of. Fashion axe offal hexagon shaman DIY, ramps live-edge...",
    "long_desc": "Artisan viral umami ennui, yuccie hella prism copper mug. Pug food truck bicycle rights unicorn, lyft glossier raw denim raclette man bun blog hell of. Fashion axe offal hexagon shaman DIY, ramps live-edge small batch mumblecore 90's gastropub. +1 biodiesel etsy cold-pressed, DIY distillery tattooed semiotics cloud bread organic kogi kale chips subway tile PBR&B messenger bag. Mumblecore forage tote bag echo park iceland williamsburg asymmetrical.",
    "rating": 3.9,
    "rating_count": 197,
    "color": [
      "red",
      "blue",
      "yellow"
    ],
    "size": [
      "small",
      "large",
      "x-large",
      "medium"
    ],
    "thumbnail_url": "red-t-shirt_4460x4460.jpg",
    "image_url": "red-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 15,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Short Sleeved T-Shirt",
    "brand": "Coutique",
    "price_sale": 41.99,
    "price_actual": 82.99,
    "price_savings": 41,
    "short_desc": "Lomo celiac hexagon hashtag thundercats brunch fingerstache forage PBR&B live-edge. Migas four loko mumblecore tacos, synth forage asymmetrical kogi 3 wolf moon. Polaroid tattooed man braid subway tile,...",
    "long_desc": "Lomo celiac hexagon hashtag thundercats brunch fingerstache forage PBR&B live-edge. Migas four loko mumblecore tacos, synth forage asymmetrical kogi 3 wolf moon. Polaroid tattooed man braid subway tile, williamsburg four dollar toast fanny pack gochujang. Dreamcatcher cray four dollar toast chicharrones iceland. Pok pok blog XOXO banh mi mixtape hot chicken plaid gochujang.",
    "rating": 2.6,
    "rating_count": 124,
    "color": [
      "yellow",
      "blue"
    ],
    "size": [
      "x-small",
      "medium",
      "large"
    ],
    "thumbnail_url": "red-t-shirt_4460x4460.jpg",
    "image_url": "red-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 16,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Linen T-Shirt",
    "brand": "Bouture",
    "price_sale": 39.99,
    "price_actual": 81.99,
    "price_savings": 42,
    "short_desc": "Jianbing readymade church-key helvetica. Venmo palo santo blue bottle artisan, selfies bespoke sartorial mixtape tumeric. Vinyl cred heirloom, fanny pack chambray locavore bushwick four loko meggings pop-up....",
    "long_desc": "Jianbing readymade church-key helvetica. Venmo palo santo blue bottle artisan, selfies bespoke sartorial mixtape tumeric. Vinyl cred heirloom, fanny pack chambray locavore bushwick four loko meggings pop-up. Wayfarers chia before they sold out, adaptogen gentrify etsy waistcoat subway tile viral hashtag. Tattooed taxidermy narwhal raclette, jean shorts prism messenger bag blog waistcoat wayfarers air plant pickled fixie lomo.",
    "rating": 3.2,
    "rating_count": 63,
    "color": [
      "yellow",
      "red",
      "green"
    ],
    "size": [
      "medium",
      "small",
      "large",
      "x-large"
    ],
    "thumbnail_url": "bright-purple-t-shirt_4460x4460.jpg",
    "image_url": "bright-purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 17,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "High Neck Wrap Top",
    "brand": "Garmtech",
    "price_sale": 44.99,
    "price_actual": 72.99,
    "price_savings": 28,
    "short_desc": "Fashion axe tumeric raclette actually vape letterpress tbh hell of health goth. Ethical la croix iPhone sustainable four dollar toast cronut freegan selfies poutine quinoa glossier pabst food truck austin...",
    "long_desc": "Fashion axe tumeric raclette actually vape letterpress tbh hell of health goth. Ethical la croix iPhone sustainable four dollar toast cronut freegan selfies poutine quinoa glossier pabst food truck austin dreamcatcher.",
    "rating": 3.9,
    "rating_count": 80,
    "color": [
      "blue",
      "red"
    ],
    "size": [
      "small",
      "x-large"
    ],
    "thumbnail_url": "bright-purple-t-shirt_4460x4460.jpg",
    "image_url": "bright-purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 18,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Long Sleeved Blouse",
    "brand": "Knitage",
    "price_sale": 49.99,
    "price_actual": 64.99,
    "price_savings": 15,
    "short_desc": "Truffaut man braid heirloom af bespoke asymmetrical. Trust fund umami gastropub unicorn drinking vinegar. Truffaut poke beard, whatever drinking vinegar fam hell of man bun schlitz bicycle rights coloring...",
    "long_desc": "Truffaut man braid heirloom af bespoke asymmetrical. Trust fund umami gastropub unicorn drinking vinegar. Truffaut poke beard, whatever drinking vinegar fam hell of man bun schlitz bicycle rights coloring book hashtag chartreuse. Aesthetic truffaut kitsch, poutine chillwave meh semiotics squid.",
    "rating": 3.2,
    "rating_count": 113,
    "color": [
      "blue",
      "green",
      "red"
    ],
    "size": [
      "medium",
      "x-small",
      "large",
      "small"
    ],
    "thumbnail_url": "cobalt-blue-t-shirt_4460x4460.jpg",
    "image_url": "cobalt-blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 19,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Fitted T-Shirt",
    "brand": "Frockzy",
    "price_sale": 43.99,
    "price_actual": 65.99,
    "price_savings": 22,
    "short_desc": "Narwhal echo park fashion axe try-hard prism chambray woke gastropub hexagon. Jean shorts adaptogen shabby chic waistcoat locavore single-origin coffee freegan try-hard cardigan mlkshk aesthetic unicorn....",
    "long_desc": "Narwhal echo park fashion axe try-hard prism chambray woke gastropub hexagon. Jean shorts adaptogen shabby chic waistcoat locavore single-origin coffee freegan try-hard cardigan mlkshk aesthetic unicorn. Glossier fanny pack portland austin retro squid cliche shaman schlitz kale chips listicle seitan vegan everyday carry XOXO. Bicycle rights bushwick scenester twee roof party shoreditch chillwave thundercats distillery dreamcatcher tacos mlkshk austin.",
    "rating": 4.6,
    "rating_count": 76,
    "color": [
      "green",
      "red"
    ],
    "size": [
      "x-large",
      "x-small",
      "small"
    ],
    "thumbnail_url": "grey-t-shirt_4460x4460.jpg",
    "image_url": "grey-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 20,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "High Neck T-Shirt",
    "brand": "Hipcrave",
    "price_sale": 40.99,
    "price_actual": 60.99,
    "price_savings": 20,
    "short_desc": "Mustache marfa narwhal portland pitchfork fixie tote bag authentic asymmetrical prism. Wayfarers neutra retro pour-over distillery cardigan tote bag pork belly ethical church-key unicorn +1 tofu af health...",
    "long_desc": "Mustache marfa narwhal portland pitchfork fixie tote bag authentic asymmetrical prism. Wayfarers neutra retro pour-over distillery cardigan tote bag pork belly ethical church-key unicorn +1 tofu af health goth. Pork belly 3 wolf moon hammock, tote bag sriracha food truck VHS jianbing godard cornhole chia gochujang yuccie taiyaki.",
    "rating": 3.6,
    "rating_count": 46,
    "color": [
      "yellow",
      "blue"
    ],
    "size": [
      "large",
      "x-large",
      "x-small"
    ],
    "thumbnail_url": "green-t-shirt_4460x4460.jpg",
    "image_url": "green-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 21,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "High Neck Tunic",
    "brand": "Coutique",
    "price_sale": 53.99,
    "price_actual": 71.99,
    "price_savings": 18,
    "short_desc": "Dreamcatcher leggings fixie fashion axe bicycle rights hoodie. Affogato helvetica pok pok, letterpress crucifix meggings drinking vinegar leggings. Quinoa pinterest green juice sustainable next level,...",
    "long_desc": "Dreamcatcher leggings fixie fashion axe bicycle rights hoodie. Affogato helvetica pok pok, letterpress crucifix meggings drinking vinegar leggings. Quinoa pinterest green juice sustainable next level, forage hell of semiotics crucifix taiyaki typewriter lo-fi gentrify shaman mumblecore. Cornhole marfa wolf bespoke asymmetrical beard ramps yuccie hella roof party air plant.",
    "rating": 2.1,
    "rating_count": 38,
    "color": [
      "blue",
      "green"
    ],
    "size": [
      "x-small",
      "medium",
      "large"
    ],
    "thumbnail_url": "teal-t-shirt_4460x4460.jpg",
    "image_url": "teal-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 22,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Preppy T-Shirt",
    "brand": "Frockzy",
    "price_sale": 19.99,
    "price_actual": 38.99,
    "price_savings": 19,
    "short_desc": "Succulents aesthetic wayfarers, celiac synth vaporware quinoa disrupt unicorn iPhone. Occupy leggings literally, keytar kogi actually mustache. Flexitarian cardigan adaptogen listicle air plant taiyaki....",
    "long_desc": "Succulents aesthetic wayfarers, celiac synth vaporware quinoa disrupt unicorn iPhone. Occupy leggings literally, keytar kogi actually mustache. Flexitarian cardigan adaptogen listicle air plant taiyaki. Intelligentsia unicorn thundercats farm-to-table, organic church-key jianbing fashion axe fixie readymade typewriter.",
    "rating": 3.1,
    "rating_count": 183,
    "color": [
      "yellow",
      "blue",
      "green"
    ],
    "size": [
      "large",
      "small",
      "medium",
      "x-small"
    ],
    "thumbnail_url": "purple-t-shirt_4460x4460.jpg",
    "image_url": "purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 23,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Knit T-Shirt",
    "brand": "Frockzy",
    "price_sale": 31.99,
    "price_actual": 53.99,
    "price_savings": 22,
    "short_desc": "Biodiesel shabby chic cliche vaporware. Snackwave four loko cardigan gastropub, fixie crucifix adaptogen poke fam seitan yr. Letterpress gluten-free portland tumblr roof party freegan ramps. Fanny pack...",
    "long_desc": "Biodiesel shabby chic cliche vaporware. Snackwave four loko cardigan gastropub, fixie crucifix adaptogen poke fam seitan yr. Letterpress gluten-free portland tumblr roof party freegan ramps. Fanny pack poutine taxidermy raclette vexillologist, offal schlitz mixtape.",
    "rating": 2.8,
    "rating_count": 197,
    "color": [
      "green",
      "red"
    ],
    "size": [
      "x-small",
      "small",
      "x-large"
    ],
    "thumbnail_url": "purple-t-shirt_4460x4460.jpg",
    "image_url": "purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 24,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Sweaters and Cardigans",
    "product_name": "Hooded Sweater",
    "brand": "Bouture",
    "price_sale": 54.99,
    "price_actual": 88.99,
    "price_savings": 34,
    "short_desc": "Drinking vinegar slow-carb put a bird on it actually hammock. Schlitz marfa tumeric austin meh small batch cliche jean shorts. Activated charcoal bitters disrupt banjo tote bag raw denim gochujang organic...",
    "long_desc": "Drinking vinegar slow-carb put a bird on it actually hammock. Schlitz marfa tumeric austin meh small batch cliche jean shorts. Activated charcoal bitters disrupt banjo tote bag raw denim gochujang organic migas slow-carb ethical. Kinfolk organic gochujang lumbersexual. Chia affogato flexitarian fanny pack shabby chic copper mug. Keytar single-origin coffee normcore health goth.",
    "rating": 3.7,
    "rating_count": 107,
    "color": [
      "red",
      "yellow"
    ],
    "size": [
      "x-large",
      "large"
    ],
    "thumbnail_url": "blue-t-shirt_4460x4460.jpg",
    "image_url": "blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 25,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Linen Tunic",
    "brand": "Wovest",
    "price_sale": 63.99,
    "price_actual": 81.99,
    "price_savings": 18,
    "short_desc": "Cardigan fingerstache vice, distillery vaporware photo booth keffiyeh. Godard vice pok pok quinoa. Four dollar toast cloud bread pork belly, offal fashion axe shaman kogi bicycle rights you probably haven't...",
    "long_desc": "Cardigan fingerstache vice, distillery vaporware photo booth keffiyeh. Godard vice pok pok quinoa. Four dollar toast cloud bread pork belly, offal fashion axe shaman kogi bicycle rights you probably haven't heard of them stumptown iceland. Freegan chillwave food truck lomo typewriter forage raclette bicycle rights tacos fixie try-hard marfa four loko scenester gentrify.",
    "rating": 3.7,
    "rating_count": 116,
    "color": [
      "red",
      "blue"
    ],
    "size": [
      "small",
      "x-small",
      "x-large",
      "medium"
    ],
    "thumbnail_url": "red-t-shirt_4460x4460.jpg",
    "image_url": "red-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 26,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Sweaters and Cardigans",
    "product_name": "Button-up Sweater",
    "brand": "Bouture",
    "price_sale": 47.99,
    "price_actual": 75.99,
    "price_savings": 28,
    "short_desc": "Irony artisan gluten-free cold-pressed vaporware tattooed, kogi edison bulb af chicharrones forage intelligentsia kombucha hot chicken try-hard. Ramps trust fund fanny pack pug poutine microdosing tattooed...",
    "long_desc": "Irony artisan gluten-free cold-pressed vaporware tattooed, kogi edison bulb af chicharrones forage intelligentsia kombucha hot chicken try-hard. Ramps trust fund fanny pack pug poutine microdosing tattooed pitchfork vape dreamcatcher drinking vinegar banh mi copper mug disrupt actually. Neutra palo santo man bun chia photo booth master cleanse ramps echo park heirloom cornhole.",
    "rating": 3.2,
    "rating_count": 177,
    "color": [
      "green",
      "yellow"
    ],
    "size": [
      "small",
      "x-large"
    ],
    "thumbnail_url": "grey-t-shirt_4460x4460.jpg",
    "image_url": "grey-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 27,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Sweaters and Cardigans",
    "product_name": "Slim Cardigan",
    "brand": "Hipcrave",
    "price_sale": 21.99,
    "price_actual": 34.99,
    "price_savings": 13,
    "short_desc": "Chambray ennui distillery vice, bespoke slow-carb helvetica. Vexillologist palo santo authentic, listicle 8-bit fanny pack food truck bushwick pok pok. Photo booth bushwick jean shorts, austin actually...",
    "long_desc": "Chambray ennui distillery vice, bespoke slow-carb helvetica. Vexillologist palo santo authentic, listicle 8-bit fanny pack food truck bushwick pok pok. Photo booth bushwick jean shorts, austin actually wolf selvage. Helvetica next level brunch four dollar toast poutine messenger bag mustache sriracha try-hard selfies copper mug scenester cold-pressed mlkshk chillwave.",
    "rating": 2.3,
    "rating_count": 105,
    "color": [
      "blue",
      "yellow"
    ],
    "size": [
      "medium",
      "x-small",
      "small"
    ],
    "thumbnail_url": "blue-t-shirt_4460x4460.jpg",
    "image_url": "blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 28,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Long Sleeved T-Shirt",
    "brand": "Bouture",
    "price_sale": 52.99,
    "price_actual": 85.99,
    "price_savings": 33,
    "short_desc": "Umami green juice put a bird on it bicycle rights street art lo-fi. Hoodie iPhone hashtag neutra, trust fund ethical williamsburg austin drinking vinegar crucifix. Lo-fi mixtape XOXO retro. Truffaut slow-carb...",
    "long_desc": "Umami green juice put a bird on it bicycle rights street art lo-fi. Hoodie iPhone hashtag neutra, trust fund ethical williamsburg austin drinking vinegar crucifix. Lo-fi mixtape XOXO retro. Truffaut slow-carb put a bird on it aesthetic scenester meh blue bottle squid keytar banh mi master cleanse YOLO. Fashion axe celiac kogi heirloom, tilde pinterest prism viral organic palo santo green juice venmo thundercats.",
    "rating": 2.4,
    "rating_count": 84,
    "color": [
      "blue",
      "yellow"
    ],
    "size": [
      "medium",
      "large",
      "small"
    ],
    "thumbnail_url": "purple-t-shirt_4460x4460.jpg",
    "image_url": "purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 29,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Mix-print Peasant Top",
    "brand": "Frockzy",
    "price_sale": 13.99,
    "price_actual": 26.99,
    "price_savings": 13,
    "short_desc": "Hot chicken shaman banh mi, pok pok green juice tote bag taxidermy photo booth freegan. Lumbersexual affogato vaporware adaptogen. Godard normcore kinfolk af poutine farm-to-table. Paleo succulents edison...",
    "long_desc": "Hot chicken shaman banh mi, pok pok green juice tote bag taxidermy photo booth freegan. Lumbersexual affogato vaporware adaptogen. Godard normcore kinfolk af poutine farm-to-table. Paleo succulents edison bulb, farm-to-table mumblecore umami cloud bread. Sartorial hell of +1 activated charcoal cornhole leggings put a bird on it kitsch franzen raclette man bun.",
    "rating": 2.3,
    "rating_count": 50,
    "color": [
      "green",
      "red"
    ],
    "size": [
      "medium",
      "small"
    ],
    "thumbnail_url": "teal-t-shirt_4460x4460.jpg",
    "image_url": "teal-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 30,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Fitted Peasant Top",
    "brand": "Frockzy",
    "price_sale": 47.99,
    "price_actual": 78.99,
    "price_savings": 31,
    "short_desc": "Swag cred pop-up try-hard sriracha four loko neutra farm-to-table. Vaporware 8-bit fam freegan neutra cloud bread gentrify cray la croix. Tumblr cliche letterpress banh mi YOLO, air plant pop-up tbh fingerstache...",
    "long_desc": "Swag cred pop-up try-hard sriracha four loko neutra farm-to-table. Vaporware 8-bit fam freegan neutra cloud bread gentrify cray la croix. Tumblr cliche letterpress banh mi YOLO, air plant pop-up tbh fingerstache iceland mixtape pour-over freegan. Cliche drinking vinegar pork belly locavore tumeric jianbing viral mumblecore quinoa shoreditch master cleanse photo booth keytar.",
    "rating": 4.2,
    "rating_count": 198,
    "color": [
      "yellow",
      "green",
      "blue"
    ],
    "size": [
      "x-small",
      "medium",
      "small",
      "large"
    ],
    "thumbnail_url": "purple-t-shirt_4460x4460.jpg",
    "image_url": "purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 31,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Smocked Blouse",
    "brand": "Coutique",
    "price_sale": 50.99,
    "price_actual": 72.99,
    "price_savings": 22,
    "short_desc": "Fixie tilde selvage, godard +1 tote bag fam schlitz. Jean shorts neutra dreamcatcher literally biodiesel, wolf flannel whatever four loko chartreuse raw denim. Authentic activated charcoal wolf bushwick...",
    "long_desc": "Fixie tilde selvage, godard +1 tote bag fam schlitz. Jean shorts neutra dreamcatcher literally biodiesel, wolf flannel whatever four loko chartreuse raw denim. Authentic activated charcoal wolf bushwick copper mug tumblr.",
    "rating": 4.9,
    "rating_count": 95,
    "color": [
      "green",
      "yellow",
      "blue"
    ],
    "size": [
      "large",
      "medium"
    ],
    "thumbnail_url": "light-green-t-shirt_4460x4460.jpg",
    "image_url": "light-green-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 32,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Preppy Blouse",
    "brand": "Wovest",
    "price_sale": 52.99,
    "price_actual": 85.99,
    "price_savings": 33,
    "short_desc": "Fam prism man bun pork belly pok pok yuccie retro snackwave cred mustache ennui craft beer fashion axe ugh. Skateboard master cleanse salvia, messenger bag af live-edge wolf fam echo park. Af YOLO shoreditch...",
    "long_desc": "Fam prism man bun pork belly pok pok yuccie retro snackwave cred mustache ennui craft beer fashion axe ugh. Skateboard master cleanse salvia, messenger bag af live-edge wolf fam echo park. Af YOLO shoreditch gastropub wolf. Cardigan microdosing small batch pug, hoodie tumblr church-key bitters glossier stumptown. VHS viral photo booth copper mug, poutine tote bag gastropub twee food truck slow-carb helvetica raw denim.",
    "rating": 4.8,
    "rating_count": 44,
    "color": [
      "green",
      "yellow",
      "red"
    ],
    "size": [
      "large",
      "x-large",
      "x-small"
    ],
    "thumbnail_url": "blue-t-shirt_4460x4460.jpg",
    "image_url": "blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 33,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Sweaters and Cardigans",
    "product_name": "Wool Sweater",
    "brand": "Frockzy",
    "price_sale": 43.99,
    "price_actual": 82.99,
    "price_savings": 39,
    "short_desc": "Pork belly hot chicken polaroid skateboard tousled yr. Mustache fanny pack activated charcoal, normcore taiyaki adaptogen man bun. Slow-carb trust fund post-ironic, plaid kombucha put a bird on it fanny...",
    "long_desc": "Pork belly hot chicken polaroid skateboard tousled yr. Mustache fanny pack activated charcoal, normcore taiyaki adaptogen man bun. Slow-carb trust fund post-ironic, plaid kombucha put a bird on it fanny pack poutine helvetica lumbersexual flannel fashion axe. Asymmetrical street art flexitarian art party, organic four dollar toast mixtape pork belly lo-fi you probably haven't heard of them biodiesel cardigan small batch.",
    "rating": 3.7,
    "rating_count": 78,
    "color": [
      "yellow",
      "red",
      "green"
    ],
    "size": [
      "x-large",
      "large"
    ],
    "thumbnail_url": "light-green-t-shirt_4460x4460.jpg",
    "image_url": "light-green-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 34,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Sweaters and Cardigans",
    "product_name": "Cozy Sweatshirt",
    "brand": "Bouture",
    "price_sale": 40.99,
    "price_actual": 88.99,
    "price_savings": 48,
    "short_desc": "Intelligentsia adaptogen kitsch, typewriter four dollar toast unicorn viral tacos crucifix pug. Quinoa man bun ramps distillery seitan, migas bitters cliche four dollar toast echo park shoreditch. Mixtape...",
    "long_desc": "Intelligentsia adaptogen kitsch, typewriter four dollar toast unicorn viral tacos crucifix pug. Quinoa man bun ramps distillery seitan, migas bitters cliche four dollar toast echo park shoreditch. Mixtape celiac church-key health goth enamel pin tilde freegan bespoke blue bottle typewriter. Pickled umami tbh cred pour-over irony art party actually ethical gochujang.",
    "rating": 3.2,
    "rating_count": 100,
    "color": [
      "green",
      "red",
      "blue"
    ],
    "size": [
      "medium",
      "large",
      "x-large"
    ],
    "thumbnail_url": "grey-t-shirt_4460x4460.jpg",
    "image_url": "grey-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 35,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Sweaters and Cardigans",
    "product_name": "Merino Cardigan",
    "brand": "Frockzy",
    "price_sale": 48.99,
    "price_actual": 73.99,
    "price_savings": 25,
    "short_desc": "Mumblecore pok pok kombucha letterpress, distillery live-edge yuccie iceland air plant chicharrones hella lo-fi brooklyn tilde everyday carry. DIY tilde tattooed meh, fashion axe godard next level slow-carb...",
    "long_desc": "Mumblecore pok pok kombucha letterpress, distillery live-edge yuccie iceland air plant chicharrones hella lo-fi brooklyn tilde everyday carry. DIY tilde tattooed meh, fashion axe godard next level slow-carb copper mug +1. VHS pork belly poke la croix street art celiac, vaporware vice. Plaid photo booth salvia, cronut master cleanse banjo ethical tousled chia squid bicycle rights chicharrones pour-over austin mumblecore.",
    "rating": 3.2,
    "rating_count": 104,
    "color": [
      "blue",
      "green",
      "red"
    ],
    "size": [
      "x-large",
      "x-small",
      "medium"
    ],
    "thumbnail_url": "purple-t-shirt_4460x4460.jpg",
    "image_url": "purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 36,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Square Neck T-Shirt",
    "brand": "Wovest",
    "price_sale": 49.99,
    "price_actual": 81.99,
    "price_savings": 32,
    "short_desc": "Banh mi artisan godard stumptown, polaroid woke food truck 8-bit subway tile sustainable you probably haven't heard of them keffiyeh literally. Cliche williamsburg cornhole austin fanny pack. Selfies next...",
    "long_desc": "Banh mi artisan godard stumptown, polaroid woke food truck 8-bit subway tile sustainable you probably haven't heard of them keffiyeh literally. Cliche williamsburg cornhole austin fanny pack. Selfies next level drinking vinegar wayfarers intelligentsia meditation man bun. Selfies crucifix you probably haven't heard of them chicharrones squid small batch selvage. Keffiyeh lo-fi iceland scenester VHS.",
    "rating": 4.1,
    "rating_count": 62,
    "color": [
      "green",
      "red"
    ],
    "size": [
      "large",
      "medium",
      "x-large",
      "small"
    ],
    "thumbnail_url": "grey-t-shirt_4460x4460.jpg",
    "image_url": "grey-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 37,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Slim T-Shirt",
    "brand": "Wovest",
    "price_sale": 35.99,
    "price_actual": 55.99,
    "price_savings": 20,
    "short_desc": "Glossier ennui you probably haven't heard of them flannel coloring book salvia. Art party biodiesel lomo, jean shorts freegan skateboard jianbing prism humblebrag viral blue bottle shaman. Viral tumeric...",
    "long_desc": "Glossier ennui you probably haven't heard of them flannel coloring book salvia. Art party biodiesel lomo, jean shorts freegan skateboard jianbing prism humblebrag viral blue bottle shaman. Viral tumeric food truck messenger bag skateboard helvetica normcore man bun iceland pinterest yuccie activated charcoal kitsch migas.",
    "rating": 2.9,
    "rating_count": 179,
    "color": [
      "red",
      "yellow"
    ],
    "size": [
      "x-large",
      "medium",
      "small"
    ],
    "thumbnail_url": "blue-t-shirt_4460x4460.jpg",
    "image_url": "blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 38,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "V-Neck Peplum",
    "brand": "Garmtech",
    "price_sale": 37.99,
    "price_actual": 79.99,
    "price_savings": 42,
    "short_desc": "Lomo venmo literally bitters jean shorts shabby chic ennui enamel pin vegan roof party VHS four dollar toast ethical. Asymmetrical bitters franzen tacos. Coloring book normcore chia unicorn, 8-bit iceland...",
    "long_desc": "Lomo venmo literally bitters jean shorts shabby chic ennui enamel pin vegan roof party VHS four dollar toast ethical. Asymmetrical bitters franzen tacos. Coloring book normcore chia unicorn, 8-bit iceland cronut brooklyn. Dreamcatcher austin banh mi XOXO bicycle rights. Health goth photo booth try-hard fanny pack, messenger bag tattooed snackwave raw denim cronut quinoa kinfolk DIY. Try-hard food truck blue bottle kogi pickled.",
    "rating": 3.1,
    "rating_count": 45,
    "color": [
      "red",
      "green",
      "yellow"
    ],
    "size": [
      "medium",
      "x-large"
    ],
    "thumbnail_url": "blue-t-shirt_4460x4460.jpg",
    "image_url": "blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 39,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Knit Shirt",
    "brand": "Coutique",
    "price_sale": 24.99,
    "price_actual": 32.99,
    "price_savings": 8,
    "short_desc": "Try-hard YOLO pinterest mlkshk pabst humblebrag. Aesthetic taxidermy af cold-pressed VHS blog umami offal neutra biodiesel tacos thundercats salvia succulents. Portland hella mixtape sartorial vinyl jianbing...",
    "long_desc": "Try-hard YOLO pinterest mlkshk pabst humblebrag. Aesthetic taxidermy af cold-pressed VHS blog umami offal neutra biodiesel tacos thundercats salvia succulents. Portland hella mixtape sartorial vinyl jianbing listicle +1. Tumeric offal intelligentsia post-ironic, cold-pressed letterpress beard shabby chic gentrify twee prism edison bulb tbh. Messenger bag coloring book kitsch hot chicken vaporware taiyaki.",
    "rating": 4.6,
    "rating_count": 72,
    "color": [
      "blue",
      "yellow",
      "green"
    ],
    "size": [
      "medium",
      "small",
      "x-small"
    ],
    "thumbnail_url": "red-t-shirt_4460x4460.jpg",
    "image_url": "red-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 40,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Sleeveless Tunic",
    "brand": "Hipcrave",
    "price_sale": 42.99,
    "price_actual": 62.99,
    "price_savings": 20,
    "short_desc": "Af williamsburg meditation activated charcoal. Vice banh mi subway tile ethical pabst, tattooed salvia hot chicken hoodie health goth hella prism artisan crucifix small batch. Skateboard succulents la...",
    "long_desc": "Af williamsburg meditation activated charcoal. Vice banh mi subway tile ethical pabst, tattooed salvia hot chicken hoodie health goth hella prism artisan crucifix small batch. Skateboard succulents la croix mumblecore plaid subway tile vaporware messenger bag green juice lumbersexual offal cloud bread four dollar toast chia seitan. Raclette ethical la croix plaid chia, green juice cray echo park iceland kitsch.",
    "rating": 4.3,
    "rating_count": 71,
    "color": [
      "red",
      "blue"
    ],
    "size": [
      "medium",
      "small"
    ],
    "thumbnail_url": "red-t-shirt_4460x4460.jpg",
    "image_url": "red-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 41,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Slim Shirt",
    "brand": "Knitage",
    "price_sale": 15.99,
    "price_actual": 32.99,
    "price_savings": 17,
    "short_desc": "Pug cray jianbing prism hammock vice roof party narwhal forage chicharrones gluten-free. Portland everyday carry letterpress squid, offal bicycle rights cardigan neutra roof party hoodie adaptogen tacos...",
    "long_desc": "Pug cray jianbing prism hammock vice roof party narwhal forage chicharrones gluten-free. Portland everyday carry letterpress squid, offal bicycle rights cardigan neutra roof party hoodie adaptogen tacos franzen. 3 wolf moon kinfolk actually crucifix tattooed selfies. Migas ennui poke, live-edge hot chicken franzen cray pinterest man braid stumptown adaptogen tumblr letterpress.",
    "rating": 2.9,
    "rating_count": 185,
    "color": [
      "blue",
      "green",
      "red"
    ],
    "size": [
      "x-small",
      "medium",
      "small",
      "large"
    ],
    "thumbnail_url": "purple-t-shirt_4460x4460.jpg",
    "image_url": "purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 42,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Smocked T-Shirt",
    "brand": "Wovest",
    "price_sale": 15.99,
    "price_actual": 28.99,
    "price_savings": 13,
    "short_desc": "Pickled put a bird on it man braid, intelligentsia retro art party quinoa shoreditch readymade. Hoodie yuccie selfies, microdosing pickled neutra deep v kitsch sriracha letterpress cold-pressed offal next...",
    "long_desc": "Pickled put a bird on it man braid, intelligentsia retro art party quinoa shoreditch readymade. Hoodie yuccie selfies, microdosing pickled neutra deep v kitsch sriracha letterpress cold-pressed offal next level +1. Shabby chic raclette affogato pork belly meditation whatever. Meh intelligentsia church-key, kinfolk ramps hell of direct trade seitan mixtape pinterest XOXO marfa.",
    "rating": 3.7,
    "rating_count": 118,
    "color": [
      "blue",
      "red",
      "yellow"
    ],
    "size": [
      "medium",
      "x-small",
      "x-large"
    ],
    "thumbnail_url": "grey-t-shirt_4460x4460.jpg",
    "image_url": "grey-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 43,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Preppy Blouse",
    "brand": "Hipcrave",
    "price_sale": 27.99,
    "price_actual": 36.99,
    "price_savings": 9,
    "short_desc": "Messenger bag lyft franzen, synth raw denim viral unicorn knausgaard irony hell of leggings selvage yr. Microdosing woke single-origin coffee skateboard hella slow-carb. Vegan tousled irony occupy asymmetrical...",
    "long_desc": "Messenger bag lyft franzen, synth raw denim viral unicorn knausgaard irony hell of leggings selvage yr. Microdosing woke single-origin coffee skateboard hella slow-carb. Vegan tousled irony occupy asymmetrical retro you probably haven't heard of them try-hard typewriter selfies air plant. Roof party four loko schlitz DIY chia.",
    "rating": 3.7,
    "rating_count": 52,
    "color": [
      "red",
      "green"
    ],
    "size": [
      "large",
      "small"
    ],
    "thumbnail_url": "bright-purple-t-shirt_4460x4460.jpg",
    "image_url": "bright-purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 44,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Smocked Peasant Top",
    "brand": "Frockzy",
    "price_sale": 40.99,
    "price_actual": 81.99,
    "price_savings": 41,
    "short_desc": "90's lyft butcher scenester williamsburg cornhole. La croix yr small batch, brooklyn schlitz hammock before they sold out jean shorts leggings portland vinyl synth shaman blue bottle bushwick. Schlitz...",
    "long_desc": "90's lyft butcher scenester williamsburg cornhole. La croix yr small batch, brooklyn schlitz hammock before they sold out jean shorts leggings portland vinyl synth shaman blue bottle bushwick. Schlitz church-key artisan fanny pack palo santo. Pork belly selfies ennui tacos, woke raw denim fam hell of polaroid 8-bit kogi butcher lyft readymade.",
    "rating": 2.8,
    "rating_count": 159,
    "color": [
      "green",
      "yellow"
    ],
    "size": [
      "small",
      "x-large",
      "x-small"
    ],
    "thumbnail_url": "light-green-t-shirt_4460x4460.jpg",
    "image_url": "light-green-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 45,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "High Neck Top",
    "brand": "Garmtech",
    "price_sale": 16.99,
    "price_actual": 26.99,
    "price_savings": 10,
    "short_desc": "Man braid affogato pour-over sartorial leggings tumblr irony aesthetic authentic umami chartreuse gochujang. Sustainable gastropub fingerstache, blog literally activated charcoal small batch skateboard...",
    "long_desc": "Man braid affogato pour-over sartorial leggings tumblr irony aesthetic authentic umami chartreuse gochujang. Sustainable gastropub fingerstache, blog literally activated charcoal small batch skateboard thundercats. Bitters food truck pok pok pinterest umami kogi succulents kitsch, air plant iceland. Tumblr irony hoodie hell of vegan. Four dollar toast yuccie YOLO mumblecore.",
    "rating": 4,
    "rating_count": 112,
    "color": [
      "red",
      "blue"
    ],
    "size": [
      "small",
      "x-large",
      "x-small",
      "large"
    ],
    "thumbnail_url": "purple-t-shirt_4460x4460.jpg",
    "image_url": "purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 46,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "V-Neck T-Shirt",
    "brand": "Knitage",
    "price_sale": 38.99,
    "price_actual": 70.99,
    "price_savings": 32,
    "short_desc": "Artisan woke tattooed health goth 3 wolf moon fingerstache umami lumbersexual stumptown godard deep v air plant. Truffaut slow-carb put a bird on it aesthetic scenester meh blue bottle squid keytar banh...",
    "long_desc": "Artisan woke tattooed health goth 3 wolf moon fingerstache umami lumbersexual stumptown godard deep v air plant. Truffaut slow-carb put a bird on it aesthetic scenester meh blue bottle squid keytar banh mi master cleanse YOLO. Fashion axe celiac kogi heirloom, tilde pinterest prism viral organic palo santo green juice venmo thundercats.",
    "rating": 2.1,
    "rating_count": 170,
    "color": [
      "red",
      "yellow",
      "green"
    ],
    "size": [
      "small",
      "x-large",
      "x-small"
    ],
    "thumbnail_url": "light-green-t-shirt_4460x4460.jpg",
    "image_url": "light-green-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 47,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Square Neck Peplum",
    "brand": "Knitage",
    "price_sale": 39.99,
    "price_actual": 62.99,
    "price_savings": 23,
    "short_desc": "Gluten-free hella unicorn glossier taiyaki bespoke skateboard bushwick godard organic ugh single-origin coffee artisan VHS chia. Vaporware crucifix farm-to-table you probably haven't heard of them. Truffaut...",
    "long_desc": "Gluten-free hella unicorn glossier taiyaki bespoke skateboard bushwick godard organic ugh single-origin coffee artisan VHS chia. Vaporware crucifix farm-to-table you probably haven't heard of them. Truffaut irony cloud bread try-hard.",
    "rating": 3.4,
    "rating_count": 104,
    "color": [
      "yellow",
      "blue",
      "red"
    ],
    "size": [
      "x-small",
      "medium",
      "small"
    ],
    "thumbnail_url": "grey-t-shirt_4460x4460.jpg",
    "image_url": "grey-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 48,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Lace Trim T-Shirt",
    "brand": "Bouture",
    "price_sale": 56.99,
    "price_actual": 72.99,
    "price_savings": 16,
    "short_desc": "Artisan viral umami ennui, yuccie hella prism copper mug. Pug food truck bicycle rights unicorn, lyft glossier raw denim raclette man bun blog hell of. Fashion axe offal hexagon shaman DIY, ramps live-edge...",
    "long_desc": "Artisan viral umami ennui, yuccie hella prism copper mug. Pug food truck bicycle rights unicorn, lyft glossier raw denim raclette man bun blog hell of. Fashion axe offal hexagon shaman DIY, ramps live-edge small batch mumblecore 90's gastropub. +1 biodiesel etsy cold-pressed, DIY distillery tattooed semiotics cloud bread organic kogi kale chips subway tile PBR&B messenger bag. Mumblecore forage tote bag echo park iceland williamsburg asymmetrical.",
    "rating": 3.8,
    "rating_count": 165,
    "color": [
      "blue",
      "green",
      "yellow"
    ],
    "size": [
      "medium",
      "small"
    ],
    "thumbnail_url": "grey-t-shirt_4460x4460.jpg",
    "image_url": "grey-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 49,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Sweaters and Cardigans",
    "product_name": "Pocket Cardigan",
    "brand": "Wovest",
    "price_sale": 49.99,
    "price_actual": 83.99,
    "price_savings": 34,
    "short_desc": "Lomo celiac hexagon hashtag thundercats brunch fingerstache forage PBR&B live-edge. Migas four loko mumblecore tacos, synth forage asymmetrical kogi 3 wolf moon. Polaroid tattooed man braid subway tile,...",
    "long_desc": "Lomo celiac hexagon hashtag thundercats brunch fingerstache forage PBR&B live-edge. Migas four loko mumblecore tacos, synth forage asymmetrical kogi 3 wolf moon. Polaroid tattooed man braid subway tile, williamsburg four dollar toast fanny pack gochujang. Dreamcatcher cray four dollar toast chicharrones iceland. Pok pok blog XOXO banh mi mixtape hot chicken plaid gochujang.",
    "rating": 4.1,
    "rating_count": 128,
    "color": [
      "green",
      "yellow",
      "red"
    ],
    "size": [
      "medium",
      "large",
      "x-large",
      "x-small"
    ],
    "thumbnail_url": "grey-t-shirt_4460x4460.jpg",
    "image_url": "grey-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 50,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Smocked Shirt",
    "brand": "Hipcrave",
    "price_sale": 17.99,
    "price_actual": 29.99,
    "price_savings": 12,
    "short_desc": "Jianbing readymade church-key helvetica. Venmo palo santo blue bottle artisan, selfies bespoke sartorial mixtape tumeric. Vinyl cred heirloom, fanny pack chambray locavore bushwick four loko meggings pop-up....",
    "long_desc": "Jianbing readymade church-key helvetica. Venmo palo santo blue bottle artisan, selfies bespoke sartorial mixtape tumeric. Vinyl cred heirloom, fanny pack chambray locavore bushwick four loko meggings pop-up. Wayfarers chia before they sold out, adaptogen gentrify etsy waistcoat subway tile viral hashtag. Tattooed taxidermy narwhal raclette, jean shorts prism messenger bag blog waistcoat wayfarers air plant pickled fixie lomo.",
    "rating": 3.4,
    "rating_count": 102,
    "color": [
      "yellow",
      "green",
      "blue"
    ],
    "size": [
      "x-large",
      "small",
      "medium",
      "large"
    ],
    "thumbnail_url": "bright-purple-t-shirt_4460x4460.jpg",
    "image_url": "bright-purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 51,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Sweaters and Cardigans",
    "product_name": "Wool Cardigan",
    "brand": "Hipcrave",
    "price_sale": 10.99,
    "price_actual": 21.99,
    "price_savings": 11,
    "short_desc": "Fashion axe tumeric raclette actually vape letterpress tbh hell of health goth. Ethical la croix iPhone sustainable four dollar toast cronut freegan selfies poutine quinoa glossier pabst food truck austin...",
    "long_desc": "Fashion axe tumeric raclette actually vape letterpress tbh hell of health goth. Ethical la croix iPhone sustainable four dollar toast cronut freegan selfies poutine quinoa glossier pabst food truck austin dreamcatcher.",
    "rating": 3.5,
    "rating_count": 134,
    "color": [
      "yellow",
      "red",
      "green"
    ],
    "size": [
      "small",
      "medium"
    ],
    "thumbnail_url": "cobalt-blue-t-shirt_4460x4460.jpg",
    "image_url": "cobalt-blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 52,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "V-Neck Wrap Top",
    "brand": "Bouture",
    "price_sale": 65.99,
    "price_actual": 82.99,
    "price_savings": 17,
    "short_desc": "Truffaut man braid heirloom af bespoke asymmetrical. Trust fund umami gastropub unicorn drinking vinegar. Truffaut poke beard, whatever drinking vinegar fam hell of man bun schlitz bicycle rights coloring...",
    "long_desc": "Truffaut man braid heirloom af bespoke asymmetrical. Trust fund umami gastropub unicorn drinking vinegar. Truffaut poke beard, whatever drinking vinegar fam hell of man bun schlitz bicycle rights coloring book hashtag chartreuse. Aesthetic truffaut kitsch, poutine chillwave meh semiotics squid.",
    "rating": 4.8,
    "rating_count": 176,
    "color": [
      "green",
      "blue"
    ],
    "size": [
      "x-large",
      "large",
      "small",
      "x-small"
    ],
    "thumbnail_url": "teal-t-shirt_4460x4460.jpg",
    "image_url": "teal-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 53,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "High Neck Tunic",
    "brand": "Bouture",
    "price_sale": 31.99,
    "price_actual": 63.99,
    "price_savings": 32,
    "short_desc": "Narwhal echo park fashion axe try-hard prism chambray woke gastropub hexagon. Jean shorts adaptogen shabby chic waistcoat locavore single-origin coffee freegan try-hard cardigan mlkshk aesthetic unicorn....",
    "long_desc": "Narwhal echo park fashion axe try-hard prism chambray woke gastropub hexagon. Jean shorts adaptogen shabby chic waistcoat locavore single-origin coffee freegan try-hard cardigan mlkshk aesthetic unicorn. Glossier fanny pack portland austin retro squid cliche shaman schlitz kale chips listicle seitan vegan everyday carry XOXO. Bicycle rights bushwick scenester twee roof party shoreditch chillwave thundercats distillery dreamcatcher tacos mlkshk austin.",
    "rating": 3.3,
    "rating_count": 95,
    "color": [
      "red",
      "blue"
    ],
    "size": [
      "x-small",
      "x-large",
      "large",
      "small"
    ],
    "thumbnail_url": "grey-t-shirt_4460x4460.jpg",
    "image_url": "grey-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 54,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Long Sleeved T-Shirt",
    "brand": "Frockzy",
    "price_sale": 11.99,
    "price_actual": 21.99,
    "price_savings": 10,
    "short_desc": "Mustache marfa narwhal portland pitchfork fixie tote bag authentic asymmetrical prism. Wayfarers neutra retro pour-over distillery cardigan tote bag pork belly ethical church-key unicorn +1 tofu af health...",
    "long_desc": "Mustache marfa narwhal portland pitchfork fixie tote bag authentic asymmetrical prism. Wayfarers neutra retro pour-over distillery cardigan tote bag pork belly ethical church-key unicorn +1 tofu af health goth. Pork belly 3 wolf moon hammock, tote bag sriracha food truck VHS jianbing godard cornhole chia gochujang yuccie taiyaki.",
    "rating": 4,
    "rating_count": 29,
    "color": [
      "red",
      "blue"
    ],
    "size": [
      "x-large",
      "x-small",
      "small",
      "medium"
    ],
    "thumbnail_url": "purple-t-shirt_4460x4460.jpg",
    "image_url": "purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 55,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Slim T-Shirt",
    "brand": "Wovest",
    "price_sale": 11.99,
    "price_actual": 25.99,
    "price_savings": 14,
    "short_desc": "Dreamcatcher leggings fixie fashion axe bicycle rights hoodie. Affogato helvetica pok pok, letterpress crucifix meggings drinking vinegar leggings. Quinoa pinterest green juice sustainable next level,...",
    "long_desc": "Dreamcatcher leggings fixie fashion axe bicycle rights hoodie. Affogato helvetica pok pok, letterpress crucifix meggings drinking vinegar leggings. Quinoa pinterest green juice sustainable next level, forage hell of semiotics crucifix taiyaki typewriter lo-fi gentrify shaman mumblecore. Cornhole marfa wolf bespoke asymmetrical beard ramps yuccie hella roof party air plant.",
    "rating": 3.2,
    "rating_count": 64,
    "color": [
      "red",
      "green",
      "blue"
    ],
    "size": [
      "large",
      "medium",
      "x-large",
      "x-small"
    ],
    "thumbnail_url": "green-t-shirt_4460x4460.jpg",
    "image_url": "green-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 56,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Fitted Button-up Shirt",
    "brand": "Knitage",
    "price_sale": 34.99,
    "price_actual": 75.99,
    "price_savings": 41,
    "short_desc": "Succulents aesthetic wayfarers, celiac synth vaporware quinoa disrupt unicorn iPhone. Occupy leggings literally, keytar kogi actually mustache. Flexitarian cardigan adaptogen listicle air plant taiyaki....",
    "long_desc": "Succulents aesthetic wayfarers, celiac synth vaporware quinoa disrupt unicorn iPhone. Occupy leggings literally, keytar kogi actually mustache. Flexitarian cardigan adaptogen listicle air plant taiyaki. Intelligentsia unicorn thundercats farm-to-table, organic church-key jianbing fashion axe fixie readymade typewriter.",
    "rating": 2.8,
    "rating_count": 171,
    "color": [
      "green",
      "blue",
      "yellow"
    ],
    "size": [
      "large",
      "medium",
      "x-small"
    ],
    "thumbnail_url": "bright-purple-t-shirt_4460x4460.jpg",
    "image_url": "bright-purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 57,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Sweaters and Cardigans",
    "product_name": "Cozy Sweater",
    "brand": "Bouture",
    "price_sale": 11.99,
    "price_actual": 20.99,
    "price_savings": 9,
    "short_desc": "Biodiesel shabby chic cliche vaporware. Snackwave four loko cardigan gastropub, fixie crucifix adaptogen poke fam seitan yr. Letterpress gluten-free portland tumblr roof party freegan ramps. Fanny pack...",
    "long_desc": "Biodiesel shabby chic cliche vaporware. Snackwave four loko cardigan gastropub, fixie crucifix adaptogen poke fam seitan yr. Letterpress gluten-free portland tumblr roof party freegan ramps. Fanny pack poutine taxidermy raclette vexillologist, offal schlitz mixtape.",
    "rating": 2.6,
    "rating_count": 171,
    "color": [
      "green",
      "red",
      "yellow"
    ],
    "size": [
      "x-large",
      "x-small"
    ],
    "thumbnail_url": "cobalt-blue-t-shirt_4460x4460.jpg",
    "image_url": "cobalt-blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 58,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Short Sleeved T-Shirt",
    "brand": "Wovest",
    "price_sale": 14.99,
    "price_actual": 21.99,
    "price_savings": 7,
    "short_desc": "Drinking vinegar slow-carb put a bird on it actually hammock. Schlitz marfa tumeric austin meh small batch cliche jean shorts. Activated charcoal bitters disrupt banjo tote bag raw denim gochujang organic...",
    "long_desc": "Drinking vinegar slow-carb put a bird on it actually hammock. Schlitz marfa tumeric austin meh small batch cliche jean shorts. Activated charcoal bitters disrupt banjo tote bag raw denim gochujang organic migas slow-carb ethical. Kinfolk organic gochujang lumbersexual. Chia affogato flexitarian fanny pack shabby chic copper mug. Keytar single-origin coffee normcore health goth.",
    "rating": 4.4,
    "rating_count": 104,
    "color": [
      "yellow",
      "blue",
      "green"
    ],
    "size": [
      "large",
      "medium",
      "x-small"
    ],
    "thumbnail_url": "light-green-t-shirt_4460x4460.jpg",
    "image_url": "light-green-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 59,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "High Neck Button-up Shirt",
    "brand": "Hipcrave",
    "price_sale": 38.99,
    "price_actual": 54.99,
    "price_savings": 16,
    "short_desc": "Cardigan fingerstache vice, distillery vaporware photo booth keffiyeh. Godard vice pok pok quinoa. Four dollar toast cloud bread pork belly, offal fashion axe shaman kogi bicycle rights you probably haven't...",
    "long_desc": "Cardigan fingerstache vice, distillery vaporware photo booth keffiyeh. Godard vice pok pok quinoa. Four dollar toast cloud bread pork belly, offal fashion axe shaman kogi bicycle rights you probably haven't heard of them stumptown iceland. Freegan chillwave food truck lomo typewriter forage raclette bicycle rights tacos fixie try-hard marfa four loko scenester gentrify.",
    "rating": 4.5,
    "rating_count": 126,
    "color": [
      "red",
      "green",
      "blue"
    ],
    "size": [
      "medium",
      "large",
      "x-small"
    ],
    "thumbnail_url": "green-t-shirt_4460x4460.jpg",
    "image_url": "green-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 60,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Fitted T-Shirt",
    "brand": "Frockzy",
    "price_sale": 48.99,
    "price_actual": 71.99,
    "price_savings": 23,
    "short_desc": "Irony artisan gluten-free cold-pressed vaporware tattooed, kogi edison bulb af chicharrones forage intelligentsia kombucha hot chicken try-hard. Ramps trust fund fanny pack pug poutine microdosing tattooed...",
    "long_desc": "Irony artisan gluten-free cold-pressed vaporware tattooed, kogi edison bulb af chicharrones forage intelligentsia kombucha hot chicken try-hard. Ramps trust fund fanny pack pug poutine microdosing tattooed pitchfork vape dreamcatcher drinking vinegar banh mi copper mug disrupt actually. Neutra palo santo man bun chia photo booth master cleanse ramps echo park heirloom cornhole.",
    "rating": 2.4,
    "rating_count": 58,
    "color": [
      "red",
      "blue",
      "green"
    ],
    "size": [
      "small",
      "large"
    ],
    "thumbnail_url": "purple-t-shirt_4460x4460.jpg",
    "image_url": "purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 61,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Pleated T-Shirt",
    "brand": "Wovest",
    "price_sale": 36.99,
    "price_actual": 72.99,
    "price_savings": 36,
    "short_desc": "Chambray ennui distillery vice, bespoke slow-carb helvetica. Vexillologist palo santo authentic, listicle 8-bit fanny pack food truck bushwick pok pok. Photo booth bushwick jean shorts, austin actually...",
    "long_desc": "Chambray ennui distillery vice, bespoke slow-carb helvetica. Vexillologist palo santo authentic, listicle 8-bit fanny pack food truck bushwick pok pok. Photo booth bushwick jean shorts, austin actually wolf selvage. Helvetica next level brunch four dollar toast poutine messenger bag mustache sriracha try-hard selfies copper mug scenester cold-pressed mlkshk chillwave.",
    "rating": 3.8,
    "rating_count": 52,
    "color": [
      "red",
      "green",
      "yellow"
    ],
    "size": [
      "large",
      "x-large"
    ],
    "thumbnail_url": "blue-t-shirt_4460x4460.jpg",
    "image_url": "blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 62,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Pleated T-Shirt",
    "brand": "Bouture",
    "price_sale": 37.99,
    "price_actual": 59.99,
    "price_savings": 22,
    "short_desc": "Umami green juice put a bird on it bicycle rights street art lo-fi. Hoodie iPhone hashtag neutra, trust fund ethical williamsburg austin drinking vinegar crucifix. Lo-fi mixtape XOXO retro. Truffaut slow-carb...",
    "long_desc": "Umami green juice put a bird on it bicycle rights street art lo-fi. Hoodie iPhone hashtag neutra, trust fund ethical williamsburg austin drinking vinegar crucifix. Lo-fi mixtape XOXO retro. Truffaut slow-carb put a bird on it aesthetic scenester meh blue bottle squid keytar banh mi master cleanse YOLO. Fashion axe celiac kogi heirloom, tilde pinterest prism viral organic palo santo green juice venmo thundercats.",
    "rating": 4.5,
    "rating_count": 38,
    "color": [
      "green",
      "red",
      "yellow"
    ],
    "size": [
      "large",
      "x-large",
      "x-small"
    ],
    "thumbnail_url": "cobalt-blue-t-shirt_4460x4460.jpg",
    "image_url": "cobalt-blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 63,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "High Neck T-Shirt",
    "brand": "Coutique",
    "price_sale": 28.99,
    "price_actual": 48.99,
    "price_savings": 20,
    "short_desc": "Hot chicken shaman banh mi, pok pok green juice tote bag taxidermy photo booth freegan. Lumbersexual affogato vaporware adaptogen. Godard normcore kinfolk af poutine farm-to-table. Paleo succulents edison...",
    "long_desc": "Hot chicken shaman banh mi, pok pok green juice tote bag taxidermy photo booth freegan. Lumbersexual affogato vaporware adaptogen. Godard normcore kinfolk af poutine farm-to-table. Paleo succulents edison bulb, farm-to-table mumblecore umami cloud bread. Sartorial hell of +1 activated charcoal cornhole leggings put a bird on it kitsch franzen raclette man bun.",
    "rating": 4.4,
    "rating_count": 71,
    "color": [
      "red",
      "green",
      "blue"
    ],
    "size": [
      "x-large",
      "small",
      "large"
    ],
    "thumbnail_url": "green-t-shirt_4460x4460.jpg",
    "image_url": "green-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 64,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Lace Trim Top",
    "brand": "Garmtech",
    "price_sale": 16.99,
    "price_actual": 24.99,
    "price_savings": 8,
    "short_desc": "Swag cred pop-up try-hard sriracha four loko neutra farm-to-table. Vaporware 8-bit fam freegan neutra cloud bread gentrify cray la croix. Tumblr cliche letterpress banh mi YOLO, air plant pop-up tbh fingerstache...",
    "long_desc": "Swag cred pop-up try-hard sriracha four loko neutra farm-to-table. Vaporware 8-bit fam freegan neutra cloud bread gentrify cray la croix. Tumblr cliche letterpress banh mi YOLO, air plant pop-up tbh fingerstache iceland mixtape pour-over freegan. Cliche drinking vinegar pork belly locavore tumeric jianbing viral mumblecore quinoa shoreditch master cleanse photo booth keytar.",
    "rating": 3.5,
    "rating_count": 146,
    "color": [
      "red",
      "blue",
      "yellow"
    ],
    "size": [
      "large",
      "x-large",
      "small"
    ],
    "thumbnail_url": "green-t-shirt_4460x4460.jpg",
    "image_url": "green-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 65,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Short Sleeved Wrap Top",
    "brand": "Knitage",
    "price_sale": 32.99,
    "price_actual": 46.99,
    "price_savings": 14,
    "short_desc": "Fixie tilde selvage, godard +1 tote bag fam schlitz. Jean shorts neutra dreamcatcher literally biodiesel, wolf flannel whatever four loko chartreuse raw denim. Authentic activated charcoal wolf bushwick...",
    "long_desc": "Fixie tilde selvage, godard +1 tote bag fam schlitz. Jean shorts neutra dreamcatcher literally biodiesel, wolf flannel whatever four loko chartreuse raw denim. Authentic activated charcoal wolf bushwick copper mug tumblr.",
    "rating": 3.1,
    "rating_count": 117,
    "color": [
      "yellow",
      "blue",
      "red"
    ],
    "size": [
      "small",
      "x-large"
    ],
    "thumbnail_url": "grey-t-shirt_4460x4460.jpg",
    "image_url": "grey-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 66,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Sweaters and Cardigans",
    "product_name": "Drapey Sweatshirt",
    "brand": "Frockzy",
    "price_sale": 18.99,
    "price_actual": 29.99,
    "price_savings": 11,
    "short_desc": "Fam prism man bun pork belly pok pok yuccie retro snackwave cred mustache ennui craft beer fashion axe ugh. Skateboard master cleanse salvia, messenger bag af live-edge wolf fam echo park. Af YOLO shoreditch...",
    "long_desc": "Fam prism man bun pork belly pok pok yuccie retro snackwave cred mustache ennui craft beer fashion axe ugh. Skateboard master cleanse salvia, messenger bag af live-edge wolf fam echo park. Af YOLO shoreditch gastropub wolf. Cardigan microdosing small batch pug, hoodie tumblr church-key bitters glossier stumptown. VHS viral photo booth copper mug, poutine tote bag gastropub twee food truck slow-carb helvetica raw denim.",
    "rating": 2.6,
    "rating_count": 190,
    "color": [
      "blue",
      "yellow",
      "green"
    ],
    "size": [
      "x-large",
      "small",
      "x-small",
      "medium"
    ],
    "thumbnail_url": "green-t-shirt_4460x4460.jpg",
    "image_url": "green-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 67,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Sleeveless Peplum",
    "brand": "Coutique",
    "price_sale": 34.99,
    "price_actual": 76.99,
    "price_savings": 42,
    "short_desc": "Pork belly hot chicken polaroid skateboard tousled yr. Mustache fanny pack activated charcoal, normcore taiyaki adaptogen man bun. Slow-carb trust fund post-ironic, plaid kombucha put a bird on it fanny...",
    "long_desc": "Pork belly hot chicken polaroid skateboard tousled yr. Mustache fanny pack activated charcoal, normcore taiyaki adaptogen man bun. Slow-carb trust fund post-ironic, plaid kombucha put a bird on it fanny pack poutine helvetica lumbersexual flannel fashion axe. Asymmetrical street art flexitarian art party, organic four dollar toast mixtape pork belly lo-fi you probably haven't heard of them biodiesel cardigan small batch.",
    "rating": 3.7,
    "rating_count": 82,
    "color": [
      "green",
      "red"
    ],
    "size": [
      "x-large",
      "small"
    ],
    "thumbnail_url": "cobalt-blue-t-shirt_4460x4460.jpg",
    "image_url": "cobalt-blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 68,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Smocked Button-up Shirt",
    "brand": "Coutique",
    "price_sale": 34.99,
    "price_actual": 67.99,
    "price_savings": 33,
    "short_desc": "Intelligentsia adaptogen kitsch, typewriter four dollar toast unicorn viral tacos crucifix pug. Quinoa man bun ramps distillery seitan, migas bitters cliche four dollar toast echo park shoreditch. Mixtape...",
    "long_desc": "Intelligentsia adaptogen kitsch, typewriter four dollar toast unicorn viral tacos crucifix pug. Quinoa man bun ramps distillery seitan, migas bitters cliche four dollar toast echo park shoreditch. Mixtape celiac church-key health goth enamel pin tilde freegan bespoke blue bottle typewriter. Pickled umami tbh cred pour-over irony art party actually ethical gochujang.",
    "rating": 3.3,
    "rating_count": 70,
    "color": [
      "green",
      "red",
      "blue"
    ],
    "size": [
      "x-small",
      "x-large"
    ],
    "thumbnail_url": "bright-purple-t-shirt_4460x4460.jpg",
    "image_url": "bright-purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 69,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Smocked Button-up Shirt",
    "brand": "Wovest",
    "price_sale": 16.99,
    "price_actual": 33.99,
    "price_savings": 17,
    "short_desc": "Mumblecore pok pok kombucha letterpress, distillery live-edge yuccie iceland air plant chicharrones hella lo-fi brooklyn tilde everyday carry. DIY tilde tattooed meh, fashion axe godard next level slow-carb...",
    "long_desc": "Mumblecore pok pok kombucha letterpress, distillery live-edge yuccie iceland air plant chicharrones hella lo-fi brooklyn tilde everyday carry. DIY tilde tattooed meh, fashion axe godard next level slow-carb copper mug +1. VHS pork belly poke la croix street art celiac, vaporware vice. Plaid photo booth salvia, cronut master cleanse banjo ethical tousled chia squid bicycle rights chicharrones pour-over austin mumblecore.",
    "rating": 4.3,
    "rating_count": 191,
    "color": [
      "blue",
      "yellow"
    ],
    "size": [
      "small",
      "x-small",
      "large"
    ],
    "thumbnail_url": "grey-t-shirt_4460x4460.jpg",
    "image_url": "grey-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 70,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Sweaters and Cardigans",
    "product_name": "Button-up Cardigan",
    "brand": "Wovest",
    "price_sale": 34.99,
    "price_actual": 44.99,
    "price_savings": 10,
    "short_desc": "Banh mi artisan godard stumptown, polaroid woke food truck 8-bit subway tile sustainable you probably haven't heard of them keffiyeh literally. Cliche williamsburg cornhole austin fanny pack. Selfies next...",
    "long_desc": "Banh mi artisan godard stumptown, polaroid woke food truck 8-bit subway tile sustainable you probably haven't heard of them keffiyeh literally. Cliche williamsburg cornhole austin fanny pack. Selfies next level drinking vinegar wayfarers intelligentsia meditation man bun. Selfies crucifix you probably haven't heard of them chicharrones squid small batch selvage. Keffiyeh lo-fi iceland scenester VHS.",
    "rating": 3.8,
    "rating_count": 57,
    "color": [
      "red",
      "blue"
    ],
    "size": [
      "x-large",
      "medium",
      "small",
      "x-small"
    ],
    "thumbnail_url": "light-green-t-shirt_4460x4460.jpg",
    "image_url": "light-green-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 71,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Sweaters and Cardigans",
    "product_name": "Slim Sweater",
    "brand": "Coutique",
    "price_sale": 62.99,
    "price_actual": 80.99,
    "price_savings": 18,
    "short_desc": "Glossier ennui you probably haven't heard of them flannel coloring book salvia. Art party biodiesel lomo, jean shorts freegan skateboard jianbing prism humblebrag viral blue bottle shaman. Viral tumeric...",
    "long_desc": "Glossier ennui you probably haven't heard of them flannel coloring book salvia. Art party biodiesel lomo, jean shorts freegan skateboard jianbing prism humblebrag viral blue bottle shaman. Viral tumeric food truck messenger bag skateboard helvetica normcore man bun iceland pinterest yuccie activated charcoal kitsch migas.",
    "rating": 2.6,
    "rating_count": 179,
    "color": [
      "yellow",
      "green",
      "red"
    ],
    "size": [
      "medium",
      "small",
      "large",
      "x-large"
    ],
    "thumbnail_url": "blue-t-shirt_4460x4460.jpg",
    "image_url": "blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 72,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Sweaters and Cardigans",
    "product_name": "Pocket Sweatshirt",
    "brand": "Coutique",
    "price_sale": 44.99,
    "price_actual": 70.99,
    "price_savings": 26,
    "short_desc": "Lomo venmo literally bitters jean shorts shabby chic ennui enamel pin vegan roof party VHS four dollar toast ethical. Asymmetrical bitters franzen tacos. Coloring book normcore chia unicorn, 8-bit iceland...",
    "long_desc": "Lomo venmo literally bitters jean shorts shabby chic ennui enamel pin vegan roof party VHS four dollar toast ethical. Asymmetrical bitters franzen tacos. Coloring book normcore chia unicorn, 8-bit iceland cronut brooklyn. Dreamcatcher austin banh mi XOXO bicycle rights. Health goth photo booth try-hard fanny pack, messenger bag tattooed snackwave raw denim cronut quinoa kinfolk DIY. Try-hard food truck blue bottle kogi pickled.",
    "rating": 4.4,
    "rating_count": 162,
    "color": [
      "red",
      "green",
      "blue"
    ],
    "size": [
      "small",
      "x-large",
      "medium",
      "large"
    ],
    "thumbnail_url": "cobalt-blue-t-shirt_4460x4460.jpg",
    "image_url": "cobalt-blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 73,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Linen T-Shirt",
    "brand": "Wovest",
    "price_sale": 44.99,
    "price_actual": 69.99,
    "price_savings": 25,
    "short_desc": "Try-hard YOLO pinterest mlkshk pabst humblebrag. Aesthetic taxidermy af cold-pressed VHS blog umami offal neutra biodiesel tacos thundercats salvia succulents. Portland hella mixtape sartorial vinyl jianbing...",
    "long_desc": "Try-hard YOLO pinterest mlkshk pabst humblebrag. Aesthetic taxidermy af cold-pressed VHS blog umami offal neutra biodiesel tacos thundercats salvia succulents. Portland hella mixtape sartorial vinyl jianbing listicle +1. Tumeric offal intelligentsia post-ironic, cold-pressed letterpress beard shabby chic gentrify twee prism edison bulb tbh. Messenger bag coloring book kitsch hot chicken vaporware taiyaki.",
    "rating": 4.9,
    "rating_count": 157,
    "color": [
      "green",
      "red",
      "blue"
    ],
    "size": [
      "x-small",
      "medium",
      "x-large",
      "large"
    ],
    "thumbnail_url": "green-t-shirt_4460x4460.jpg",
    "image_url": "green-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 74,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Short Sleeved T-Shirt",
    "brand": "Wovest",
    "price_sale": 50.99,
    "price_actual": 76.99,
    "price_savings": 26,
    "short_desc": "Af williamsburg meditation activated charcoal. Vice banh mi subway tile ethical pabst, tattooed salvia hot chicken hoodie health goth hella prism artisan crucifix small batch. Skateboard succulents la...",
    "long_desc": "Af williamsburg meditation activated charcoal. Vice banh mi subway tile ethical pabst, tattooed salvia hot chicken hoodie health goth hella prism artisan crucifix small batch. Skateboard succulents la croix mumblecore plaid subway tile vaporware messenger bag green juice lumbersexual offal cloud bread four dollar toast chia seitan. Raclette ethical la croix plaid chia, green juice cray echo park iceland kitsch.",
    "rating": 4.8,
    "rating_count": 160,
    "color": [
      "blue",
      "red",
      "green"
    ],
    "size": [
      "medium",
      "x-large"
    ],
    "thumbnail_url": "cobalt-blue-t-shirt_4460x4460.jpg",
    "image_url": "cobalt-blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 75,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Smocked T-Shirt",
    "brand": "Coutique",
    "price_sale": 29.99,
    "price_actual": 60.99,
    "price_savings": 31,
    "short_desc": "Pug cray jianbing prism hammock vice roof party narwhal forage chicharrones gluten-free. Portland everyday carry letterpress squid, offal bicycle rights cardigan neutra roof party hoodie adaptogen tacos...",
    "long_desc": "Pug cray jianbing prism hammock vice roof party narwhal forage chicharrones gluten-free. Portland everyday carry letterpress squid, offal bicycle rights cardigan neutra roof party hoodie adaptogen tacos franzen. 3 wolf moon kinfolk actually crucifix tattooed selfies. Migas ennui poke, live-edge hot chicken franzen cray pinterest man braid stumptown adaptogen tumblr letterpress.",
    "rating": 2.2,
    "rating_count": 191,
    "color": [
      "red",
      "yellow"
    ],
    "size": [
      "x-large",
      "x-small"
    ],
    "thumbnail_url": "red-t-shirt_4460x4460.jpg",
    "image_url": "red-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 76,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Sweaters and Cardigans",
    "product_name": "Slim Sweater",
    "brand": "Hipcrave",
    "price_sale": 54.99,
    "price_actual": 74.99,
    "price_savings": 20,
    "short_desc": "Pickled put a bird on it man braid, intelligentsia retro art party quinoa shoreditch readymade. Hoodie yuccie selfies, microdosing pickled neutra deep v kitsch sriracha letterpress cold-pressed offal next...",
    "long_desc": "Pickled put a bird on it man braid, intelligentsia retro art party quinoa shoreditch readymade. Hoodie yuccie selfies, microdosing pickled neutra deep v kitsch sriracha letterpress cold-pressed offal next level +1. Shabby chic raclette affogato pork belly meditation whatever. Meh intelligentsia church-key, kinfolk ramps hell of direct trade seitan mixtape pinterest XOXO marfa.",
    "rating": 2.6,
    "rating_count": 29,
    "color": [
      "red",
      "yellow"
    ],
    "size": [
      "small",
      "x-small",
      "x-large",
      "large"
    ],
    "thumbnail_url": "blue-t-shirt_4460x4460.jpg",
    "image_url": "blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 77,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Knit T-Shirt",
    "brand": "Frockzy",
    "price_sale": 32.99,
    "price_actual": 48.99,
    "price_savings": 16,
    "short_desc": "Messenger bag lyft franzen, synth raw denim viral unicorn knausgaard irony hell of leggings selvage yr. Microdosing woke single-origin coffee skateboard hella slow-carb. Vegan tousled irony occupy asymmetrical...",
    "long_desc": "Messenger bag lyft franzen, synth raw denim viral unicorn knausgaard irony hell of leggings selvage yr. Microdosing woke single-origin coffee skateboard hella slow-carb. Vegan tousled irony occupy asymmetrical retro you probably haven't heard of them try-hard typewriter selfies air plant. Roof party four loko schlitz DIY chia.",
    "rating": 3.7,
    "rating_count": 126,
    "color": [
      "green",
      "red"
    ],
    "size": [
      "small",
      "x-large",
      "medium"
    ],
    "thumbnail_url": "cobalt-blue-t-shirt_4460x4460.jpg",
    "image_url": "cobalt-blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 78,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "High Neck T-Shirt",
    "brand": "Coutique",
    "price_sale": 40.99,
    "price_actual": 67.99,
    "price_savings": 27,
    "short_desc": "90's lyft butcher scenester williamsburg cornhole. La croix yr small batch, brooklyn schlitz hammock before they sold out jean shorts leggings portland vinyl synth shaman blue bottle bushwick. Schlitz...",
    "long_desc": "90's lyft butcher scenester williamsburg cornhole. La croix yr small batch, brooklyn schlitz hammock before they sold out jean shorts leggings portland vinyl synth shaman blue bottle bushwick. Schlitz church-key artisan fanny pack palo santo. Pork belly selfies ennui tacos, woke raw denim fam hell of polaroid 8-bit kogi butcher lyft readymade.",
    "rating": 2.4,
    "rating_count": 24,
    "color": [
      "green",
      "red"
    ],
    "size": [
      "x-small",
      "x-large"
    ],
    "thumbnail_url": "purple-t-shirt_4460x4460.jpg",
    "image_url": "purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 79,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Drapey Peasant Top",
    "brand": "Coutique",
    "price_sale": 30.99,
    "price_actual": 56.99,
    "price_savings": 26,
    "short_desc": "Man braid affogato pour-over sartorial leggings tumblr irony aesthetic authentic umami chartreuse gochujang. Sustainable gastropub fingerstache, blog literally activated charcoal small batch skateboard...",
    "long_desc": "Man braid affogato pour-over sartorial leggings tumblr irony aesthetic authentic umami chartreuse gochujang. Sustainable gastropub fingerstache, blog literally activated charcoal small batch skateboard thundercats. Bitters food truck pok pok pinterest umami kogi succulents kitsch, air plant iceland. Tumblr irony hoodie hell of vegan. Four dollar toast yuccie YOLO mumblecore.",
    "rating": 4.6,
    "rating_count": 82,
    "color": [
      "red",
      "blue"
    ],
    "size": [
      "x-small",
      "x-large",
      "large"
    ],
    "thumbnail_url": "green-t-shirt_4460x4460.jpg",
    "image_url": "green-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 80,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Sleeveless Blouse",
    "brand": "Frockzy",
    "price_sale": 53.99,
    "price_actual": 88.99,
    "price_savings": 35,
    "short_desc": "Artisan woke tattooed health goth 3 wolf moon fingerstache umami lumbersexual stumptown godard deep v air plant. Truffaut slow-carb put a bird on it aesthetic scenester meh blue bottle squid keytar banh...",
    "long_desc": "Artisan woke tattooed health goth 3 wolf moon fingerstache umami lumbersexual stumptown godard deep v air plant. Truffaut slow-carb put a bird on it aesthetic scenester meh blue bottle squid keytar banh mi master cleanse YOLO. Fashion axe celiac kogi heirloom, tilde pinterest prism viral organic palo santo green juice venmo thundercats.",
    "rating": 4.2,
    "rating_count": 173,
    "color": [
      "blue",
      "yellow",
      "green"
    ],
    "size": [
      "small",
      "x-small",
      "medium"
    ],
    "thumbnail_url": "blue-t-shirt_4460x4460.jpg",
    "image_url": "blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 81,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Sweaters and Cardigans",
    "product_name": "Cozy Sweatshirt",
    "brand": "Garmtech",
    "price_sale": 33.99,
    "price_actual": 44.99,
    "price_savings": 11,
    "short_desc": "Gluten-free hella unicorn glossier taiyaki bespoke skateboard bushwick godard organic ugh single-origin coffee artisan VHS chia. Vaporware crucifix farm-to-table you probably haven't heard of them. Truffaut...",
    "long_desc": "Gluten-free hella unicorn glossier taiyaki bespoke skateboard bushwick godard organic ugh single-origin coffee artisan VHS chia. Vaporware crucifix farm-to-table you probably haven't heard of them. Truffaut irony cloud bread try-hard.",
    "rating": 3.8,
    "rating_count": 70,
    "color": [
      "yellow",
      "red"
    ],
    "size": [
      "x-small",
      "large"
    ],
    "thumbnail_url": "teal-t-shirt_4460x4460.jpg",
    "image_url": "teal-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 82,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Long Sleeved Wrap Top",
    "brand": "Wovest",
    "price_sale": 35.99,
    "price_actual": 65.99,
    "price_savings": 30,
    "short_desc": "Artisan viral umami ennui, yuccie hella prism copper mug. Pug food truck bicycle rights unicorn, lyft glossier raw denim raclette man bun blog hell of. Fashion axe offal hexagon shaman DIY, ramps live-edge...",
    "long_desc": "Artisan viral umami ennui, yuccie hella prism copper mug. Pug food truck bicycle rights unicorn, lyft glossier raw denim raclette man bun blog hell of. Fashion axe offal hexagon shaman DIY, ramps live-edge small batch mumblecore 90's gastropub. +1 biodiesel etsy cold-pressed, DIY distillery tattooed semiotics cloud bread organic kogi kale chips subway tile PBR&B messenger bag. Mumblecore forage tote bag echo park iceland williamsburg asymmetrical.",
    "rating": 2.8,
    "rating_count": 171,
    "color": [
      "red",
      "green",
      "blue"
    ],
    "size": [
      "small",
      "medium",
      "x-large",
      "x-small"
    ],
    "thumbnail_url": "grey-t-shirt_4460x4460.jpg",
    "image_url": "grey-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 83,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Slim Wrap Top",
    "brand": "Coutique",
    "price_sale": 61.99,
    "price_actual": 86.99,
    "price_savings": 25,
    "short_desc": "Lomo celiac hexagon hashtag thundercats brunch fingerstache forage PBR&B live-edge. Migas four loko mumblecore tacos, synth forage asymmetrical kogi 3 wolf moon. Polaroid tattooed man braid subway tile,...",
    "long_desc": "Lomo celiac hexagon hashtag thundercats brunch fingerstache forage PBR&B live-edge. Migas four loko mumblecore tacos, synth forage asymmetrical kogi 3 wolf moon. Polaroid tattooed man braid subway tile, williamsburg four dollar toast fanny pack gochujang. Dreamcatcher cray four dollar toast chicharrones iceland. Pok pok blog XOXO banh mi mixtape hot chicken plaid gochujang.",
    "rating": 3.4,
    "rating_count": 87,
    "color": [
      "yellow",
      "green"
    ],
    "size": [
      "large",
      "x-large",
      "medium",
      "small"
    ],
    "thumbnail_url": "grey-t-shirt_4460x4460.jpg",
    "image_url": "grey-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 84,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Smocked T-Shirt",
    "brand": "Wovest",
    "price_sale": 38.99,
    "price_actual": 55.99,
    "price_savings": 17,
    "short_desc": "Jianbing readymade church-key helvetica. Venmo palo santo blue bottle artisan, selfies bespoke sartorial mixtape tumeric. Vinyl cred heirloom, fanny pack chambray locavore bushwick four loko meggings pop-up....",
    "long_desc": "Jianbing readymade church-key helvetica. Venmo palo santo blue bottle artisan, selfies bespoke sartorial mixtape tumeric. Vinyl cred heirloom, fanny pack chambray locavore bushwick four loko meggings pop-up. Wayfarers chia before they sold out, adaptogen gentrify etsy waistcoat subway tile viral hashtag. Tattooed taxidermy narwhal raclette, jean shorts prism messenger bag blog waistcoat wayfarers air plant pickled fixie lomo.",
    "rating": 2.5,
    "rating_count": 64,
    "color": [
      "red",
      "green",
      "yellow"
    ],
    "size": [
      "medium",
      "x-large",
      "x-small"
    ],
    "thumbnail_url": "light-green-t-shirt_4460x4460.jpg",
    "image_url": "light-green-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 85,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Smocked Peplum",
    "brand": "Hipcrave",
    "price_sale": 31.99,
    "price_actual": 64.99,
    "price_savings": 33,
    "short_desc": "Fashion axe tumeric raclette actually vape letterpress tbh hell of health goth. Ethical la croix iPhone sustainable four dollar toast cronut freegan selfies poutine quinoa glossier pabst food truck austin...",
    "long_desc": "Fashion axe tumeric raclette actually vape letterpress tbh hell of health goth. Ethical la croix iPhone sustainable four dollar toast cronut freegan selfies poutine quinoa glossier pabst food truck austin dreamcatcher.",
    "rating": 4.7,
    "rating_count": 22,
    "color": [
      "yellow",
      "red",
      "blue"
    ],
    "size": [
      "medium",
      "x-large",
      "large"
    ],
    "thumbnail_url": "bright-purple-t-shirt_4460x4460.jpg",
    "image_url": "bright-purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 86,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Linen Button-up Shirt",
    "brand": "Knitage",
    "price_sale": 51.99,
    "price_actual": 69.99,
    "price_savings": 18,
    "short_desc": "Truffaut man braid heirloom af bespoke asymmetrical. Trust fund umami gastropub unicorn drinking vinegar. Truffaut poke beard, whatever drinking vinegar fam hell of man bun schlitz bicycle rights coloring...",
    "long_desc": "Truffaut man braid heirloom af bespoke asymmetrical. Trust fund umami gastropub unicorn drinking vinegar. Truffaut poke beard, whatever drinking vinegar fam hell of man bun schlitz bicycle rights coloring book hashtag chartreuse. Aesthetic truffaut kitsch, poutine chillwave meh semiotics squid.",
    "rating": 4.1,
    "rating_count": 199,
    "color": [
      "green",
      "blue"
    ],
    "size": [
      "large",
      "x-small"
    ],
    "thumbnail_url": "bright-purple-t-shirt_4460x4460.jpg",
    "image_url": "bright-purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 87,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Long Sleeved T-Shirt",
    "brand": "Garmtech",
    "price_sale": 55.99,
    "price_actual": 86.99,
    "price_savings": 31,
    "short_desc": "Narwhal echo park fashion axe try-hard prism chambray woke gastropub hexagon. Jean shorts adaptogen shabby chic waistcoat locavore single-origin coffee freegan try-hard cardigan mlkshk aesthetic unicorn....",
    "long_desc": "Narwhal echo park fashion axe try-hard prism chambray woke gastropub hexagon. Jean shorts adaptogen shabby chic waistcoat locavore single-origin coffee freegan try-hard cardigan mlkshk aesthetic unicorn. Glossier fanny pack portland austin retro squid cliche shaman schlitz kale chips listicle seitan vegan everyday carry XOXO. Bicycle rights bushwick scenester twee roof party shoreditch chillwave thundercats distillery dreamcatcher tacos mlkshk austin.",
    "rating": 2.1,
    "rating_count": 34,
    "color": [
      "green",
      "blue",
      "red"
    ],
    "size": [
      "x-large",
      "x-small",
      "small"
    ],
    "thumbnail_url": "light-green-t-shirt_4460x4460.jpg",
    "image_url": "light-green-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 88,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Long Sleeved T-Shirt",
    "brand": "Knitage",
    "price_sale": 53.99,
    "price_actual": 72.99,
    "price_savings": 19,
    "short_desc": "Mustache marfa narwhal portland pitchfork fixie tote bag authentic asymmetrical prism. Wayfarers neutra retro pour-over distillery cardigan tote bag pork belly ethical church-key unicorn +1 tofu af health...",
    "long_desc": "Mustache marfa narwhal portland pitchfork fixie tote bag authentic asymmetrical prism. Wayfarers neutra retro pour-over distillery cardigan tote bag pork belly ethical church-key unicorn +1 tofu af health goth. Pork belly 3 wolf moon hammock, tote bag sriracha food truck VHS jianbing godard cornhole chia gochujang yuccie taiyaki.",
    "rating": 2.6,
    "rating_count": 61,
    "color": [
      "blue",
      "green"
    ],
    "size": [
      "small",
      "x-large",
      "medium",
      "x-small"
    ],
    "thumbnail_url": "red-t-shirt_4460x4460.jpg",
    "image_url": "red-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 89,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Short Sleeved T-Shirt",
    "brand": "Knitage",
    "price_sale": 24.99,
    "price_actual": 51.99,
    "price_savings": 27,
    "short_desc": "Dreamcatcher leggings fixie fashion axe bicycle rights hoodie. Affogato helvetica pok pok, letterpress crucifix meggings drinking vinegar leggings. Quinoa pinterest green juice sustainable next level,...",
    "long_desc": "Dreamcatcher leggings fixie fashion axe bicycle rights hoodie. Affogato helvetica pok pok, letterpress crucifix meggings drinking vinegar leggings. Quinoa pinterest green juice sustainable next level, forage hell of semiotics crucifix taiyaki typewriter lo-fi gentrify shaman mumblecore. Cornhole marfa wolf bespoke asymmetrical beard ramps yuccie hella roof party air plant.",
    "rating": 4.5,
    "rating_count": 162,
    "color": [
      "yellow",
      "blue"
    ],
    "size": [
      "large",
      "medium",
      "small"
    ],
    "thumbnail_url": "grey-t-shirt_4460x4460.jpg",
    "image_url": "grey-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 90,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "High Neck Button-up Shirt",
    "brand": "Bouture",
    "price_sale": 32.99,
    "price_actual": 66.99,
    "price_savings": 34,
    "short_desc": "Succulents aesthetic wayfarers, celiac synth vaporware quinoa disrupt unicorn iPhone. Occupy leggings literally, keytar kogi actually mustache. Flexitarian cardigan adaptogen listicle air plant taiyaki....",
    "long_desc": "Succulents aesthetic wayfarers, celiac synth vaporware quinoa disrupt unicorn iPhone. Occupy leggings literally, keytar kogi actually mustache. Flexitarian cardigan adaptogen listicle air plant taiyaki. Intelligentsia unicorn thundercats farm-to-table, organic church-key jianbing fashion axe fixie readymade typewriter.",
    "rating": 3.4,
    "rating_count": 136,
    "color": [
      "red",
      "yellow",
      "green"
    ],
    "size": [
      "medium",
      "large",
      "x-small"
    ],
    "thumbnail_url": "grey-t-shirt_4460x4460.jpg",
    "image_url": "grey-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 91,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "High Neck Boyfriend Shirt",
    "brand": "Frockzy",
    "price_sale": 36.99,
    "price_actual": 52.99,
    "price_savings": 16,
    "short_desc": "Biodiesel shabby chic cliche vaporware. Snackwave four loko cardigan gastropub, fixie crucifix adaptogen poke fam seitan yr. Letterpress gluten-free portland tumblr roof party freegan ramps. Fanny pack...",
    "long_desc": "Biodiesel shabby chic cliche vaporware. Snackwave four loko cardigan gastropub, fixie crucifix adaptogen poke fam seitan yr. Letterpress gluten-free portland tumblr roof party freegan ramps. Fanny pack poutine taxidermy raclette vexillologist, offal schlitz mixtape.",
    "rating": 4.3,
    "rating_count": 24,
    "color": [
      "red",
      "green",
      "yellow"
    ],
    "size": [
      "x-small",
      "x-large"
    ],
    "thumbnail_url": "light-green-t-shirt_4460x4460.jpg",
    "image_url": "light-green-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 92,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "High Neck Peasant Top",
    "brand": "Frockzy",
    "price_sale": 60.99,
    "price_actual": 80.99,
    "price_savings": 20,
    "short_desc": "Drinking vinegar slow-carb put a bird on it actually hammock. Schlitz marfa tumeric austin meh small batch cliche jean shorts. Activated charcoal bitters disrupt banjo tote bag raw denim gochujang organic...",
    "long_desc": "Drinking vinegar slow-carb put a bird on it actually hammock. Schlitz marfa tumeric austin meh small batch cliche jean shorts. Activated charcoal bitters disrupt banjo tote bag raw denim gochujang organic migas slow-carb ethical. Kinfolk organic gochujang lumbersexual. Chia affogato flexitarian fanny pack shabby chic copper mug. Keytar single-origin coffee normcore health goth.",
    "rating": 3.9,
    "rating_count": 168,
    "color": [
      "red",
      "yellow",
      "green"
    ],
    "size": [
      "large",
      "x-small",
      "medium"
    ],
    "thumbnail_url": "red-t-shirt_4460x4460.jpg",
    "image_url": "red-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 93,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Sleeveless Peplum",
    "brand": "Wovest",
    "price_sale": 34.99,
    "price_actual": 58.99,
    "price_savings": 24,
    "short_desc": "Cardigan fingerstache vice, distillery vaporware photo booth keffiyeh. Godard vice pok pok quinoa. Four dollar toast cloud bread pork belly, offal fashion axe shaman kogi bicycle rights you probably haven't...",
    "long_desc": "Cardigan fingerstache vice, distillery vaporware photo booth keffiyeh. Godard vice pok pok quinoa. Four dollar toast cloud bread pork belly, offal fashion axe shaman kogi bicycle rights you probably haven't heard of them stumptown iceland. Freegan chillwave food truck lomo typewriter forage raclette bicycle rights tacos fixie try-hard marfa four loko scenester gentrify.",
    "rating": 3.9,
    "rating_count": 70,
    "color": [
      "blue",
      "red"
    ],
    "size": [
      "x-large",
      "small"
    ],
    "thumbnail_url": "purple-t-shirt_4460x4460.jpg",
    "image_url": "purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 94,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Square Neck Button-up Shirt",
    "brand": "Coutique",
    "price_sale": 16.99,
    "price_actual": 28.99,
    "price_savings": 12,
    "short_desc": "Irony artisan gluten-free cold-pressed vaporware tattooed, kogi edison bulb af chicharrones forage intelligentsia kombucha hot chicken try-hard. Ramps trust fund fanny pack pug poutine microdosing tattooed...",
    "long_desc": "Irony artisan gluten-free cold-pressed vaporware tattooed, kogi edison bulb af chicharrones forage intelligentsia kombucha hot chicken try-hard. Ramps trust fund fanny pack pug poutine microdosing tattooed pitchfork vape dreamcatcher drinking vinegar banh mi copper mug disrupt actually. Neutra palo santo man bun chia photo booth master cleanse ramps echo park heirloom cornhole.",
    "rating": 3.4,
    "rating_count": 113,
    "color": [
      "blue",
      "green"
    ],
    "size": [
      "small",
      "x-small",
      "medium"
    ],
    "thumbnail_url": "cobalt-blue-t-shirt_4460x4460.jpg",
    "image_url": "cobalt-blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 95,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Short Sleeved T-Shirt",
    "brand": "Hipcrave",
    "price_sale": 24.99,
    "price_actual": 53.99,
    "price_savings": 29,
    "short_desc": "Chambray ennui distillery vice, bespoke slow-carb helvetica. Vexillologist palo santo authentic, listicle 8-bit fanny pack food truck bushwick pok pok. Photo booth bushwick jean shorts, austin actually...",
    "long_desc": "Chambray ennui distillery vice, bespoke slow-carb helvetica. Vexillologist palo santo authentic, listicle 8-bit fanny pack food truck bushwick pok pok. Photo booth bushwick jean shorts, austin actually wolf selvage. Helvetica next level brunch four dollar toast poutine messenger bag mustache sriracha try-hard selfies copper mug scenester cold-pressed mlkshk chillwave.",
    "rating": 4.2,
    "rating_count": 80,
    "color": [
      "red",
      "blue",
      "yellow"
    ],
    "size": [
      "x-large",
      "medium",
      "small"
    ],
    "thumbnail_url": "green-t-shirt_4460x4460.jpg",
    "image_url": "green-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 96,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Knit T-Shirt",
    "brand": "Hipcrave",
    "price_sale": 60.99,
    "price_actual": 81.99,
    "price_savings": 21,
    "short_desc": "Umami green juice put a bird on it bicycle rights street art lo-fi. Hoodie iPhone hashtag neutra, trust fund ethical williamsburg austin drinking vinegar crucifix. Lo-fi mixtape XOXO retro. Truffaut slow-carb...",
    "long_desc": "Umami green juice put a bird on it bicycle rights street art lo-fi. Hoodie iPhone hashtag neutra, trust fund ethical williamsburg austin drinking vinegar crucifix. Lo-fi mixtape XOXO retro. Truffaut slow-carb put a bird on it aesthetic scenester meh blue bottle squid keytar banh mi master cleanse YOLO. Fashion axe celiac kogi heirloom, tilde pinterest prism viral organic palo santo green juice venmo thundercats.",
    "rating": 4.3,
    "rating_count": 89,
    "color": [
      "red",
      "yellow"
    ],
    "size": [
      "x-small",
      "medium",
      "small"
    ],
    "thumbnail_url": "light-green-t-shirt_4460x4460.jpg",
    "image_url": "light-green-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 97,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "High Neck T-Shirt",
    "brand": "Bouture",
    "price_sale": 43.99,
    "price_actual": 68.99,
    "price_savings": 25,
    "short_desc": "Hot chicken shaman banh mi, pok pok green juice tote bag taxidermy photo booth freegan. Lumbersexual affogato vaporware adaptogen. Godard normcore kinfolk af poutine farm-to-table. Paleo succulents edison...",
    "long_desc": "Hot chicken shaman banh mi, pok pok green juice tote bag taxidermy photo booth freegan. Lumbersexual affogato vaporware adaptogen. Godard normcore kinfolk af poutine farm-to-table. Paleo succulents edison bulb, farm-to-table mumblecore umami cloud bread. Sartorial hell of +1 activated charcoal cornhole leggings put a bird on it kitsch franzen raclette man bun.",
    "rating": 2.9,
    "rating_count": 47,
    "color": [
      "green",
      "yellow",
      "red"
    ],
    "size": [
      "large",
      "small"
    ],
    "thumbnail_url": "grey-t-shirt_4460x4460.jpg",
    "image_url": "grey-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 98,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Preppy Blouse",
    "brand": "Coutique",
    "price_sale": 24.99,
    "price_actual": 53.99,
    "price_savings": 29,
    "short_desc": "Swag cred pop-up try-hard sriracha four loko neutra farm-to-table. Vaporware 8-bit fam freegan neutra cloud bread gentrify cray la croix. Tumblr cliche letterpress banh mi YOLO, air plant pop-up tbh fingerstache...",
    "long_desc": "Swag cred pop-up try-hard sriracha four loko neutra farm-to-table. Vaporware 8-bit fam freegan neutra cloud bread gentrify cray la croix. Tumblr cliche letterpress banh mi YOLO, air plant pop-up tbh fingerstache iceland mixtape pour-over freegan. Cliche drinking vinegar pork belly locavore tumeric jianbing viral mumblecore quinoa shoreditch master cleanse photo booth keytar.",
    "rating": 2.2,
    "rating_count": 30,
    "color": [
      "blue",
      "green",
      "red"
    ],
    "size": [
      "medium",
      "small",
      "x-large",
      "large"
    ],
    "thumbnail_url": "teal-t-shirt_4460x4460.jpg",
    "image_url": "teal-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 99,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "High Neck Peasant Top",
    "brand": "Knitage",
    "price_sale": 44.99,
    "price_actual": 60.99,
    "price_savings": 16,
    "short_desc": "Fixie tilde selvage, godard +1 tote bag fam schlitz. Jean shorts neutra dreamcatcher literally biodiesel, wolf flannel whatever four loko chartreuse raw denim. Authentic activated charcoal wolf bushwick...",
    "long_desc": "Fixie tilde selvage, godard +1 tote bag fam schlitz. Jean shorts neutra dreamcatcher literally biodiesel, wolf flannel whatever four loko chartreuse raw denim. Authentic activated charcoal wolf bushwick copper mug tumblr.",
    "rating": 4.3,
    "rating_count": 58,
    "color": [
      "blue",
      "red",
      "yellow"
    ],
    "size": [
      "x-small",
      "x-large",
      "large",
      "small"
    ],
    "thumbnail_url": "light-green-t-shirt_4460x4460.jpg",
    "image_url": "light-green-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 100,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "V-Neck Wrap Top",
    "brand": "Coutique",
    "price_sale": 32.99,
    "price_actual": 45.99,
    "price_savings": 13,
    "short_desc": "Fam prism man bun pork belly pok pok yuccie retro snackwave cred mustache ennui craft beer fashion axe ugh. Skateboard master cleanse salvia, messenger bag af live-edge wolf fam echo park. Af YOLO shoreditch...",
    "long_desc": "Fam prism man bun pork belly pok pok yuccie retro snackwave cred mustache ennui craft beer fashion axe ugh. Skateboard master cleanse salvia, messenger bag af live-edge wolf fam echo park. Af YOLO shoreditch gastropub wolf. Cardigan microdosing small batch pug, hoodie tumblr church-key bitters glossier stumptown. VHS viral photo booth copper mug, poutine tote bag gastropub twee food truck slow-carb helvetica raw denim.",
    "rating": 2.7,
    "rating_count": 128,
    "color": [
      "green",
      "yellow"
    ],
    "size": [
      "x-small",
      "medium"
    ],
    "thumbnail_url": "green-t-shirt_4460x4460.jpg",
    "image_url": "green-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 101,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Striped Shirt",
    "brand": "Frockzy",
    "price_sale": 30.99,
    "price_actual": 53.99,
    "price_savings": 23,
    "short_desc": "Pork belly hot chicken polaroid skateboard tousled yr. Mustache fanny pack activated charcoal, normcore taiyaki adaptogen man bun. Slow-carb trust fund post-ironic, plaid kombucha put a bird on it fanny...",
    "long_desc": "Pork belly hot chicken polaroid skateboard tousled yr. Mustache fanny pack activated charcoal, normcore taiyaki adaptogen man bun. Slow-carb trust fund post-ironic, plaid kombucha put a bird on it fanny pack poutine helvetica lumbersexual flannel fashion axe. Asymmetrical street art flexitarian art party, organic four dollar toast mixtape pork belly lo-fi you probably haven't heard of them biodiesel cardigan small batch.",
    "rating": 3.7,
    "rating_count": 21,
    "color": [
      "blue",
      "green",
      "yellow"
    ],
    "size": [
      "medium",
      "small",
      "x-large"
    ],
    "thumbnail_url": "green-t-shirt_4460x4460.jpg",
    "image_url": "green-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 102,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Lace Trim T-Shirt",
    "brand": "Coutique",
    "price_sale": 65.99,
    "price_actual": 83.99,
    "price_savings": 18,
    "short_desc": "Intelligentsia adaptogen kitsch, typewriter four dollar toast unicorn viral tacos crucifix pug. Quinoa man bun ramps distillery seitan, migas bitters cliche four dollar toast echo park shoreditch. Mixtape...",
    "long_desc": "Intelligentsia adaptogen kitsch, typewriter four dollar toast unicorn viral tacos crucifix pug. Quinoa man bun ramps distillery seitan, migas bitters cliche four dollar toast echo park shoreditch. Mixtape celiac church-key health goth enamel pin tilde freegan bespoke blue bottle typewriter. Pickled umami tbh cred pour-over irony art party actually ethical gochujang.",
    "rating": 2.3,
    "rating_count": 109,
    "color": [
      "green",
      "blue"
    ],
    "size": [
      "large",
      "x-large",
      "x-small",
      "medium"
    ],
    "thumbnail_url": "bright-purple-t-shirt_4460x4460.jpg",
    "image_url": "bright-purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 103,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Sweaters and Cardigans",
    "product_name": "Cozy Cardigan",
    "brand": "Bouture",
    "price_sale": 31.99,
    "price_actual": 65.99,
    "price_savings": 34,
    "short_desc": "Mumblecore pok pok kombucha letterpress, distillery live-edge yuccie iceland air plant chicharrones hella lo-fi brooklyn tilde everyday carry. DIY tilde tattooed meh, fashion axe godard next level slow-carb...",
    "long_desc": "Mumblecore pok pok kombucha letterpress, distillery live-edge yuccie iceland air plant chicharrones hella lo-fi brooklyn tilde everyday carry. DIY tilde tattooed meh, fashion axe godard next level slow-carb copper mug +1. VHS pork belly poke la croix street art celiac, vaporware vice. Plaid photo booth salvia, cronut master cleanse banjo ethical tousled chia squid bicycle rights chicharrones pour-over austin mumblecore.",
    "rating": 2.6,
    "rating_count": 86,
    "color": [
      "yellow",
      "red",
      "green"
    ],
    "size": [
      "x-large",
      "x-small"
    ],
    "thumbnail_url": "bright-purple-t-shirt_4460x4460.jpg",
    "image_url": "bright-purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 104,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Smocked Tunic",
    "brand": "Garmtech",
    "price_sale": 33.99,
    "price_actual": 71.99,
    "price_savings": 38,
    "short_desc": "Banh mi artisan godard stumptown, polaroid woke food truck 8-bit subway tile sustainable you probably haven't heard of them keffiyeh literally. Cliche williamsburg cornhole austin fanny pack. Selfies next...",
    "long_desc": "Banh mi artisan godard stumptown, polaroid woke food truck 8-bit subway tile sustainable you probably haven't heard of them keffiyeh literally. Cliche williamsburg cornhole austin fanny pack. Selfies next level drinking vinegar wayfarers intelligentsia meditation man bun. Selfies crucifix you probably haven't heard of them chicharrones squid small batch selvage. Keffiyeh lo-fi iceland scenester VHS.",
    "rating": 3.4,
    "rating_count": 127,
    "color": [
      "red",
      "green",
      "blue"
    ],
    "size": [
      "large",
      "medium",
      "small",
      "x-small"
    ],
    "thumbnail_url": "blue-t-shirt_4460x4460.jpg",
    "image_url": "blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 105,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Floral-print T-Shirt",
    "brand": "Knitage",
    "price_sale": 29.99,
    "price_actual": 37.99,
    "price_savings": 8,
    "short_desc": "Glossier ennui you probably haven't heard of them flannel coloring book salvia. Art party biodiesel lomo, jean shorts freegan skateboard jianbing prism humblebrag viral blue bottle shaman. Viral tumeric...",
    "long_desc": "Glossier ennui you probably haven't heard of them flannel coloring book salvia. Art party biodiesel lomo, jean shorts freegan skateboard jianbing prism humblebrag viral blue bottle shaman. Viral tumeric food truck messenger bag skateboard helvetica normcore man bun iceland pinterest yuccie activated charcoal kitsch migas.",
    "rating": 2.9,
    "rating_count": 74,
    "color": [
      "red",
      "blue",
      "green"
    ],
    "size": [
      "medium",
      "x-small",
      "small",
      "x-large"
    ],
    "thumbnail_url": "light-green-t-shirt_4460x4460.jpg",
    "image_url": "light-green-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 106,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Smocked T-Shirt",
    "brand": "Hipcrave",
    "price_sale": 26.99,
    "price_actual": 33.99,
    "price_savings": 7,
    "short_desc": "Lomo venmo literally bitters jean shorts shabby chic ennui enamel pin vegan roof party VHS four dollar toast ethical. Asymmetrical bitters franzen tacos. Coloring book normcore chia unicorn, 8-bit iceland...",
    "long_desc": "Lomo venmo literally bitters jean shorts shabby chic ennui enamel pin vegan roof party VHS four dollar toast ethical. Asymmetrical bitters franzen tacos. Coloring book normcore chia unicorn, 8-bit iceland cronut brooklyn. Dreamcatcher austin banh mi XOXO bicycle rights. Health goth photo booth try-hard fanny pack, messenger bag tattooed snackwave raw denim cronut quinoa kinfolk DIY. Try-hard food truck blue bottle kogi pickled.",
    "rating": 4.8,
    "rating_count": 91,
    "color": [
      "red",
      "green",
      "blue"
    ],
    "size": [
      "small",
      "x-large"
    ],
    "thumbnail_url": "grey-t-shirt_4460x4460.jpg",
    "image_url": "grey-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 107,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Preppy Shirt",
    "brand": "Bouture",
    "price_sale": 29.99,
    "price_actual": 47.99,
    "price_savings": 18,
    "short_desc": "Try-hard YOLO pinterest mlkshk pabst humblebrag. Aesthetic taxidermy af cold-pressed VHS blog umami offal neutra biodiesel tacos thundercats salvia succulents. Portland hella mixtape sartorial vinyl jianbing...",
    "long_desc": "Try-hard YOLO pinterest mlkshk pabst humblebrag. Aesthetic taxidermy af cold-pressed VHS blog umami offal neutra biodiesel tacos thundercats salvia succulents. Portland hella mixtape sartorial vinyl jianbing listicle +1. Tumeric offal intelligentsia post-ironic, cold-pressed letterpress beard shabby chic gentrify twee prism edison bulb tbh. Messenger bag coloring book kitsch hot chicken vaporware taiyaki.",
    "rating": 2.2,
    "rating_count": 33,
    "color": [
      "blue",
      "yellow"
    ],
    "size": [
      "x-large",
      "medium",
      "small"
    ],
    "thumbnail_url": "red-t-shirt_4460x4460.jpg",
    "image_url": "red-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 108,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Drapey T-Shirt",
    "brand": "Bouture",
    "price_sale": 38.99,
    "price_actual": 79.99,
    "price_savings": 41,
    "short_desc": "Af williamsburg meditation activated charcoal. Vice banh mi subway tile ethical pabst, tattooed salvia hot chicken hoodie health goth hella prism artisan crucifix small batch. Skateboard succulents la...",
    "long_desc": "Af williamsburg meditation activated charcoal. Vice banh mi subway tile ethical pabst, tattooed salvia hot chicken hoodie health goth hella prism artisan crucifix small batch. Skateboard succulents la croix mumblecore plaid subway tile vaporware messenger bag green juice lumbersexual offal cloud bread four dollar toast chia seitan. Raclette ethical la croix plaid chia, green juice cray echo park iceland kitsch.",
    "rating": 2.9,
    "rating_count": 48,
    "color": [
      "blue",
      "green"
    ],
    "size": [
      "large",
      "medium",
      "small"
    ],
    "thumbnail_url": "light-green-t-shirt_4460x4460.jpg",
    "image_url": "light-green-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 109,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Sweaters and Cardigans",
    "product_name": "Slim Sweater",
    "brand": "Frockzy",
    "price_sale": 30.99,
    "price_actual": 62.99,
    "price_savings": 32,
    "short_desc": "Pug cray jianbing prism hammock vice roof party narwhal forage chicharrones gluten-free. Portland everyday carry letterpress squid, offal bicycle rights cardigan neutra roof party hoodie adaptogen tacos...",
    "long_desc": "Pug cray jianbing prism hammock vice roof party narwhal forage chicharrones gluten-free. Portland everyday carry letterpress squid, offal bicycle rights cardigan neutra roof party hoodie adaptogen tacos franzen. 3 wolf moon kinfolk actually crucifix tattooed selfies. Migas ennui poke, live-edge hot chicken franzen cray pinterest man braid stumptown adaptogen tumblr letterpress.",
    "rating": 2.6,
    "rating_count": 144,
    "color": [
      "green",
      "blue"
    ],
    "size": [
      "large",
      "x-large"
    ],
    "thumbnail_url": "purple-t-shirt_4460x4460.jpg",
    "image_url": "purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 110,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Slim Blouse",
    "brand": "Frockzy",
    "price_sale": 16.99,
    "price_actual": 25.99,
    "price_savings": 9,
    "short_desc": "Pickled put a bird on it man braid, intelligentsia retro art party quinoa shoreditch readymade. Hoodie yuccie selfies, microdosing pickled neutra deep v kitsch sriracha letterpress cold-pressed offal next...",
    "long_desc": "Pickled put a bird on it man braid, intelligentsia retro art party quinoa shoreditch readymade. Hoodie yuccie selfies, microdosing pickled neutra deep v kitsch sriracha letterpress cold-pressed offal next level +1. Shabby chic raclette affogato pork belly meditation whatever. Meh intelligentsia church-key, kinfolk ramps hell of direct trade seitan mixtape pinterest XOXO marfa.",
    "rating": 3.8,
    "rating_count": 96,
    "color": [
      "blue",
      "yellow"
    ],
    "size": [
      "large",
      "medium",
      "x-large"
    ],
    "thumbnail_url": "cobalt-blue-t-shirt_4460x4460.jpg",
    "image_url": "cobalt-blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 111,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "High Neck T-Shirt",
    "brand": "Wovest",
    "price_sale": 62.99,
    "price_actual": 86.99,
    "price_savings": 24,
    "short_desc": "Messenger bag lyft franzen, synth raw denim viral unicorn knausgaard irony hell of leggings selvage yr. Microdosing woke single-origin coffee skateboard hella slow-carb. Vegan tousled irony occupy asymmetrical...",
    "long_desc": "Messenger bag lyft franzen, synth raw denim viral unicorn knausgaard irony hell of leggings selvage yr. Microdosing woke single-origin coffee skateboard hella slow-carb. Vegan tousled irony occupy asymmetrical retro you probably haven't heard of them try-hard typewriter selfies air plant. Roof party four loko schlitz DIY chia.",
    "rating": 2.2,
    "rating_count": 147,
    "color": [
      "blue",
      "red",
      "yellow"
    ],
    "size": [
      "x-small",
      "small",
      "large"
    ],
    "thumbnail_url": "purple-t-shirt_4460x4460.jpg",
    "image_url": "purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 112,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Sweaters and Cardigans",
    "product_name": "Merino Sweatshirt",
    "brand": "Knitage",
    "price_sale": 44.99,
    "price_actual": 57.99,
    "price_savings": 13,
    "short_desc": "90's lyft butcher scenester williamsburg cornhole. La croix yr small batch, brooklyn schlitz hammock before they sold out jean shorts leggings portland vinyl synth shaman blue bottle bushwick. Schlitz...",
    "long_desc": "90's lyft butcher scenester williamsburg cornhole. La croix yr small batch, brooklyn schlitz hammock before they sold out jean shorts leggings portland vinyl synth shaman blue bottle bushwick. Schlitz church-key artisan fanny pack palo santo. Pork belly selfies ennui tacos, woke raw denim fam hell of polaroid 8-bit kogi butcher lyft readymade.",
    "rating": 2.5,
    "rating_count": 141,
    "color": [
      "red",
      "green"
    ],
    "size": [
      "medium",
      "large"
    ],
    "thumbnail_url": "grey-t-shirt_4460x4460.jpg",
    "image_url": "grey-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 113,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "High Neck Button-up Shirt",
    "brand": "Wovest",
    "price_sale": 28.99,
    "price_actual": 47.99,
    "price_savings": 19,
    "short_desc": "Man braid affogato pour-over sartorial leggings tumblr irony aesthetic authentic umami chartreuse gochujang. Sustainable gastropub fingerstache, blog literally activated charcoal small batch skateboard...",
    "long_desc": "Man braid affogato pour-over sartorial leggings tumblr irony aesthetic authentic umami chartreuse gochujang. Sustainable gastropub fingerstache, blog literally activated charcoal small batch skateboard thundercats. Bitters food truck pok pok pinterest umami kogi succulents kitsch, air plant iceland. Tumblr irony hoodie hell of vegan. Four dollar toast yuccie YOLO mumblecore.",
    "rating": 3.7,
    "rating_count": 96,
    "color": [
      "yellow",
      "green",
      "blue"
    ],
    "size": [
      "small",
      "x-small"
    ],
    "thumbnail_url": "bright-purple-t-shirt_4460x4460.jpg",
    "image_url": "bright-purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 114,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Long Sleeved Shirt",
    "brand": "Frockzy",
    "price_sale": 45.99,
    "price_actual": 68.99,
    "price_savings": 23,
    "short_desc": "Artisan woke tattooed health goth 3 wolf moon fingerstache umami lumbersexual stumptown godard deep v air plant. Truffaut slow-carb put a bird on it aesthetic scenester meh blue bottle squid keytar banh...",
    "long_desc": "Artisan woke tattooed health goth 3 wolf moon fingerstache umami lumbersexual stumptown godard deep v air plant. Truffaut slow-carb put a bird on it aesthetic scenester meh blue bottle squid keytar banh mi master cleanse YOLO. Fashion axe celiac kogi heirloom, tilde pinterest prism viral organic palo santo green juice venmo thundercats.",
    "rating": 2.2,
    "rating_count": 129,
    "color": [
      "yellow",
      "blue"
    ],
    "size": [
      "small",
      "large",
      "medium"
    ],
    "thumbnail_url": "cobalt-blue-t-shirt_4460x4460.jpg",
    "image_url": "cobalt-blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 115,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "High Neck T-Shirt",
    "brand": "Wovest",
    "price_sale": 44.99,
    "price_actual": 75.99,
    "price_savings": 31,
    "short_desc": "Gluten-free hella unicorn glossier taiyaki bespoke skateboard bushwick godard organic ugh single-origin coffee artisan VHS chia. Vaporware crucifix farm-to-table you probably haven't heard of them. Truffaut...",
    "long_desc": "Gluten-free hella unicorn glossier taiyaki bespoke skateboard bushwick godard organic ugh single-origin coffee artisan VHS chia. Vaporware crucifix farm-to-table you probably haven't heard of them. Truffaut irony cloud bread try-hard.",
    "rating": 3.7,
    "rating_count": 126,
    "color": [
      "yellow",
      "green",
      "red"
    ],
    "size": [
      "x-large",
      "large"
    ],
    "thumbnail_url": "red-t-shirt_4460x4460.jpg",
    "image_url": "red-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 116,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "High Neck T-Shirt",
    "brand": "Bouture",
    "price_sale": 49.99,
    "price_actual": 66.99,
    "price_savings": 17,
    "short_desc": "Artisan viral umami ennui, yuccie hella prism copper mug. Pug food truck bicycle rights unicorn, lyft glossier raw denim raclette man bun blog hell of. Fashion axe offal hexagon shaman DIY, ramps live-edge...",
    "long_desc": "Artisan viral umami ennui, yuccie hella prism copper mug. Pug food truck bicycle rights unicorn, lyft glossier raw denim raclette man bun blog hell of. Fashion axe offal hexagon shaman DIY, ramps live-edge small batch mumblecore 90's gastropub. +1 biodiesel etsy cold-pressed, DIY distillery tattooed semiotics cloud bread organic kogi kale chips subway tile PBR&B messenger bag. Mumblecore forage tote bag echo park iceland williamsburg asymmetrical.",
    "rating": 4.1,
    "rating_count": 196,
    "color": [
      "yellow",
      "green",
      "blue"
    ],
    "size": [
      "x-large",
      "x-small",
      "small",
      "medium"
    ],
    "thumbnail_url": "green-t-shirt_4460x4460.jpg",
    "image_url": "green-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 117,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "High Neck Blouse",
    "brand": "Hipcrave",
    "price_sale": 53.99,
    "price_actual": 76.99,
    "price_savings": 23,
    "short_desc": "Lomo celiac hexagon hashtag thundercats brunch fingerstache forage PBR&B live-edge. Migas four loko mumblecore tacos, synth forage asymmetrical kogi 3 wolf moon. Polaroid tattooed man braid subway tile,...",
    "long_desc": "Lomo celiac hexagon hashtag thundercats brunch fingerstache forage PBR&B live-edge. Migas four loko mumblecore tacos, synth forage asymmetrical kogi 3 wolf moon. Polaroid tattooed man braid subway tile, williamsburg four dollar toast fanny pack gochujang. Dreamcatcher cray four dollar toast chicharrones iceland. Pok pok blog XOXO banh mi mixtape hot chicken plaid gochujang.",
    "rating": 2.3,
    "rating_count": 97,
    "color": [
      "blue",
      "yellow"
    ],
    "size": [
      "small",
      "x-small",
      "x-large"
    ],
    "thumbnail_url": "grey-t-shirt_4460x4460.jpg",
    "image_url": "grey-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 118,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Fitted T-Shirt",
    "brand": "Wovest",
    "price_sale": 33.99,
    "price_actual": 54.99,
    "price_savings": 21,
    "short_desc": "Jianbing readymade church-key helvetica. Venmo palo santo blue bottle artisan, selfies bespoke sartorial mixtape tumeric. Vinyl cred heirloom, fanny pack chambray locavore bushwick four loko meggings pop-up....",
    "long_desc": "Jianbing readymade church-key helvetica. Venmo palo santo blue bottle artisan, selfies bespoke sartorial mixtape tumeric. Vinyl cred heirloom, fanny pack chambray locavore bushwick four loko meggings pop-up. Wayfarers chia before they sold out, adaptogen gentrify etsy waistcoat subway tile viral hashtag. Tattooed taxidermy narwhal raclette, jean shorts prism messenger bag blog waistcoat wayfarers air plant pickled fixie lomo.",
    "rating": 3.6,
    "rating_count": 177,
    "color": [
      "yellow",
      "blue",
      "green"
    ],
    "size": [
      "x-large",
      "x-small",
      "small"
    ],
    "thumbnail_url": "cobalt-blue-t-shirt_4460x4460.jpg",
    "image_url": "cobalt-blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 119,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Lace Trim T-Shirt",
    "brand": "Frockzy",
    "price_sale": 17.99,
    "price_actual": 25.99,
    "price_savings": 8,
    "short_desc": "Fashion axe tumeric raclette actually vape letterpress tbh hell of health goth. Ethical la croix iPhone sustainable four dollar toast cronut freegan selfies poutine quinoa glossier pabst food truck austin...",
    "long_desc": "Fashion axe tumeric raclette actually vape letterpress tbh hell of health goth. Ethical la croix iPhone sustainable four dollar toast cronut freegan selfies poutine quinoa glossier pabst food truck austin dreamcatcher.",
    "rating": 3.5,
    "rating_count": 141,
    "color": [
      "yellow",
      "red"
    ],
    "size": [
      "medium",
      "large",
      "x-small"
    ],
    "thumbnail_url": "grey-t-shirt_4460x4460.jpg",
    "image_url": "grey-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 120,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Drapey Peplum",
    "brand": "Bouture",
    "price_sale": 39.99,
    "price_actual": 78.99,
    "price_savings": 39,
    "short_desc": "Truffaut man braid heirloom af bespoke asymmetrical. Trust fund umami gastropub unicorn drinking vinegar. Truffaut poke beard, whatever drinking vinegar fam hell of man bun schlitz bicycle rights coloring...",
    "long_desc": "Truffaut man braid heirloom af bespoke asymmetrical. Trust fund umami gastropub unicorn drinking vinegar. Truffaut poke beard, whatever drinking vinegar fam hell of man bun schlitz bicycle rights coloring book hashtag chartreuse. Aesthetic truffaut kitsch, poutine chillwave meh semiotics squid.",
    "rating": 4,
    "rating_count": 125,
    "color": [
      "blue",
      "red",
      "yellow"
    ],
    "size": [
      "medium",
      "small"
    ],
    "thumbnail_url": "blue-t-shirt_4460x4460.jpg",
    "image_url": "blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 121,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Sleeveless T-Shirt",
    "brand": "Bouture",
    "price_sale": 21.99,
    "price_actual": 28.99,
    "price_savings": 7,
    "short_desc": "Narwhal echo park fashion axe try-hard prism chambray woke gastropub hexagon. Jean shorts adaptogen shabby chic waistcoat locavore single-origin coffee freegan try-hard cardigan mlkshk aesthetic unicorn....",
    "long_desc": "Narwhal echo park fashion axe try-hard prism chambray woke gastropub hexagon. Jean shorts adaptogen shabby chic waistcoat locavore single-origin coffee freegan try-hard cardigan mlkshk aesthetic unicorn. Glossier fanny pack portland austin retro squid cliche shaman schlitz kale chips listicle seitan vegan everyday carry XOXO. Bicycle rights bushwick scenester twee roof party shoreditch chillwave thundercats distillery dreamcatcher tacos mlkshk austin.",
    "rating": 3.9,
    "rating_count": 181,
    "color": [
      "green",
      "blue"
    ],
    "size": [
      "small",
      "x-large",
      "medium",
      "large"
    ],
    "thumbnail_url": "bright-purple-t-shirt_4460x4460.jpg",
    "image_url": "bright-purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 122,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Smocked T-Shirt",
    "brand": "Hipcrave",
    "price_sale": 49.99,
    "price_actual": 86.99,
    "price_savings": 37,
    "short_desc": "Mustache marfa narwhal portland pitchfork fixie tote bag authentic asymmetrical prism. Wayfarers neutra retro pour-over distillery cardigan tote bag pork belly ethical church-key unicorn +1 tofu af health...",
    "long_desc": "Mustache marfa narwhal portland pitchfork fixie tote bag authentic asymmetrical prism. Wayfarers neutra retro pour-over distillery cardigan tote bag pork belly ethical church-key unicorn +1 tofu af health goth. Pork belly 3 wolf moon hammock, tote bag sriracha food truck VHS jianbing godard cornhole chia gochujang yuccie taiyaki.",
    "rating": 4,
    "rating_count": 118,
    "color": [
      "yellow",
      "blue",
      "green"
    ],
    "size": [
      "large",
      "x-small",
      "x-large",
      "medium"
    ],
    "thumbnail_url": "grey-t-shirt_4460x4460.jpg",
    "image_url": "grey-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 123,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Square Neck Boyfriend Shirt",
    "brand": "Frockzy",
    "price_sale": 43.99,
    "price_actual": 81.99,
    "price_savings": 38,
    "short_desc": "Dreamcatcher leggings fixie fashion axe bicycle rights hoodie. Affogato helvetica pok pok, letterpress crucifix meggings drinking vinegar leggings. Quinoa pinterest green juice sustainable next level,...",
    "long_desc": "Dreamcatcher leggings fixie fashion axe bicycle rights hoodie. Affogato helvetica pok pok, letterpress crucifix meggings drinking vinegar leggings. Quinoa pinterest green juice sustainable next level, forage hell of semiotics crucifix taiyaki typewriter lo-fi gentrify shaman mumblecore. Cornhole marfa wolf bespoke asymmetrical beard ramps yuccie hella roof party air plant.",
    "rating": 4.8,
    "rating_count": 135,
    "color": [
      "red",
      "yellow"
    ],
    "size": [
      "large",
      "x-large",
      "x-small"
    ],
    "thumbnail_url": "green-t-shirt_4460x4460.jpg",
    "image_url": "green-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 124,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Drapey Wrap Top",
    "brand": "Bouture",
    "price_sale": 58.99,
    "price_actual": 74.99,
    "price_savings": 16,
    "short_desc": "Succulents aesthetic wayfarers, celiac synth vaporware quinoa disrupt unicorn iPhone. Occupy leggings literally, keytar kogi actually mustache. Flexitarian cardigan adaptogen listicle air plant taiyaki....",
    "long_desc": "Succulents aesthetic wayfarers, celiac synth vaporware quinoa disrupt unicorn iPhone. Occupy leggings literally, keytar kogi actually mustache. Flexitarian cardigan adaptogen listicle air plant taiyaki. Intelligentsia unicorn thundercats farm-to-table, organic church-key jianbing fashion axe fixie readymade typewriter.",
    "rating": 3.8,
    "rating_count": 25,
    "color": [
      "blue",
      "red"
    ],
    "size": [
      "small",
      "large",
      "medium"
    ],
    "thumbnail_url": "teal-t-shirt_4460x4460.jpg",
    "image_url": "teal-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 125,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Pleated Button-up Shirt",
    "brand": "Bouture",
    "price_sale": 48.99,
    "price_actual": 76.99,
    "price_savings": 28,
    "short_desc": "Biodiesel shabby chic cliche vaporware. Snackwave four loko cardigan gastropub, fixie crucifix adaptogen poke fam seitan yr. Letterpress gluten-free portland tumblr roof party freegan ramps. Fanny pack...",
    "long_desc": "Biodiesel shabby chic cliche vaporware. Snackwave four loko cardigan gastropub, fixie crucifix adaptogen poke fam seitan yr. Letterpress gluten-free portland tumblr roof party freegan ramps. Fanny pack poutine taxidermy raclette vexillologist, offal schlitz mixtape.",
    "rating": 4.6,
    "rating_count": 60,
    "color": [
      "green",
      "yellow"
    ],
    "size": [
      "medium",
      "x-large",
      "small",
      "large"
    ],
    "thumbnail_url": "bright-purple-t-shirt_4460x4460.jpg",
    "image_url": "bright-purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 126,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Linen T-Shirt",
    "brand": "Bouture",
    "price_sale": 36.99,
    "price_actual": 49.99,
    "price_savings": 13,
    "short_desc": "Drinking vinegar slow-carb put a bird on it actually hammock. Schlitz marfa tumeric austin meh small batch cliche jean shorts. Activated charcoal bitters disrupt banjo tote bag raw denim gochujang organic...",
    "long_desc": "Drinking vinegar slow-carb put a bird on it actually hammock. Schlitz marfa tumeric austin meh small batch cliche jean shorts. Activated charcoal bitters disrupt banjo tote bag raw denim gochujang organic migas slow-carb ethical. Kinfolk organic gochujang lumbersexual. Chia affogato flexitarian fanny pack shabby chic copper mug. Keytar single-origin coffee normcore health goth.",
    "rating": 3.5,
    "rating_count": 135,
    "color": [
      "red",
      "blue"
    ],
    "size": [
      "large",
      "x-small",
      "medium"
    ],
    "thumbnail_url": "green-t-shirt_4460x4460.jpg",
    "image_url": "green-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 127,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Sweaters and Cardigans",
    "product_name": "Slim Sweatshirt",
    "brand": "Knitage",
    "price_sale": 53.99,
    "price_actual": 76.99,
    "price_savings": 23,
    "short_desc": "Cardigan fingerstache vice, distillery vaporware photo booth keffiyeh. Godard vice pok pok quinoa. Four dollar toast cloud bread pork belly, offal fashion axe shaman kogi bicycle rights you probably haven't...",
    "long_desc": "Cardigan fingerstache vice, distillery vaporware photo booth keffiyeh. Godard vice pok pok quinoa. Four dollar toast cloud bread pork belly, offal fashion axe shaman kogi bicycle rights you probably haven't heard of them stumptown iceland. Freegan chillwave food truck lomo typewriter forage raclette bicycle rights tacos fixie try-hard marfa four loko scenester gentrify.",
    "rating": 2.9,
    "rating_count": 124,
    "color": [
      "red",
      "green",
      "blue"
    ],
    "size": [
      "x-small",
      "large",
      "small",
      "x-large"
    ],
    "thumbnail_url": "light-green-t-shirt_4460x4460.jpg",
    "image_url": "light-green-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 128,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Striped T-Shirt",
    "brand": "Hipcrave",
    "price_sale": 18.99,
    "price_actual": 30.99,
    "price_savings": 12,
    "short_desc": "Irony artisan gluten-free cold-pressed vaporware tattooed, kogi edison bulb af chicharrones forage intelligentsia kombucha hot chicken try-hard. Ramps trust fund fanny pack pug poutine microdosing tattooed...",
    "long_desc": "Irony artisan gluten-free cold-pressed vaporware tattooed, kogi edison bulb af chicharrones forage intelligentsia kombucha hot chicken try-hard. Ramps trust fund fanny pack pug poutine microdosing tattooed pitchfork vape dreamcatcher drinking vinegar banh mi copper mug disrupt actually. Neutra palo santo man bun chia photo booth master cleanse ramps echo park heirloom cornhole.",
    "rating": 4,
    "rating_count": 199,
    "color": [
      "yellow",
      "red"
    ],
    "size": [
      "medium",
      "x-large",
      "small",
      "large"
    ],
    "thumbnail_url": "bright-purple-t-shirt_4460x4460.jpg",
    "image_url": "bright-purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 129,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Striped T-Shirt",
    "brand": "Bouture",
    "price_sale": 35.99,
    "price_actual": 65.99,
    "price_savings": 30,
    "short_desc": "Chambray ennui distillery vice, bespoke slow-carb helvetica. Vexillologist palo santo authentic, listicle 8-bit fanny pack food truck bushwick pok pok. Photo booth bushwick jean shorts, austin actually...",
    "long_desc": "Chambray ennui distillery vice, bespoke slow-carb helvetica. Vexillologist palo santo authentic, listicle 8-bit fanny pack food truck bushwick pok pok. Photo booth bushwick jean shorts, austin actually wolf selvage. Helvetica next level brunch four dollar toast poutine messenger bag mustache sriracha try-hard selfies copper mug scenester cold-pressed mlkshk chillwave.",
    "rating": 3.8,
    "rating_count": 149,
    "color": [
      "red",
      "blue"
    ],
    "size": [
      "large",
      "medium",
      "small"
    ],
    "thumbnail_url": "cobalt-blue-t-shirt_4460x4460.jpg",
    "image_url": "cobalt-blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 130,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Mix-print T-Shirt",
    "brand": "Hipcrave",
    "price_sale": 33.99,
    "price_actual": 44.99,
    "price_savings": 11,
    "short_desc": "Umami green juice put a bird on it bicycle rights street art lo-fi. Hoodie iPhone hashtag neutra, trust fund ethical williamsburg austin drinking vinegar crucifix. Lo-fi mixtape XOXO retro. Truffaut slow-carb...",
    "long_desc": "Umami green juice put a bird on it bicycle rights street art lo-fi. Hoodie iPhone hashtag neutra, trust fund ethical williamsburg austin drinking vinegar crucifix. Lo-fi mixtape XOXO retro. Truffaut slow-carb put a bird on it aesthetic scenester meh blue bottle squid keytar banh mi master cleanse YOLO. Fashion axe celiac kogi heirloom, tilde pinterest prism viral organic palo santo green juice venmo thundercats.",
    "rating": 3.3,
    "rating_count": 154,
    "color": [
      "green",
      "blue",
      "red"
    ],
    "size": [
      "small",
      "x-large"
    ],
    "thumbnail_url": "light-green-t-shirt_4460x4460.jpg",
    "image_url": "light-green-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 131,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Knit T-Shirt",
    "brand": "Coutique",
    "price_sale": 17.99,
    "price_actual": 25.99,
    "price_savings": 8,
    "short_desc": "Hot chicken shaman banh mi, pok pok green juice tote bag taxidermy photo booth freegan. Lumbersexual affogato vaporware adaptogen. Godard normcore kinfolk af poutine farm-to-table. Paleo succulents edison...",
    "long_desc": "Hot chicken shaman banh mi, pok pok green juice tote bag taxidermy photo booth freegan. Lumbersexual affogato vaporware adaptogen. Godard normcore kinfolk af poutine farm-to-table. Paleo succulents edison bulb, farm-to-table mumblecore umami cloud bread. Sartorial hell of +1 activated charcoal cornhole leggings put a bird on it kitsch franzen raclette man bun.",
    "rating": 3,
    "rating_count": 119,
    "color": [
      "green",
      "yellow"
    ],
    "size": [
      "small",
      "medium",
      "x-large",
      "large"
    ],
    "thumbnail_url": "red-t-shirt_4460x4460.jpg",
    "image_url": "red-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 132,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Knit T-Shirt",
    "brand": "Bouture",
    "price_sale": 48.99,
    "price_actual": 67.99,
    "price_savings": 19,
    "short_desc": "Swag cred pop-up try-hard sriracha four loko neutra farm-to-table. Vaporware 8-bit fam freegan neutra cloud bread gentrify cray la croix. Tumblr cliche letterpress banh mi YOLO, air plant pop-up tbh fingerstache...",
    "long_desc": "Swag cred pop-up try-hard sriracha four loko neutra farm-to-table. Vaporware 8-bit fam freegan neutra cloud bread gentrify cray la croix. Tumblr cliche letterpress banh mi YOLO, air plant pop-up tbh fingerstache iceland mixtape pour-over freegan. Cliche drinking vinegar pork belly locavore tumeric jianbing viral mumblecore quinoa shoreditch master cleanse photo booth keytar.",
    "rating": 4.6,
    "rating_count": 104,
    "color": [
      "red",
      "green"
    ],
    "size": [
      "x-large",
      "large"
    ],
    "thumbnail_url": "bright-purple-t-shirt_4460x4460.jpg",
    "image_url": "bright-purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 133,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Drapey T-Shirt",
    "brand": "Hipcrave",
    "price_sale": 25.99,
    "price_actual": 46.99,
    "price_savings": 21,
    "short_desc": "Fixie tilde selvage, godard +1 tote bag fam schlitz. Jean shorts neutra dreamcatcher literally biodiesel, wolf flannel whatever four loko chartreuse raw denim. Authentic activated charcoal wolf bushwick...",
    "long_desc": "Fixie tilde selvage, godard +1 tote bag fam schlitz. Jean shorts neutra dreamcatcher literally biodiesel, wolf flannel whatever four loko chartreuse raw denim. Authentic activated charcoal wolf bushwick copper mug tumblr.",
    "rating": 2.4,
    "rating_count": 33,
    "color": [
      "yellow",
      "red",
      "blue"
    ],
    "size": [
      "medium",
      "large",
      "x-small"
    ],
    "thumbnail_url": "blue-t-shirt_4460x4460.jpg",
    "image_url": "blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 134,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Sweaters and Cardigans",
    "product_name": "Pocket Cardigan",
    "brand": "Coutique",
    "price_sale": 11.99,
    "price_actual": 22.99,
    "price_savings": 11,
    "short_desc": "Fam prism man bun pork belly pok pok yuccie retro snackwave cred mustache ennui craft beer fashion axe ugh. Skateboard master cleanse salvia, messenger bag af live-edge wolf fam echo park. Af YOLO shoreditch...",
    "long_desc": "Fam prism man bun pork belly pok pok yuccie retro snackwave cred mustache ennui craft beer fashion axe ugh. Skateboard master cleanse salvia, messenger bag af live-edge wolf fam echo park. Af YOLO shoreditch gastropub wolf. Cardigan microdosing small batch pug, hoodie tumblr church-key bitters glossier stumptown. VHS viral photo booth copper mug, poutine tote bag gastropub twee food truck slow-carb helvetica raw denim.",
    "rating": 3.6,
    "rating_count": 73,
    "color": [
      "yellow",
      "green",
      "blue"
    ],
    "size": [
      "x-small",
      "small",
      "x-large"
    ],
    "thumbnail_url": "grey-t-shirt_4460x4460.jpg",
    "image_url": "grey-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 135,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Smocked T-Shirt",
    "brand": "Bouture",
    "price_sale": 13.99,
    "price_actual": 28.99,
    "price_savings": 15,
    "short_desc": "Pork belly hot chicken polaroid skateboard tousled yr. Mustache fanny pack activated charcoal, normcore taiyaki adaptogen man bun. Slow-carb trust fund post-ironic, plaid kombucha put a bird on it fanny...",
    "long_desc": "Pork belly hot chicken polaroid skateboard tousled yr. Mustache fanny pack activated charcoal, normcore taiyaki adaptogen man bun. Slow-carb trust fund post-ironic, plaid kombucha put a bird on it fanny pack poutine helvetica lumbersexual flannel fashion axe. Asymmetrical street art flexitarian art party, organic four dollar toast mixtape pork belly lo-fi you probably haven't heard of them biodiesel cardigan small batch.",
    "rating": 3,
    "rating_count": 126,
    "color": [
      "blue",
      "yellow"
    ],
    "size": [
      "large",
      "x-large",
      "x-small",
      "small"
    ],
    "thumbnail_url": "grey-t-shirt_4460x4460.jpg",
    "image_url": "grey-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 136,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Floral-print Button-up Shirt",
    "brand": "Bouture",
    "price_sale": 46.99,
    "price_actual": 73.99,
    "price_savings": 27,
    "short_desc": "Intelligentsia adaptogen kitsch, typewriter four dollar toast unicorn viral tacos crucifix pug. Quinoa man bun ramps distillery seitan, migas bitters cliche four dollar toast echo park shoreditch. Mixtape...",
    "long_desc": "Intelligentsia adaptogen kitsch, typewriter four dollar toast unicorn viral tacos crucifix pug. Quinoa man bun ramps distillery seitan, migas bitters cliche four dollar toast echo park shoreditch. Mixtape celiac church-key health goth enamel pin tilde freegan bespoke blue bottle typewriter. Pickled umami tbh cred pour-over irony art party actually ethical gochujang.",
    "rating": 4.6,
    "rating_count": 58,
    "color": [
      "blue",
      "green",
      "red"
    ],
    "size": [
      "large",
      "x-large",
      "medium",
      "x-small"
    ],
    "thumbnail_url": "red-t-shirt_4460x4460.jpg",
    "image_url": "red-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 137,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Striped Shirt",
    "brand": "Hipcrave",
    "price_sale": 45.99,
    "price_actual": 61.99,
    "price_savings": 16,
    "short_desc": "Mumblecore pok pok kombucha letterpress, distillery live-edge yuccie iceland air plant chicharrones hella lo-fi brooklyn tilde everyday carry. DIY tilde tattooed meh, fashion axe godard next level slow-carb...",
    "long_desc": "Mumblecore pok pok kombucha letterpress, distillery live-edge yuccie iceland air plant chicharrones hella lo-fi brooklyn tilde everyday carry. DIY tilde tattooed meh, fashion axe godard next level slow-carb copper mug +1. VHS pork belly poke la croix street art celiac, vaporware vice. Plaid photo booth salvia, cronut master cleanse banjo ethical tousled chia squid bicycle rights chicharrones pour-over austin mumblecore.",
    "rating": 5,
    "rating_count": 121,
    "color": [
      "green",
      "blue",
      "red"
    ],
    "size": [
      "x-large",
      "medium",
      "small"
    ],
    "thumbnail_url": "teal-t-shirt_4460x4460.jpg",
    "image_url": "teal-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 138,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "High Neck Peplum",
    "brand": "Bouture",
    "price_sale": 17.99,
    "price_actual": 26.99,
    "price_savings": 9,
    "short_desc": "Banh mi artisan godard stumptown, polaroid woke food truck 8-bit subway tile sustainable you probably haven't heard of them keffiyeh literally. Cliche williamsburg cornhole austin fanny pack. Selfies next...",
    "long_desc": "Banh mi artisan godard stumptown, polaroid woke food truck 8-bit subway tile sustainable you probably haven't heard of them keffiyeh literally. Cliche williamsburg cornhole austin fanny pack. Selfies next level drinking vinegar wayfarers intelligentsia meditation man bun. Selfies crucifix you probably haven't heard of them chicharrones squid small batch selvage. Keffiyeh lo-fi iceland scenester VHS.",
    "rating": 4.6,
    "rating_count": 106,
    "color": [
      "red",
      "yellow"
    ],
    "size": [
      "x-small",
      "x-large",
      "large",
      "small"
    ],
    "thumbnail_url": "red-t-shirt_4460x4460.jpg",
    "image_url": "red-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 139,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Smocked Wrap Top",
    "brand": "Knitage",
    "price_sale": 12.99,
    "price_actual": 20.99,
    "price_savings": 8,
    "short_desc": "Glossier ennui you probably haven't heard of them flannel coloring book salvia. Art party biodiesel lomo, jean shorts freegan skateboard jianbing prism humblebrag viral blue bottle shaman. Viral tumeric...",
    "long_desc": "Glossier ennui you probably haven't heard of them flannel coloring book salvia. Art party biodiesel lomo, jean shorts freegan skateboard jianbing prism humblebrag viral blue bottle shaman. Viral tumeric food truck messenger bag skateboard helvetica normcore man bun iceland pinterest yuccie activated charcoal kitsch migas.",
    "rating": 3.7,
    "rating_count": 151,
    "color": [
      "yellow",
      "green"
    ],
    "size": [
      "x-small",
      "x-large",
      "large",
      "medium"
    ],
    "thumbnail_url": "teal-t-shirt_4460x4460.jpg",
    "image_url": "teal-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 140,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Drapey T-Shirt",
    "brand": "Garmtech",
    "price_sale": 30.99,
    "price_actual": 54.99,
    "price_savings": 24,
    "short_desc": "Lomo venmo literally bitters jean shorts shabby chic ennui enamel pin vegan roof party VHS four dollar toast ethical. Asymmetrical bitters franzen tacos. Coloring book normcore chia unicorn, 8-bit iceland...",
    "long_desc": "Lomo venmo literally bitters jean shorts shabby chic ennui enamel pin vegan roof party VHS four dollar toast ethical. Asymmetrical bitters franzen tacos. Coloring book normcore chia unicorn, 8-bit iceland cronut brooklyn. Dreamcatcher austin banh mi XOXO bicycle rights. Health goth photo booth try-hard fanny pack, messenger bag tattooed snackwave raw denim cronut quinoa kinfolk DIY. Try-hard food truck blue bottle kogi pickled.",
    "rating": 2.2,
    "rating_count": 97,
    "color": [
      "green",
      "red",
      "blue"
    ],
    "size": [
      "x-small",
      "small",
      "large",
      "medium"
    ],
    "thumbnail_url": "light-green-t-shirt_4460x4460.jpg",
    "image_url": "light-green-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 141,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Fitted T-Shirt",
    "brand": "Bouture",
    "price_sale": 15.99,
    "price_actual": 20.99,
    "price_savings": 5,
    "short_desc": "Try-hard YOLO pinterest mlkshk pabst humblebrag. Aesthetic taxidermy af cold-pressed VHS blog umami offal neutra biodiesel tacos thundercats salvia succulents. Portland hella mixtape sartorial vinyl jianbing...",
    "long_desc": "Try-hard YOLO pinterest mlkshk pabst humblebrag. Aesthetic taxidermy af cold-pressed VHS blog umami offal neutra biodiesel tacos thundercats salvia succulents. Portland hella mixtape sartorial vinyl jianbing listicle +1. Tumeric offal intelligentsia post-ironic, cold-pressed letterpress beard shabby chic gentrify twee prism edison bulb tbh. Messenger bag coloring book kitsch hot chicken vaporware taiyaki.",
    "rating": 3.7,
    "rating_count": 70,
    "color": [
      "green",
      "yellow",
      "red"
    ],
    "size": [
      "large",
      "x-large",
      "x-small",
      "medium"
    ],
    "thumbnail_url": "purple-t-shirt_4460x4460.jpg",
    "image_url": "purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 142,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Pleated T-Shirt",
    "brand": "Knitage",
    "price_sale": 32.99,
    "price_actual": 45.99,
    "price_savings": 13,
    "short_desc": "Af williamsburg meditation activated charcoal. Vice banh mi subway tile ethical pabst, tattooed salvia hot chicken hoodie health goth hella prism artisan crucifix small batch. Skateboard succulents la...",
    "long_desc": "Af williamsburg meditation activated charcoal. Vice banh mi subway tile ethical pabst, tattooed salvia hot chicken hoodie health goth hella prism artisan crucifix small batch. Skateboard succulents la croix mumblecore plaid subway tile vaporware messenger bag green juice lumbersexual offal cloud bread four dollar toast chia seitan. Raclette ethical la croix plaid chia, green juice cray echo park iceland kitsch.",
    "rating": 2.2,
    "rating_count": 119,
    "color": [
      "yellow",
      "green",
      "blue"
    ],
    "size": [
      "medium",
      "large"
    ],
    "thumbnail_url": "cobalt-blue-t-shirt_4460x4460.jpg",
    "image_url": "cobalt-blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 143,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Mix-print T-Shirt",
    "brand": "Coutique",
    "price_sale": 47.99,
    "price_actual": 67.99,
    "price_savings": 20,
    "short_desc": "Pug cray jianbing prism hammock vice roof party narwhal forage chicharrones gluten-free. Portland everyday carry letterpress squid, offal bicycle rights cardigan neutra roof party hoodie adaptogen tacos...",
    "long_desc": "Pug cray jianbing prism hammock vice roof party narwhal forage chicharrones gluten-free. Portland everyday carry letterpress squid, offal bicycle rights cardigan neutra roof party hoodie adaptogen tacos franzen. 3 wolf moon kinfolk actually crucifix tattooed selfies. Migas ennui poke, live-edge hot chicken franzen cray pinterest man braid stumptown adaptogen tumblr letterpress.",
    "rating": 4.1,
    "rating_count": 52,
    "color": [
      "green",
      "blue",
      "red"
    ],
    "size": [
      "x-large",
      "x-small"
    ],
    "thumbnail_url": "blue-t-shirt_4460x4460.jpg",
    "image_url": "blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 144,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Sweaters and Cardigans",
    "product_name": "Slim Sweatshirt",
    "brand": "Garmtech",
    "price_sale": 23.99,
    "price_actual": 35.99,
    "price_savings": 12,
    "short_desc": "Pickled put a bird on it man braid, intelligentsia retro art party quinoa shoreditch readymade. Hoodie yuccie selfies, microdosing pickled neutra deep v kitsch sriracha letterpress cold-pressed offal next...",
    "long_desc": "Pickled put a bird on it man braid, intelligentsia retro art party quinoa shoreditch readymade. Hoodie yuccie selfies, microdosing pickled neutra deep v kitsch sriracha letterpress cold-pressed offal next level +1. Shabby chic raclette affogato pork belly meditation whatever. Meh intelligentsia church-key, kinfolk ramps hell of direct trade seitan mixtape pinterest XOXO marfa.",
    "rating": 2.8,
    "rating_count": 158,
    "color": [
      "yellow",
      "green"
    ],
    "size": [
      "medium",
      "small",
      "x-small"
    ],
    "thumbnail_url": "bright-purple-t-shirt_4460x4460.jpg",
    "image_url": "bright-purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 145,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Sweaters and Cardigans",
    "product_name": "Button-up Sweater",
    "brand": "Bouture",
    "price_sale": 59.99,
    "price_actual": 87.99,
    "price_savings": 28,
    "short_desc": "Messenger bag lyft franzen, synth raw denim viral unicorn knausgaard irony hell of leggings selvage yr. Microdosing woke single-origin coffee skateboard hella slow-carb. Vegan tousled irony occupy asymmetrical...",
    "long_desc": "Messenger bag lyft franzen, synth raw denim viral unicorn knausgaard irony hell of leggings selvage yr. Microdosing woke single-origin coffee skateboard hella slow-carb. Vegan tousled irony occupy asymmetrical retro you probably haven't heard of them try-hard typewriter selfies air plant. Roof party four loko schlitz DIY chia.",
    "rating": 2.2,
    "rating_count": 102,
    "color": [
      "yellow",
      "red"
    ],
    "size": [
      "x-large",
      "x-small",
      "large",
      "medium"
    ],
    "thumbnail_url": "blue-t-shirt_4460x4460.jpg",
    "image_url": "blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 146,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Drapey T-Shirt",
    "brand": "Frockzy",
    "price_sale": 24.99,
    "price_actual": 35.99,
    "price_savings": 11,
    "short_desc": "90's lyft butcher scenester williamsburg cornhole. La croix yr small batch, brooklyn schlitz hammock before they sold out jean shorts leggings portland vinyl synth shaman blue bottle bushwick. Schlitz...",
    "long_desc": "90's lyft butcher scenester williamsburg cornhole. La croix yr small batch, brooklyn schlitz hammock before they sold out jean shorts leggings portland vinyl synth shaman blue bottle bushwick. Schlitz church-key artisan fanny pack palo santo. Pork belly selfies ennui tacos, woke raw denim fam hell of polaroid 8-bit kogi butcher lyft readymade.",
    "rating": 3.3,
    "rating_count": 137,
    "color": [
      "red",
      "blue"
    ],
    "size": [
      "small",
      "large",
      "x-small",
      "medium"
    ],
    "thumbnail_url": "blue-t-shirt_4460x4460.jpg",
    "image_url": "blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 147,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Linen Shirt",
    "brand": "Knitage",
    "price_sale": 40.99,
    "price_actual": 58.99,
    "price_savings": 18,
    "short_desc": "Man braid affogato pour-over sartorial leggings tumblr irony aesthetic authentic umami chartreuse gochujang. Sustainable gastropub fingerstache, blog literally activated charcoal small batch skateboard...",
    "long_desc": "Man braid affogato pour-over sartorial leggings tumblr irony aesthetic authentic umami chartreuse gochujang. Sustainable gastropub fingerstache, blog literally activated charcoal small batch skateboard thundercats. Bitters food truck pok pok pinterest umami kogi succulents kitsch, air plant iceland. Tumblr irony hoodie hell of vegan. Four dollar toast yuccie YOLO mumblecore.",
    "rating": 4.2,
    "rating_count": 141,
    "color": [
      "red",
      "yellow",
      "green"
    ],
    "size": [
      "small",
      "large"
    ],
    "thumbnail_url": "grey-t-shirt_4460x4460.jpg",
    "image_url": "grey-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 148,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Sweaters and Cardigans",
    "product_name": "Button-up Cardigan",
    "brand": "Bouture",
    "price_sale": 14.99,
    "price_actual": 21.99,
    "price_savings": 7,
    "short_desc": "Artisan woke tattooed health goth 3 wolf moon fingerstache umami lumbersexual stumptown godard deep v air plant. Truffaut slow-carb put a bird on it aesthetic scenester meh blue bottle squid keytar banh...",
    "long_desc": "Artisan woke tattooed health goth 3 wolf moon fingerstache umami lumbersexual stumptown godard deep v air plant. Truffaut slow-carb put a bird on it aesthetic scenester meh blue bottle squid keytar banh mi master cleanse YOLO. Fashion axe celiac kogi heirloom, tilde pinterest prism viral organic palo santo green juice venmo thundercats.",
    "rating": 4.7,
    "rating_count": 184,
    "color": [
      "green",
      "yellow"
    ],
    "size": [
      "medium",
      "x-small",
      "large"
    ],
    "thumbnail_url": "bright-purple-t-shirt_4460x4460.jpg",
    "image_url": "bright-purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 149,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Lace Trim Peasant Top",
    "brand": "Garmtech",
    "price_sale": 14.99,
    "price_actual": 26.99,
    "price_savings": 12,
    "short_desc": "Gluten-free hella unicorn glossier taiyaki bespoke skateboard bushwick godard organic ugh single-origin coffee artisan VHS chia. Vaporware crucifix farm-to-table you probably haven't heard of them. Truffaut...",
    "long_desc": "Gluten-free hella unicorn glossier taiyaki bespoke skateboard bushwick godard organic ugh single-origin coffee artisan VHS chia. Vaporware crucifix farm-to-table you probably haven't heard of them. Truffaut irony cloud bread try-hard.",
    "rating": 3.7,
    "rating_count": 111,
    "color": [
      "blue",
      "red",
      "yellow"
    ],
    "size": [
      "x-large",
      "medium",
      "large"
    ],
    "thumbnail_url": "purple-t-shirt_4460x4460.jpg",
    "image_url": "purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 150,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Sweaters and Cardigans",
    "product_name": "Wool Sweatshirt",
    "brand": "Bouture",
    "price_sale": 66.99,
    "price_actual": 88.99,
    "price_savings": 22,
    "short_desc": "Artisan viral umami ennui, yuccie hella prism copper mug. Pug food truck bicycle rights unicorn, lyft glossier raw denim raclette man bun blog hell of. Fashion axe offal hexagon shaman DIY, ramps live-edge...",
    "long_desc": "Artisan viral umami ennui, yuccie hella prism copper mug. Pug food truck bicycle rights unicorn, lyft glossier raw denim raclette man bun blog hell of. Fashion axe offal hexagon shaman DIY, ramps live-edge small batch mumblecore 90's gastropub. +1 biodiesel etsy cold-pressed, DIY distillery tattooed semiotics cloud bread organic kogi kale chips subway tile PBR&B messenger bag. Mumblecore forage tote bag echo park iceland williamsburg asymmetrical.",
    "rating": 2.3,
    "rating_count": 111,
    "color": [
      "blue",
      "yellow",
      "green"
    ],
    "size": [
      "large",
      "small",
      "x-small"
    ],
    "thumbnail_url": "purple-t-shirt_4460x4460.jpg",
    "image_url": "purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 151,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Striped Blouse",
    "brand": "Bouture",
    "price_sale": 16.99,
    "price_actual": 30.99,
    "price_savings": 14,
    "short_desc": "Lomo celiac hexagon hashtag thundercats brunch fingerstache forage PBR&B live-edge. Migas four loko mumblecore tacos, synth forage asymmetrical kogi 3 wolf moon. Polaroid tattooed man braid subway tile,...",
    "long_desc": "Lomo celiac hexagon hashtag thundercats brunch fingerstache forage PBR&B live-edge. Migas four loko mumblecore tacos, synth forage asymmetrical kogi 3 wolf moon. Polaroid tattooed man braid subway tile, williamsburg four dollar toast fanny pack gochujang. Dreamcatcher cray four dollar toast chicharrones iceland. Pok pok blog XOXO banh mi mixtape hot chicken plaid gochujang.",
    "rating": 4.1,
    "rating_count": 130,
    "color": [
      "blue",
      "green",
      "red"
    ],
    "size": [
      "x-large",
      "large"
    ],
    "thumbnail_url": "teal-t-shirt_4460x4460.jpg",
    "image_url": "teal-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 152,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "V-Neck T-Shirt",
    "brand": "Hipcrave",
    "price_sale": 36.99,
    "price_actual": 51.99,
    "price_savings": 15,
    "short_desc": "Jianbing readymade church-key helvetica. Venmo palo santo blue bottle artisan, selfies bespoke sartorial mixtape tumeric. Vinyl cred heirloom, fanny pack chambray locavore bushwick four loko meggings pop-up....",
    "long_desc": "Jianbing readymade church-key helvetica. Venmo palo santo blue bottle artisan, selfies bespoke sartorial mixtape tumeric. Vinyl cred heirloom, fanny pack chambray locavore bushwick four loko meggings pop-up. Wayfarers chia before they sold out, adaptogen gentrify etsy waistcoat subway tile viral hashtag. Tattooed taxidermy narwhal raclette, jean shorts prism messenger bag blog waistcoat wayfarers air plant pickled fixie lomo.",
    "rating": 2.2,
    "rating_count": 88,
    "color": [
      "red",
      "blue",
      "green"
    ],
    "size": [
      "x-small",
      "x-large",
      "small",
      "medium"
    ],
    "thumbnail_url": "red-t-shirt_4460x4460.jpg",
    "image_url": "red-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 153,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Knit Wrap Top",
    "brand": "Wovest",
    "price_sale": 18.99,
    "price_actual": 28.99,
    "price_savings": 10,
    "short_desc": "Fashion axe tumeric raclette actually vape letterpress tbh hell of health goth. Ethical la croix iPhone sustainable four dollar toast cronut freegan selfies poutine quinoa glossier pabst food truck austin...",
    "long_desc": "Fashion axe tumeric raclette actually vape letterpress tbh hell of health goth. Ethical la croix iPhone sustainable four dollar toast cronut freegan selfies poutine quinoa glossier pabst food truck austin dreamcatcher.",
    "rating": 4.6,
    "rating_count": 27,
    "color": [
      "yellow",
      "blue",
      "red"
    ],
    "size": [
      "small",
      "large"
    ],
    "thumbnail_url": "grey-t-shirt_4460x4460.jpg",
    "image_url": "grey-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 154,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "V-Neck Peplum",
    "brand": "Wovest",
    "price_sale": 44.99,
    "price_actual": 58.99,
    "price_savings": 14,
    "short_desc": "Truffaut man braid heirloom af bespoke asymmetrical. Trust fund umami gastropub unicorn drinking vinegar. Truffaut poke beard, whatever drinking vinegar fam hell of man bun schlitz bicycle rights coloring...",
    "long_desc": "Truffaut man braid heirloom af bespoke asymmetrical. Trust fund umami gastropub unicorn drinking vinegar. Truffaut poke beard, whatever drinking vinegar fam hell of man bun schlitz bicycle rights coloring book hashtag chartreuse. Aesthetic truffaut kitsch, poutine chillwave meh semiotics squid.",
    "rating": 2.3,
    "rating_count": 80,
    "color": [
      "green",
      "yellow"
    ],
    "size": [
      "large",
      "small",
      "x-large"
    ],
    "thumbnail_url": "green-t-shirt_4460x4460.jpg",
    "image_url": "green-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 155,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "V-Neck T-Shirt",
    "brand": "Wovest",
    "price_sale": 43.99,
    "price_actual": 70.99,
    "price_savings": 27,
    "short_desc": "Narwhal echo park fashion axe try-hard prism chambray woke gastropub hexagon. Jean shorts adaptogen shabby chic waistcoat locavore single-origin coffee freegan try-hard cardigan mlkshk aesthetic unicorn....",
    "long_desc": "Narwhal echo park fashion axe try-hard prism chambray woke gastropub hexagon. Jean shorts adaptogen shabby chic waistcoat locavore single-origin coffee freegan try-hard cardigan mlkshk aesthetic unicorn. Glossier fanny pack portland austin retro squid cliche shaman schlitz kale chips listicle seitan vegan everyday carry XOXO. Bicycle rights bushwick scenester twee roof party shoreditch chillwave thundercats distillery dreamcatcher tacos mlkshk austin.",
    "rating": 3.6,
    "rating_count": 46,
    "color": [
      "yellow",
      "red"
    ],
    "size": [
      "medium",
      "x-small"
    ],
    "thumbnail_url": "bright-purple-t-shirt_4460x4460.jpg",
    "image_url": "bright-purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 156,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "High Neck Top",
    "brand": "Wovest",
    "price_sale": 42.99,
    "price_actual": 63.99,
    "price_savings": 21,
    "short_desc": "Mustache marfa narwhal portland pitchfork fixie tote bag authentic asymmetrical prism. Wayfarers neutra retro pour-over distillery cardigan tote bag pork belly ethical church-key unicorn +1 tofu af health...",
    "long_desc": "Mustache marfa narwhal portland pitchfork fixie tote bag authentic asymmetrical prism. Wayfarers neutra retro pour-over distillery cardigan tote bag pork belly ethical church-key unicorn +1 tofu af health goth. Pork belly 3 wolf moon hammock, tote bag sriracha food truck VHS jianbing godard cornhole chia gochujang yuccie taiyaki.",
    "rating": 4.3,
    "rating_count": 92,
    "color": [
      "blue",
      "red",
      "yellow"
    ],
    "size": [
      "x-large",
      "x-small",
      "large"
    ],
    "thumbnail_url": "purple-t-shirt_4460x4460.jpg",
    "image_url": "purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 157,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Sweaters and Cardigans",
    "product_name": "Merino Sweater",
    "brand": "Wovest",
    "price_sale": 51.99,
    "price_actual": 88.99,
    "price_savings": 37,
    "short_desc": "Dreamcatcher leggings fixie fashion axe bicycle rights hoodie. Affogato helvetica pok pok, letterpress crucifix meggings drinking vinegar leggings. Quinoa pinterest green juice sustainable next level,...",
    "long_desc": "Dreamcatcher leggings fixie fashion axe bicycle rights hoodie. Affogato helvetica pok pok, letterpress crucifix meggings drinking vinegar leggings. Quinoa pinterest green juice sustainable next level, forage hell of semiotics crucifix taiyaki typewriter lo-fi gentrify shaman mumblecore. Cornhole marfa wolf bespoke asymmetrical beard ramps yuccie hella roof party air plant.",
    "rating": 3.3,
    "rating_count": 72,
    "color": [
      "red",
      "green",
      "yellow"
    ],
    "size": [
      "large",
      "x-large"
    ],
    "thumbnail_url": "green-t-shirt_4460x4460.jpg",
    "image_url": "green-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 158,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Short Sleeved T-Shirt",
    "brand": "Knitage",
    "price_sale": 52.99,
    "price_actual": 66.99,
    "price_savings": 14,
    "short_desc": "Succulents aesthetic wayfarers, celiac synth vaporware quinoa disrupt unicorn iPhone. Occupy leggings literally, keytar kogi actually mustache. Flexitarian cardigan adaptogen listicle air plant taiyaki....",
    "long_desc": "Succulents aesthetic wayfarers, celiac synth vaporware quinoa disrupt unicorn iPhone. Occupy leggings literally, keytar kogi actually mustache. Flexitarian cardigan adaptogen listicle air plant taiyaki. Intelligentsia unicorn thundercats farm-to-table, organic church-key jianbing fashion axe fixie readymade typewriter.",
    "rating": 2.2,
    "rating_count": 137,
    "color": [
      "blue",
      "yellow",
      "green"
    ],
    "size": [
      "x-large",
      "medium"
    ],
    "thumbnail_url": "cobalt-blue-t-shirt_4460x4460.jpg",
    "image_url": "cobalt-blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 159,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Preppy T-Shirt",
    "brand": "Hipcrave",
    "price_sale": 15.99,
    "price_actual": 27.99,
    "price_savings": 12,
    "short_desc": "Biodiesel shabby chic cliche vaporware. Snackwave four loko cardigan gastropub, fixie crucifix adaptogen poke fam seitan yr. Letterpress gluten-free portland tumblr roof party freegan ramps. Fanny pack...",
    "long_desc": "Biodiesel shabby chic cliche vaporware. Snackwave four loko cardigan gastropub, fixie crucifix adaptogen poke fam seitan yr. Letterpress gluten-free portland tumblr roof party freegan ramps. Fanny pack poutine taxidermy raclette vexillologist, offal schlitz mixtape.",
    "rating": 4.7,
    "rating_count": 37,
    "color": [
      "blue",
      "yellow",
      "green"
    ],
    "size": [
      "medium",
      "x-large"
    ],
    "thumbnail_url": "teal-t-shirt_4460x4460.jpg",
    "image_url": "teal-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 160,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Sleeveless T-Shirt",
    "brand": "Wovest",
    "price_sale": 16.99,
    "price_actual": 21.99,
    "price_savings": 5,
    "short_desc": "Drinking vinegar slow-carb put a bird on it actually hammock. Schlitz marfa tumeric austin meh small batch cliche jean shorts. Activated charcoal bitters disrupt banjo tote bag raw denim gochujang organic...",
    "long_desc": "Drinking vinegar slow-carb put a bird on it actually hammock. Schlitz marfa tumeric austin meh small batch cliche jean shorts. Activated charcoal bitters disrupt banjo tote bag raw denim gochujang organic migas slow-carb ethical. Kinfolk organic gochujang lumbersexual. Chia affogato flexitarian fanny pack shabby chic copper mug. Keytar single-origin coffee normcore health goth.",
    "rating": 2.1,
    "rating_count": 30,
    "color": [
      "blue",
      "green"
    ],
    "size": [
      "x-small",
      "large",
      "x-large",
      "small"
    ],
    "thumbnail_url": "blue-t-shirt_4460x4460.jpg",
    "image_url": "blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 161,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Sweaters and Cardigans",
    "product_name": "Button-up Cardigan",
    "brand": "Hipcrave",
    "price_sale": 40.99,
    "price_actual": 56.99,
    "price_savings": 16,
    "short_desc": "Cardigan fingerstache vice, distillery vaporware photo booth keffiyeh. Godard vice pok pok quinoa. Four dollar toast cloud bread pork belly, offal fashion axe shaman kogi bicycle rights you probably haven't...",
    "long_desc": "Cardigan fingerstache vice, distillery vaporware photo booth keffiyeh. Godard vice pok pok quinoa. Four dollar toast cloud bread pork belly, offal fashion axe shaman kogi bicycle rights you probably haven't heard of them stumptown iceland. Freegan chillwave food truck lomo typewriter forage raclette bicycle rights tacos fixie try-hard marfa four loko scenester gentrify.",
    "rating": 4.3,
    "rating_count": 146,
    "color": [
      "blue",
      "yellow",
      "red"
    ],
    "size": [
      "large",
      "x-large"
    ],
    "thumbnail_url": "teal-t-shirt_4460x4460.jpg",
    "image_url": "teal-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 162,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Pleated T-Shirt",
    "brand": "Knitage",
    "price_sale": 37.99,
    "price_actual": 49.99,
    "price_savings": 12,
    "short_desc": "Irony artisan gluten-free cold-pressed vaporware tattooed, kogi edison bulb af chicharrones forage intelligentsia kombucha hot chicken try-hard. Ramps trust fund fanny pack pug poutine microdosing tattooed...",
    "long_desc": "Irony artisan gluten-free cold-pressed vaporware tattooed, kogi edison bulb af chicharrones forage intelligentsia kombucha hot chicken try-hard. Ramps trust fund fanny pack pug poutine microdosing tattooed pitchfork vape dreamcatcher drinking vinegar banh mi copper mug disrupt actually. Neutra palo santo man bun chia photo booth master cleanse ramps echo park heirloom cornhole.",
    "rating": 2.2,
    "rating_count": 142,
    "color": [
      "blue",
      "red"
    ],
    "size": [
      "medium",
      "x-large",
      "x-small"
    ],
    "thumbnail_url": "cobalt-blue-t-shirt_4460x4460.jpg",
    "image_url": "cobalt-blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 163,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Sweaters and Cardigans",
    "product_name": "Drapey Cardigan",
    "brand": "Frockzy",
    "price_sale": 40.99,
    "price_actual": 82.99,
    "price_savings": 42,
    "short_desc": "Chambray ennui distillery vice, bespoke slow-carb helvetica. Vexillologist palo santo authentic, listicle 8-bit fanny pack food truck bushwick pok pok. Photo booth bushwick jean shorts, austin actually...",
    "long_desc": "Chambray ennui distillery vice, bespoke slow-carb helvetica. Vexillologist palo santo authentic, listicle 8-bit fanny pack food truck bushwick pok pok. Photo booth bushwick jean shorts, austin actually wolf selvage. Helvetica next level brunch four dollar toast poutine messenger bag mustache sriracha try-hard selfies copper mug scenester cold-pressed mlkshk chillwave.",
    "rating": 2.2,
    "rating_count": 67,
    "color": [
      "blue",
      "green"
    ],
    "size": [
      "x-large",
      "small"
    ],
    "thumbnail_url": "light-green-t-shirt_4460x4460.jpg",
    "image_url": "light-green-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 164,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Sweaters and Cardigans",
    "product_name": "Pocket Sweatshirt",
    "brand": "Coutique",
    "price_sale": 30.99,
    "price_actual": 59.99,
    "price_savings": 29,
    "short_desc": "Umami green juice put a bird on it bicycle rights street art lo-fi. Hoodie iPhone hashtag neutra, trust fund ethical williamsburg austin drinking vinegar crucifix. Lo-fi mixtape XOXO retro. Truffaut slow-carb...",
    "long_desc": "Umami green juice put a bird on it bicycle rights street art lo-fi. Hoodie iPhone hashtag neutra, trust fund ethical williamsburg austin drinking vinegar crucifix. Lo-fi mixtape XOXO retro. Truffaut slow-carb put a bird on it aesthetic scenester meh blue bottle squid keytar banh mi master cleanse YOLO. Fashion axe celiac kogi heirloom, tilde pinterest prism viral organic palo santo green juice venmo thundercats.",
    "rating": 2.3,
    "rating_count": 32,
    "color": [
      "yellow",
      "blue"
    ],
    "size": [
      "small",
      "x-small"
    ],
    "thumbnail_url": "grey-t-shirt_4460x4460.jpg",
    "image_url": "grey-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 165,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Pleated T-Shirt",
    "brand": "Knitage",
    "price_sale": 52.99,
    "price_actual": 88.99,
    "price_savings": 36,
    "short_desc": "Hot chicken shaman banh mi, pok pok green juice tote bag taxidermy photo booth freegan. Lumbersexual affogato vaporware adaptogen. Godard normcore kinfolk af poutine farm-to-table. Paleo succulents edison...",
    "long_desc": "Hot chicken shaman banh mi, pok pok green juice tote bag taxidermy photo booth freegan. Lumbersexual affogato vaporware adaptogen. Godard normcore kinfolk af poutine farm-to-table. Paleo succulents edison bulb, farm-to-table mumblecore umami cloud bread. Sartorial hell of +1 activated charcoal cornhole leggings put a bird on it kitsch franzen raclette man bun.",
    "rating": 2.6,
    "rating_count": 95,
    "color": [
      "yellow",
      "blue"
    ],
    "size": [
      "large",
      "x-small",
      "x-large",
      "medium"
    ],
    "thumbnail_url": "purple-t-shirt_4460x4460.jpg",
    "image_url": "purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 166,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Lace Trim T-Shirt",
    "brand": "Frockzy",
    "price_sale": 13.99,
    "price_actual": 24.99,
    "price_savings": 11,
    "short_desc": "Swag cred pop-up try-hard sriracha four loko neutra farm-to-table. Vaporware 8-bit fam freegan neutra cloud bread gentrify cray la croix. Tumblr cliche letterpress banh mi YOLO, air plant pop-up tbh fingerstache...",
    "long_desc": "Swag cred pop-up try-hard sriracha four loko neutra farm-to-table. Vaporware 8-bit fam freegan neutra cloud bread gentrify cray la croix. Tumblr cliche letterpress banh mi YOLO, air plant pop-up tbh fingerstache iceland mixtape pour-over freegan. Cliche drinking vinegar pork belly locavore tumeric jianbing viral mumblecore quinoa shoreditch master cleanse photo booth keytar.",
    "rating": 2.4,
    "rating_count": 194,
    "color": [
      "green",
      "red",
      "yellow"
    ],
    "size": [
      "large",
      "x-small"
    ],
    "thumbnail_url": "blue-t-shirt_4460x4460.jpg",
    "image_url": "blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 167,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Fitted T-Shirt",
    "brand": "Wovest",
    "price_sale": 53.99,
    "price_actual": 70.99,
    "price_savings": 17,
    "short_desc": "Fixie tilde selvage, godard +1 tote bag fam schlitz. Jean shorts neutra dreamcatcher literally biodiesel, wolf flannel whatever four loko chartreuse raw denim. Authentic activated charcoal wolf bushwick...",
    "long_desc": "Fixie tilde selvage, godard +1 tote bag fam schlitz. Jean shorts neutra dreamcatcher literally biodiesel, wolf flannel whatever four loko chartreuse raw denim. Authentic activated charcoal wolf bushwick copper mug tumblr.",
    "rating": 4.6,
    "rating_count": 26,
    "color": [
      "red",
      "blue",
      "green"
    ],
    "size": [
      "x-small",
      "large",
      "small",
      "medium"
    ],
    "thumbnail_url": "teal-t-shirt_4460x4460.jpg",
    "image_url": "teal-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 168,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Pleated T-Shirt",
    "brand": "Wovest",
    "price_sale": 22.99,
    "price_actual": 28.99,
    "price_savings": 6,
    "short_desc": "Fam prism man bun pork belly pok pok yuccie retro snackwave cred mustache ennui craft beer fashion axe ugh. Skateboard master cleanse salvia, messenger bag af live-edge wolf fam echo park. Af YOLO shoreditch...",
    "long_desc": "Fam prism man bun pork belly pok pok yuccie retro snackwave cred mustache ennui craft beer fashion axe ugh. Skateboard master cleanse salvia, messenger bag af live-edge wolf fam echo park. Af YOLO shoreditch gastropub wolf. Cardigan microdosing small batch pug, hoodie tumblr church-key bitters glossier stumptown. VHS viral photo booth copper mug, poutine tote bag gastropub twee food truck slow-carb helvetica raw denim.",
    "rating": 4.4,
    "rating_count": 139,
    "color": [
      "red",
      "blue"
    ],
    "size": [
      "x-large",
      "small",
      "x-small"
    ],
    "thumbnail_url": "cobalt-blue-t-shirt_4460x4460.jpg",
    "image_url": "cobalt-blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 169,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Sweaters and Cardigans",
    "product_name": "Pocket Sweatshirt",
    "brand": "Bouture",
    "price_sale": 45.99,
    "price_actual": 83.99,
    "price_savings": 38,
    "short_desc": "Pork belly hot chicken polaroid skateboard tousled yr. Mustache fanny pack activated charcoal, normcore taiyaki adaptogen man bun. Slow-carb trust fund post-ironic, plaid kombucha put a bird on it fanny...",
    "long_desc": "Pork belly hot chicken polaroid skateboard tousled yr. Mustache fanny pack activated charcoal, normcore taiyaki adaptogen man bun. Slow-carb trust fund post-ironic, plaid kombucha put a bird on it fanny pack poutine helvetica lumbersexual flannel fashion axe. Asymmetrical street art flexitarian art party, organic four dollar toast mixtape pork belly lo-fi you probably haven't heard of them biodiesel cardigan small batch.",
    "rating": 4.5,
    "rating_count": 96,
    "color": [
      "green",
      "red",
      "blue"
    ],
    "size": [
      "small",
      "large"
    ],
    "thumbnail_url": "blue-t-shirt_4460x4460.jpg",
    "image_url": "blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 170,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Sleeveless T-Shirt",
    "brand": "Garmtech",
    "price_sale": 23.99,
    "price_actual": 47.99,
    "price_savings": 24,
    "short_desc": "Intelligentsia adaptogen kitsch, typewriter four dollar toast unicorn viral tacos crucifix pug. Quinoa man bun ramps distillery seitan, migas bitters cliche four dollar toast echo park shoreditch. Mixtape...",
    "long_desc": "Intelligentsia adaptogen kitsch, typewriter four dollar toast unicorn viral tacos crucifix pug. Quinoa man bun ramps distillery seitan, migas bitters cliche four dollar toast echo park shoreditch. Mixtape celiac church-key health goth enamel pin tilde freegan bespoke blue bottle typewriter. Pickled umami tbh cred pour-over irony art party actually ethical gochujang.",
    "rating": 2.3,
    "rating_count": 148,
    "color": [
      "green",
      "red"
    ],
    "size": [
      "medium",
      "large",
      "x-large",
      "x-small"
    ],
    "thumbnail_url": "bright-purple-t-shirt_4460x4460.jpg",
    "image_url": "bright-purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 171,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Mix-print T-Shirt",
    "brand": "Frockzy",
    "price_sale": 42.99,
    "price_actual": 67.99,
    "price_savings": 25,
    "short_desc": "Mumblecore pok pok kombucha letterpress, distillery live-edge yuccie iceland air plant chicharrones hella lo-fi brooklyn tilde everyday carry. DIY tilde tattooed meh, fashion axe godard next level slow-carb...",
    "long_desc": "Mumblecore pok pok kombucha letterpress, distillery live-edge yuccie iceland air plant chicharrones hella lo-fi brooklyn tilde everyday carry. DIY tilde tattooed meh, fashion axe godard next level slow-carb copper mug +1. VHS pork belly poke la croix street art celiac, vaporware vice. Plaid photo booth salvia, cronut master cleanse banjo ethical tousled chia squid bicycle rights chicharrones pour-over austin mumblecore.",
    "rating": 3.5,
    "rating_count": 117,
    "color": [
      "yellow",
      "blue"
    ],
    "size": [
      "large",
      "small",
      "medium",
      "x-large"
    ],
    "thumbnail_url": "purple-t-shirt_4460x4460.jpg",
    "image_url": "purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 172,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Sweaters and Cardigans",
    "product_name": "Merino Sweatshirt",
    "brand": "Knitage",
    "price_sale": 53.99,
    "price_actual": 77.99,
    "price_savings": 24,
    "short_desc": "Banh mi artisan godard stumptown, polaroid woke food truck 8-bit subway tile sustainable you probably haven't heard of them keffiyeh literally. Cliche williamsburg cornhole austin fanny pack. Selfies next...",
    "long_desc": "Banh mi artisan godard stumptown, polaroid woke food truck 8-bit subway tile sustainable you probably haven't heard of them keffiyeh literally. Cliche williamsburg cornhole austin fanny pack. Selfies next level drinking vinegar wayfarers intelligentsia meditation man bun. Selfies crucifix you probably haven't heard of them chicharrones squid small batch selvage. Keffiyeh lo-fi iceland scenester VHS.",
    "rating": 3.3,
    "rating_count": 180,
    "color": [
      "yellow",
      "red",
      "blue"
    ],
    "size": [
      "x-small",
      "small"
    ],
    "thumbnail_url": "blue-t-shirt_4460x4460.jpg",
    "image_url": "blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 173,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Sweaters and Cardigans",
    "product_name": "Wool Sweater",
    "brand": "Hipcrave",
    "price_sale": 21.99,
    "price_actual": 42.99,
    "price_savings": 21,
    "short_desc": "Glossier ennui you probably haven't heard of them flannel coloring book salvia. Art party biodiesel lomo, jean shorts freegan skateboard jianbing prism humblebrag viral blue bottle shaman. Viral tumeric...",
    "long_desc": "Glossier ennui you probably haven't heard of them flannel coloring book salvia. Art party biodiesel lomo, jean shorts freegan skateboard jianbing prism humblebrag viral blue bottle shaman. Viral tumeric food truck messenger bag skateboard helvetica normcore man bun iceland pinterest yuccie activated charcoal kitsch migas.",
    "rating": 2.3,
    "rating_count": 151,
    "color": [
      "yellow",
      "blue"
    ],
    "size": [
      "large",
      "x-large",
      "small",
      "medium"
    ],
    "thumbnail_url": "teal-t-shirt_4460x4460.jpg",
    "image_url": "teal-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 174,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Sweaters and Cardigans",
    "product_name": "Merino Sweatshirt",
    "brand": "Hipcrave",
    "price_sale": 53.99,
    "price_actual": 67.99,
    "price_savings": 14,
    "short_desc": "Lomo venmo literally bitters jean shorts shabby chic ennui enamel pin vegan roof party VHS four dollar toast ethical. Asymmetrical bitters franzen tacos. Coloring book normcore chia unicorn, 8-bit iceland...",
    "long_desc": "Lomo venmo literally bitters jean shorts shabby chic ennui enamel pin vegan roof party VHS four dollar toast ethical. Asymmetrical bitters franzen tacos. Coloring book normcore chia unicorn, 8-bit iceland cronut brooklyn. Dreamcatcher austin banh mi XOXO bicycle rights. Health goth photo booth try-hard fanny pack, messenger bag tattooed snackwave raw denim cronut quinoa kinfolk DIY. Try-hard food truck blue bottle kogi pickled.",
    "rating": 4.5,
    "rating_count": 152,
    "color": [
      "yellow",
      "red",
      "blue"
    ],
    "size": [
      "small",
      "x-small",
      "x-large",
      "large"
    ],
    "thumbnail_url": "grey-t-shirt_4460x4460.jpg",
    "image_url": "grey-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 175,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Short Sleeved T-Shirt",
    "brand": "Wovest",
    "price_sale": 58.99,
    "price_actual": 88.99,
    "price_savings": 30,
    "short_desc": "Try-hard YOLO pinterest mlkshk pabst humblebrag. Aesthetic taxidermy af cold-pressed VHS blog umami offal neutra biodiesel tacos thundercats salvia succulents. Portland hella mixtape sartorial vinyl jianbing...",
    "long_desc": "Try-hard YOLO pinterest mlkshk pabst humblebrag. Aesthetic taxidermy af cold-pressed VHS blog umami offal neutra biodiesel tacos thundercats salvia succulents. Portland hella mixtape sartorial vinyl jianbing listicle +1. Tumeric offal intelligentsia post-ironic, cold-pressed letterpress beard shabby chic gentrify twee prism edison bulb tbh. Messenger bag coloring book kitsch hot chicken vaporware taiyaki.",
    "rating": 3.4,
    "rating_count": 187,
    "color": [
      "red",
      "yellow",
      "blue"
    ],
    "size": [
      "medium",
      "large",
      "small"
    ],
    "thumbnail_url": "green-t-shirt_4460x4460.jpg",
    "image_url": "green-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 176,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Sweaters and Cardigans",
    "product_name": "Pocket Sweatshirt",
    "brand": "Coutique",
    "price_sale": 14.99,
    "price_actual": 23.99,
    "price_savings": 9,
    "short_desc": "Af williamsburg meditation activated charcoal. Vice banh mi subway tile ethical pabst, tattooed salvia hot chicken hoodie health goth hella prism artisan crucifix small batch. Skateboard succulents la...",
    "long_desc": "Af williamsburg meditation activated charcoal. Vice banh mi subway tile ethical pabst, tattooed salvia hot chicken hoodie health goth hella prism artisan crucifix small batch. Skateboard succulents la croix mumblecore plaid subway tile vaporware messenger bag green juice lumbersexual offal cloud bread four dollar toast chia seitan. Raclette ethical la croix plaid chia, green juice cray echo park iceland kitsch.",
    "rating": 4.8,
    "rating_count": 145,
    "color": [
      "red",
      "yellow",
      "blue"
    ],
    "size": [
      "medium",
      "large"
    ],
    "thumbnail_url": "light-green-t-shirt_4460x4460.jpg",
    "image_url": "light-green-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 177,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "High Neck T-Shirt",
    "brand": "Hipcrave",
    "price_sale": 42.99,
    "price_actual": 75.99,
    "price_savings": 33,
    "short_desc": "Pug cray jianbing prism hammock vice roof party narwhal forage chicharrones gluten-free. Portland everyday carry letterpress squid, offal bicycle rights cardigan neutra roof party hoodie adaptogen tacos...",
    "long_desc": "Pug cray jianbing prism hammock vice roof party narwhal forage chicharrones gluten-free. Portland everyday carry letterpress squid, offal bicycle rights cardigan neutra roof party hoodie adaptogen tacos franzen. 3 wolf moon kinfolk actually crucifix tattooed selfies. Migas ennui poke, live-edge hot chicken franzen cray pinterest man braid stumptown adaptogen tumblr letterpress.",
    "rating": 4.6,
    "rating_count": 22,
    "color": [
      "red",
      "blue",
      "yellow"
    ],
    "size": [
      "x-large",
      "large",
      "small",
      "x-small"
    ],
    "thumbnail_url": "red-t-shirt_4460x4460.jpg",
    "image_url": "red-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 178,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Fitted T-Shirt",
    "brand": "Hipcrave",
    "price_sale": 22.99,
    "price_actual": 47.99,
    "price_savings": 25,
    "short_desc": "Pickled put a bird on it man braid, intelligentsia retro art party quinoa shoreditch readymade. Hoodie yuccie selfies, microdosing pickled neutra deep v kitsch sriracha letterpress cold-pressed offal next...",
    "long_desc": "Pickled put a bird on it man braid, intelligentsia retro art party quinoa shoreditch readymade. Hoodie yuccie selfies, microdosing pickled neutra deep v kitsch sriracha letterpress cold-pressed offal next level +1. Shabby chic raclette affogato pork belly meditation whatever. Meh intelligentsia church-key, kinfolk ramps hell of direct trade seitan mixtape pinterest XOXO marfa.",
    "rating": 4.1,
    "rating_count": 84,
    "color": [
      "yellow",
      "red",
      "green"
    ],
    "size": [
      "x-large",
      "x-small",
      "medium",
      "large"
    ],
    "thumbnail_url": "red-t-shirt_4460x4460.jpg",
    "image_url": "red-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 179,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Sweaters and Cardigans",
    "product_name": "Merino Sweater",
    "brand": "Bouture",
    "price_sale": 44.99,
    "price_actual": 62.99,
    "price_savings": 18,
    "short_desc": "Messenger bag lyft franzen, synth raw denim viral unicorn knausgaard irony hell of leggings selvage yr. Microdosing woke single-origin coffee skateboard hella slow-carb. Vegan tousled irony occupy asymmetrical...",
    "long_desc": "Messenger bag lyft franzen, synth raw denim viral unicorn knausgaard irony hell of leggings selvage yr. Microdosing woke single-origin coffee skateboard hella slow-carb. Vegan tousled irony occupy asymmetrical retro you probably haven't heard of them try-hard typewriter selfies air plant. Roof party four loko schlitz DIY chia.",
    "rating": 4,
    "rating_count": 92,
    "color": [
      "blue",
      "yellow",
      "red"
    ],
    "size": [
      "small",
      "medium",
      "x-small",
      "x-large"
    ],
    "thumbnail_url": "purple-t-shirt_4460x4460.jpg",
    "image_url": "purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 180,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Knit T-Shirt",
    "brand": "Knitage",
    "price_sale": 41.99,
    "price_actual": 54.99,
    "price_savings": 13,
    "short_desc": "90's lyft butcher scenester williamsburg cornhole. La croix yr small batch, brooklyn schlitz hammock before they sold out jean shorts leggings portland vinyl synth shaman blue bottle bushwick. Schlitz...",
    "long_desc": "90's lyft butcher scenester williamsburg cornhole. La croix yr small batch, brooklyn schlitz hammock before they sold out jean shorts leggings portland vinyl synth shaman blue bottle bushwick. Schlitz church-key artisan fanny pack palo santo. Pork belly selfies ennui tacos, woke raw denim fam hell of polaroid 8-bit kogi butcher lyft readymade.",
    "rating": 3.2,
    "rating_count": 73,
    "color": [
      "yellow",
      "blue"
    ],
    "size": [
      "medium",
      "x-large"
    ],
    "thumbnail_url": "teal-t-shirt_4460x4460.jpg",
    "image_url": "teal-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 181,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Sweaters and Cardigans",
    "product_name": "Hooded Sweatshirt",
    "brand": "Knitage",
    "price_sale": 30.99,
    "price_actual": 53.99,
    "price_savings": 23,
    "short_desc": "Man braid affogato pour-over sartorial leggings tumblr irony aesthetic authentic umami chartreuse gochujang. Sustainable gastropub fingerstache, blog literally activated charcoal small batch skateboard...",
    "long_desc": "Man braid affogato pour-over sartorial leggings tumblr irony aesthetic authentic umami chartreuse gochujang. Sustainable gastropub fingerstache, blog literally activated charcoal small batch skateboard thundercats. Bitters food truck pok pok pinterest umami kogi succulents kitsch, air plant iceland. Tumblr irony hoodie hell of vegan. Four dollar toast yuccie YOLO mumblecore.",
    "rating": 2.5,
    "rating_count": 94,
    "color": [
      "red",
      "green"
    ],
    "size": [
      "small",
      "medium",
      "large",
      "x-large"
    ],
    "thumbnail_url": "red-t-shirt_4460x4460.jpg",
    "image_url": "red-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 182,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Short Sleeved T-Shirt",
    "brand": "Bouture",
    "price_sale": 11.99,
    "price_actual": 24.99,
    "price_savings": 13,
    "short_desc": "Artisan woke tattooed health goth 3 wolf moon fingerstache umami lumbersexual stumptown godard deep v air plant. Truffaut slow-carb put a bird on it aesthetic scenester meh blue bottle squid keytar banh...",
    "long_desc": "Artisan woke tattooed health goth 3 wolf moon fingerstache umami lumbersexual stumptown godard deep v air plant. Truffaut slow-carb put a bird on it aesthetic scenester meh blue bottle squid keytar banh mi master cleanse YOLO. Fashion axe celiac kogi heirloom, tilde pinterest prism viral organic palo santo green juice venmo thundercats.",
    "rating": 3.2,
    "rating_count": 195,
    "color": [
      "blue",
      "green",
      "red"
    ],
    "size": [
      "x-large",
      "large"
    ],
    "thumbnail_url": "cobalt-blue-t-shirt_4460x4460.jpg",
    "image_url": "cobalt-blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 183,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Square Neck Tunic",
    "brand": "Wovest",
    "price_sale": 42.99,
    "price_actual": 59.99,
    "price_savings": 17,
    "short_desc": "Gluten-free hella unicorn glossier taiyaki bespoke skateboard bushwick godard organic ugh single-origin coffee artisan VHS chia. Vaporware crucifix farm-to-table you probably haven't heard of them. Truffaut...",
    "long_desc": "Gluten-free hella unicorn glossier taiyaki bespoke skateboard bushwick godard organic ugh single-origin coffee artisan VHS chia. Vaporware crucifix farm-to-table you probably haven't heard of them. Truffaut irony cloud bread try-hard.",
    "rating": 4.1,
    "rating_count": 94,
    "color": [
      "blue",
      "red",
      "green"
    ],
    "size": [
      "x-large",
      "x-small",
      "small",
      "medium"
    ],
    "thumbnail_url": "blue-t-shirt_4460x4460.jpg",
    "image_url": "blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 184,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Smocked Blouse",
    "brand": "Frockzy",
    "price_sale": 27.99,
    "price_actual": 41.99,
    "price_savings": 14,
    "short_desc": "Artisan viral umami ennui, yuccie hella prism copper mug. Pug food truck bicycle rights unicorn, lyft glossier raw denim raclette man bun blog hell of. Fashion axe offal hexagon shaman DIY, ramps live-edge...",
    "long_desc": "Artisan viral umami ennui, yuccie hella prism copper mug. Pug food truck bicycle rights unicorn, lyft glossier raw denim raclette man bun blog hell of. Fashion axe offal hexagon shaman DIY, ramps live-edge small batch mumblecore 90's gastropub. +1 biodiesel etsy cold-pressed, DIY distillery tattooed semiotics cloud bread organic kogi kale chips subway tile PBR&B messenger bag. Mumblecore forage tote bag echo park iceland williamsburg asymmetrical.",
    "rating": 2.9,
    "rating_count": 87,
    "color": [
      "blue",
      "yellow",
      "green"
    ],
    "size": [
      "small",
      "large"
    ],
    "thumbnail_url": "blue-t-shirt_4460x4460.jpg",
    "image_url": "blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 185,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Square Neck T-Shirt",
    "brand": "Hipcrave",
    "price_sale": 13.99,
    "price_actual": 26.99,
    "price_savings": 13,
    "short_desc": "Lomo celiac hexagon hashtag thundercats brunch fingerstache forage PBR&B live-edge. Migas four loko mumblecore tacos, synth forage asymmetrical kogi 3 wolf moon. Polaroid tattooed man braid subway tile,...",
    "long_desc": "Lomo celiac hexagon hashtag thundercats brunch fingerstache forage PBR&B live-edge. Migas four loko mumblecore tacos, synth forage asymmetrical kogi 3 wolf moon. Polaroid tattooed man braid subway tile, williamsburg four dollar toast fanny pack gochujang. Dreamcatcher cray four dollar toast chicharrones iceland. Pok pok blog XOXO banh mi mixtape hot chicken plaid gochujang.",
    "rating": 3.9,
    "rating_count": 44,
    "color": [
      "yellow",
      "blue",
      "red"
    ],
    "size": [
      "small",
      "x-small",
      "x-large"
    ],
    "thumbnail_url": "red-t-shirt_4460x4460.jpg",
    "image_url": "red-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 186,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "V-Neck T-Shirt",
    "brand": "Hipcrave",
    "price_sale": 20.99,
    "price_actual": 40.99,
    "price_savings": 20,
    "short_desc": "Jianbing readymade church-key helvetica. Venmo palo santo blue bottle artisan, selfies bespoke sartorial mixtape tumeric. Vinyl cred heirloom, fanny pack chambray locavore bushwick four loko meggings pop-up....",
    "long_desc": "Jianbing readymade church-key helvetica. Venmo palo santo blue bottle artisan, selfies bespoke sartorial mixtape tumeric. Vinyl cred heirloom, fanny pack chambray locavore bushwick four loko meggings pop-up. Wayfarers chia before they sold out, adaptogen gentrify etsy waistcoat subway tile viral hashtag. Tattooed taxidermy narwhal raclette, jean shorts prism messenger bag blog waistcoat wayfarers air plant pickled fixie lomo.",
    "rating": 4.4,
    "rating_count": 58,
    "color": [
      "red",
      "blue",
      "yellow"
    ],
    "size": [
      "x-small",
      "large"
    ],
    "thumbnail_url": "blue-t-shirt_4460x4460.jpg",
    "image_url": "blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 187,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Pleated T-Shirt",
    "brand": "Hipcrave",
    "price_sale": 45.99,
    "price_actual": 85.99,
    "price_savings": 40,
    "short_desc": "Fashion axe tumeric raclette actually vape letterpress tbh hell of health goth. Ethical la croix iPhone sustainable four dollar toast cronut freegan selfies poutine quinoa glossier pabst food truck austin...",
    "long_desc": "Fashion axe tumeric raclette actually vape letterpress tbh hell of health goth. Ethical la croix iPhone sustainable four dollar toast cronut freegan selfies poutine quinoa glossier pabst food truck austin dreamcatcher.",
    "rating": 2.7,
    "rating_count": 195,
    "color": [
      "yellow",
      "green",
      "red"
    ],
    "size": [
      "medium",
      "large"
    ],
    "thumbnail_url": "cobalt-blue-t-shirt_4460x4460.jpg",
    "image_url": "cobalt-blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 188,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "High Neck Top",
    "brand": "Coutique",
    "price_sale": 46.99,
    "price_actual": 66.99,
    "price_savings": 20,
    "short_desc": "Truffaut man braid heirloom af bespoke asymmetrical. Trust fund umami gastropub unicorn drinking vinegar. Truffaut poke beard, whatever drinking vinegar fam hell of man bun schlitz bicycle rights coloring...",
    "long_desc": "Truffaut man braid heirloom af bespoke asymmetrical. Trust fund umami gastropub unicorn drinking vinegar. Truffaut poke beard, whatever drinking vinegar fam hell of man bun schlitz bicycle rights coloring book hashtag chartreuse. Aesthetic truffaut kitsch, poutine chillwave meh semiotics squid.",
    "rating": 2.4,
    "rating_count": 36,
    "color": [
      "red",
      "blue",
      "green"
    ],
    "size": [
      "medium",
      "large",
      "x-small",
      "small"
    ],
    "thumbnail_url": "grey-t-shirt_4460x4460.jpg",
    "image_url": "grey-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 189,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Sweaters and Cardigans",
    "product_name": "Wool Sweater",
    "brand": "Wovest",
    "price_sale": 13.99,
    "price_actual": 19.99,
    "price_savings": 6,
    "short_desc": "Narwhal echo park fashion axe try-hard prism chambray woke gastropub hexagon. Jean shorts adaptogen shabby chic waistcoat locavore single-origin coffee freegan try-hard cardigan mlkshk aesthetic unicorn....",
    "long_desc": "Narwhal echo park fashion axe try-hard prism chambray woke gastropub hexagon. Jean shorts adaptogen shabby chic waistcoat locavore single-origin coffee freegan try-hard cardigan mlkshk aesthetic unicorn. Glossier fanny pack portland austin retro squid cliche shaman schlitz kale chips listicle seitan vegan everyday carry XOXO. Bicycle rights bushwick scenester twee roof party shoreditch chillwave thundercats distillery dreamcatcher tacos mlkshk austin.",
    "rating": 5,
    "rating_count": 130,
    "color": [
      "blue",
      "green",
      "yellow"
    ],
    "size": [
      "x-small",
      "large",
      "x-large",
      "small"
    ],
    "thumbnail_url": "green-t-shirt_4460x4460.jpg",
    "image_url": "green-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 190,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Drapey Shirt",
    "brand": "Garmtech",
    "price_sale": 38.99,
    "price_actual": 53.99,
    "price_savings": 15,
    "short_desc": "Mustache marfa narwhal portland pitchfork fixie tote bag authentic asymmetrical prism. Wayfarers neutra retro pour-over distillery cardigan tote bag pork belly ethical church-key unicorn +1 tofu af health...",
    "long_desc": "Mustache marfa narwhal portland pitchfork fixie tote bag authentic asymmetrical prism. Wayfarers neutra retro pour-over distillery cardigan tote bag pork belly ethical church-key unicorn +1 tofu af health goth. Pork belly 3 wolf moon hammock, tote bag sriracha food truck VHS jianbing godard cornhole chia gochujang yuccie taiyaki.",
    "rating": 3.1,
    "rating_count": 61,
    "color": [
      "green",
      "blue",
      "red"
    ],
    "size": [
      "medium",
      "small"
    ],
    "thumbnail_url": "purple-t-shirt_4460x4460.jpg",
    "image_url": "purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 191,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Sweaters and Cardigans",
    "product_name": "Cozy Sweatshirt",
    "brand": "Coutique",
    "price_sale": 69.99,
    "price_actual": 87.99,
    "price_savings": 18,
    "short_desc": "Dreamcatcher leggings fixie fashion axe bicycle rights hoodie. Affogato helvetica pok pok, letterpress crucifix meggings drinking vinegar leggings. Quinoa pinterest green juice sustainable next level,...",
    "long_desc": "Dreamcatcher leggings fixie fashion axe bicycle rights hoodie. Affogato helvetica pok pok, letterpress crucifix meggings drinking vinegar leggings. Quinoa pinterest green juice sustainable next level, forage hell of semiotics crucifix taiyaki typewriter lo-fi gentrify shaman mumblecore. Cornhole marfa wolf bespoke asymmetrical beard ramps yuccie hella roof party air plant.",
    "rating": 4.9,
    "rating_count": 113,
    "color": [
      "blue",
      "green"
    ],
    "size": [
      "x-small",
      "small",
      "large"
    ],
    "thumbnail_url": "purple-t-shirt_4460x4460.jpg",
    "image_url": "purple-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 192,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Sleeveless Button-up Shirt",
    "brand": "Knitage",
    "price_sale": 67.99,
    "price_actual": 86.99,
    "price_savings": 19,
    "short_desc": "Succulents aesthetic wayfarers, celiac synth vaporware quinoa disrupt unicorn iPhone. Occupy leggings literally, keytar kogi actually mustache. Flexitarian cardigan adaptogen listicle air plant taiyaki....",
    "long_desc": "Succulents aesthetic wayfarers, celiac synth vaporware quinoa disrupt unicorn iPhone. Occupy leggings literally, keytar kogi actually mustache. Flexitarian cardigan adaptogen listicle air plant taiyaki. Intelligentsia unicorn thundercats farm-to-table, organic church-key jianbing fashion axe fixie readymade typewriter.",
    "rating": 3.5,
    "rating_count": 121,
    "color": [
      "yellow",
      "blue",
      "red"
    ],
    "size": [
      "x-small",
      "medium",
      "small"
    ],
    "thumbnail_url": "teal-t-shirt_4460x4460.jpg",
    "image_url": "teal-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 193,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Drapey T-Shirt",
    "brand": "Bouture",
    "price_sale": 38.99,
    "price_actual": 56.99,
    "price_savings": 18,
    "short_desc": "Biodiesel shabby chic cliche vaporware. Snackwave four loko cardigan gastropub, fixie crucifix adaptogen poke fam seitan yr. Letterpress gluten-free portland tumblr roof party freegan ramps. Fanny pack...",
    "long_desc": "Biodiesel shabby chic cliche vaporware. Snackwave four loko cardigan gastropub, fixie crucifix adaptogen poke fam seitan yr. Letterpress gluten-free portland tumblr roof party freegan ramps. Fanny pack poutine taxidermy raclette vexillologist, offal schlitz mixtape.",
    "rating": 4,
    "rating_count": 41,
    "color": [
      "red",
      "blue"
    ],
    "size": [
      "x-small",
      "x-large"
    ],
    "thumbnail_url": "light-green-t-shirt_4460x4460.jpg",
    "image_url": "light-green-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 194,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Sleeveless Top",
    "brand": "Hipcrave",
    "price_sale": 23.99,
    "price_actual": 35.99,
    "price_savings": 12,
    "short_desc": "Drinking vinegar slow-carb put a bird on it actually hammock. Schlitz marfa tumeric austin meh small batch cliche jean shorts. Activated charcoal bitters disrupt banjo tote bag raw denim gochujang organic...",
    "long_desc": "Drinking vinegar slow-carb put a bird on it actually hammock. Schlitz marfa tumeric austin meh small batch cliche jean shorts. Activated charcoal bitters disrupt banjo tote bag raw denim gochujang organic migas slow-carb ethical. Kinfolk organic gochujang lumbersexual. Chia affogato flexitarian fanny pack shabby chic copper mug. Keytar single-origin coffee normcore health goth.",
    "rating": 4.6,
    "rating_count": 154,
    "color": [
      "yellow",
      "red"
    ],
    "size": [
      "x-small",
      "x-large",
      "small",
      "medium"
    ],
    "thumbnail_url": "grey-t-shirt_4460x4460.jpg",
    "image_url": "grey-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 195,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Sleeveless Wrap Top",
    "brand": "Frockzy",
    "price_sale": 33.99,
    "price_actual": 46.99,
    "price_savings": 13,
    "short_desc": "Cardigan fingerstache vice, distillery vaporware photo booth keffiyeh. Godard vice pok pok quinoa. Four dollar toast cloud bread pork belly, offal fashion axe shaman kogi bicycle rights you probably haven't...",
    "long_desc": "Cardigan fingerstache vice, distillery vaporware photo booth keffiyeh. Godard vice pok pok quinoa. Four dollar toast cloud bread pork belly, offal fashion axe shaman kogi bicycle rights you probably haven't heard of them stumptown iceland. Freegan chillwave food truck lomo typewriter forage raclette bicycle rights tacos fixie try-hard marfa four loko scenester gentrify.",
    "rating": 4.1,
    "rating_count": 181,
    "color": [
      "yellow",
      "green",
      "red"
    ],
    "size": [
      "large",
      "x-large",
      "small",
      "x-small"
    ],
    "thumbnail_url": "red-t-shirt_4460x4460.jpg",
    "image_url": "red-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 196,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Short Sleeved Shirt",
    "brand": "Bouture",
    "price_sale": 47.99,
    "price_actual": 76.99,
    "price_savings": 29,
    "short_desc": "Irony artisan gluten-free cold-pressed vaporware tattooed, kogi edison bulb af chicharrones forage intelligentsia kombucha hot chicken try-hard. Ramps trust fund fanny pack pug poutine microdosing tattooed...",
    "long_desc": "Irony artisan gluten-free cold-pressed vaporware tattooed, kogi edison bulb af chicharrones forage intelligentsia kombucha hot chicken try-hard. Ramps trust fund fanny pack pug poutine microdosing tattooed pitchfork vape dreamcatcher drinking vinegar banh mi copper mug disrupt actually. Neutra palo santo man bun chia photo booth master cleanse ramps echo park heirloom cornhole.",
    "rating": 3.2,
    "rating_count": 145,
    "color": [
      "blue",
      "red",
      "yellow"
    ],
    "size": [
      "medium",
      "large",
      "small",
      "x-small"
    ],
    "thumbnail_url": "cobalt-blue-t-shirt_4460x4460.jpg",
    "image_url": "cobalt-blue-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 197,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Smocked Peasant Top",
    "brand": "Bouture",
    "price_sale": 49.99,
    "price_actual": 71.99,
    "price_savings": 22,
    "short_desc": "Chambray ennui distillery vice, bespoke slow-carb helvetica. Vexillologist palo santo authentic, listicle 8-bit fanny pack food truck bushwick pok pok. Photo booth bushwick jean shorts, austin actually...",
    "long_desc": "Chambray ennui distillery vice, bespoke slow-carb helvetica. Vexillologist palo santo authentic, listicle 8-bit fanny pack food truck bushwick pok pok. Photo booth bushwick jean shorts, austin actually wolf selvage. Helvetica next level brunch four dollar toast poutine messenger bag mustache sriracha try-hard selfies copper mug scenester cold-pressed mlkshk chillwave.",
    "rating": 2.9,
    "rating_count": 172,
    "color": [
      "green",
      "red",
      "blue"
    ],
    "size": [
      "x-small",
      "x-large",
      "medium",
      "large"
    ],
    "thumbnail_url": "light-green-t-shirt_4460x4460.jpg",
    "image_url": "light-green-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 198,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Fitted Tunic",
    "brand": "Knitage",
    "price_sale": 36.99,
    "price_actual": 56.99,
    "price_savings": 20,
    "short_desc": "Umami green juice put a bird on it bicycle rights street art lo-fi. Hoodie iPhone hashtag neutra, trust fund ethical williamsburg austin drinking vinegar crucifix. Lo-fi mixtape XOXO retro. Truffaut slow-carb...",
    "long_desc": "Umami green juice put a bird on it bicycle rights street art lo-fi. Hoodie iPhone hashtag neutra, trust fund ethical williamsburg austin drinking vinegar crucifix. Lo-fi mixtape XOXO retro. Truffaut slow-carb put a bird on it aesthetic scenester meh blue bottle squid keytar banh mi master cleanse YOLO. Fashion axe celiac kogi heirloom, tilde pinterest prism viral organic palo santo green juice venmo thundercats.",
    "rating": 4.7,
    "rating_count": 92,
    "color": [
      "green",
      "red",
      "yellow"
    ],
    "size": [
      "x-large",
      "medium"
    ],
    "thumbnail_url": "red-t-shirt_4460x4460.jpg",
    "image_url": "red-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 199,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "Blouses",
    "product_name": "Floral-print Wrap Top",
    "brand": "Hipcrave",
    "price_sale": 15.99,
    "price_actual": 28.99,
    "price_savings": 13,
    "short_desc": "Hot chicken shaman banh mi, pok pok green juice tote bag taxidermy photo booth freegan. Lumbersexual affogato vaporware adaptogen. Godard normcore kinfolk af poutine farm-to-table. Paleo succulents edison...",
    "long_desc": "Hot chicken shaman banh mi, pok pok green juice tote bag taxidermy photo booth freegan. Lumbersexual affogato vaporware adaptogen. Godard normcore kinfolk af poutine farm-to-table. Paleo succulents edison bulb, farm-to-table mumblecore umami cloud bread. Sartorial hell of +1 activated charcoal cornhole leggings put a bird on it kitsch franzen raclette man bun.",
    "rating": 3.4,
    "rating_count": 68,
    "color": [
      "blue",
      "green",
      "red"
    ],
    "size": [
      "x-small",
      "small",
      "x-large",
      "large"
    ],
    "thumbnail_url": "light-green-t-shirt_4460x4460.jpg",
    "image_url": "light-green-t-shirt_4460x4460.jpg"
  },
  {
    "product_id": 200,
    "category": "Women",
    "subcategory": "Women’s Tops",
    "product_type": "T-Shirts",
    "product_name": "Short Sleeved T-Shirt",
    "brand": "Knitage",
    "price_sale": 23.99,
    "price_actual": 42.99,
    "price_savings": 19,
    "short_desc": "Swag cred pop-up try-hard sriracha four loko neutra farm-to-table. Vaporware 8-bit fam freegan neutra cloud bread gentrify cray la croix. Tumblr cliche letterpress banh mi YOLO, air plant pop-up tbh fingerstache...",
    "long_desc": "Swag cred pop-up try-hard sriracha four loko neutra farm-to-table. Vaporware 8-bit fam freegan neutra cloud bread gentrify cray la croix. Tumblr cliche letterpress banh mi YOLO, air plant pop-up tbh fingerstache iceland mixtape pour-over freegan. Cliche drinking vinegar pork belly locavore tumeric jianbing viral mumblecore quinoa shoreditch master cleanse photo booth keytar.",
    "rating": 2.2,
    "rating_count": 54,
    "color": [
      "yellow",
      "green"
    ],
    "size": [
      "x-small",
      "large"
    ],
    "thumbnail_url": "green-t-shirt_4460x4460.jpg",
    "image_url": "green-t-shirt_4460x4460.jpg"
  }
]